Repository: GabrieleGiuseppini/Floating-Sandbox
Catalog: Localization/*/ui_strings.po
Languages: es, it, pt_br, ru, uk

source: Sets a cap to the maximum number of threads used for the simulation.
es: Impone un limite de cuantos hilos se pueden usar para la simulación.
it: Imposta un massimo al numero di threads utilizzati per la simulazione.
pt_br: Define um limite máximo para o número de threads utilizadas na simulação.
ru: Устанавливает ограничение на максимальное количество потоков, используемых для моделирования.
uk: Встановлює обмеження на максимальну кількість потоків, що використовуються для симуляції.

source: Sets a predefined color for the canvas background.
es: Establece un color predeterminado para el fondo del lienzo.
it: Imposta un colore predefinito per lo sfondo.
pt_br: Define uma cor pré-definida para o fundo da tela.
ru: Устанавливает предопределенный цвет для фона холста.
uk: Встановлює зумовлений колір для фону полотна.

source: Sets the color of anonymous NPCs.
es: Establece el color de los NPCs anónimos.
it: Imposta il colore degli NPC anonimi.
pt_br: Define a cor dos NPC's anônimos.
ru: Устанавливает цвет анонимных НИПов.
uk: Встановлює колір анонімних НПС.

source: Sets the color of lamp lights.
es: Establece el color de las luces de las lamparas.
it: Imposta il colore della luce delle lampade.
pt_br: Define a cor das luzes das lâmpadas.
ru: Устанавливает цвет свечения лампы.
uk: Встановлює колір світіння лампи.

source: Sets the color of the canvas background.
es: Establece el color del fondo del lienzo.
it: Imposta il colore dello sfondo.
pt_br: Define a cor do fundo da tela.
ru: Устанавливает цвет фона холста.
uk: Встановлює колір фону полотна.

source: Sets the color of the moon's light.
es: Establece el color de la luz de la luna.
it: Imposta il colore della luce lunare.
pt_br: Define a cor da luz da Lua.
ru: Задает цвет света луны.
uk: Задає колір місячного світла.

source: Sets the color of water which is used when ocean render mode is set to 'Texture'.
es: Establece el color del agua el cual es usado cuando el renderizado del agua es colocado en "Textura".
it: Imposta il colore dell'acqua utilizzato quando la modalità di visualizzazione è 'Texture'.
pt_br: Define a cor da água utilizada quando o modo de renderização do oceano está definido como ‘Textura’.
ru: Устанавливает цвет воды, который используется, когда режим рендеринга океана установлен на «Текстура».
uk: Встановлює колір води, який використовується, коли режим рендерингу океану встановлено на "Текстура".

source: Sets the crepuscolar overtone of the sky.
es: Establece el tono crepuscular del cielo.
it: Imposta la tonalità del gradiente crepuscolare.
pt_br: Ajusta a tonalidade e intensidade do efeito crepuscular aplicado ao céu.
ru: Задает сумеречный тон неба.
uk: Задає сутінковий відтінок неба.

source: Sets the directory into which in-game screenshots are automatically saved.
es: Establece el directorio donde las capturas de pantalla del juego son automáticamente guardadas.
it: Imposta la cartella nella quale vengono salvati gli screenshot.
pt_br: Define o diretório no qual as capturas de tela do jogo são salvas automaticamente.
ru: Задает каталог, в который автоматически сохраняются внутриигровые скриншоты.
uk: Задає каталог, у який автоматично зберігаються внутрішньоігрові скріншоти.

source: Sets the ending (bottom) color of the gradient.
es: Establece el fin (Fondo) del gradiente de color.
it: Imposta il colore finale del gradiente.
pt_br: Define a cor final (inferior) do gradiente.
ru: Задает конечный (нижний) цвет градиента.
uk: Задає кінцевий (нижній) колір градієнта.

source: Sets the single color of the ocean floor.
es: Establece el color único del fondo oceánico.
it: Imposta il colore a tinta unita del fondale oceanico.
pt_br: Define a cor única do fundo do oceano.
ru: Задает единый цвет океанского дна.
uk: Задає єдиний колір океанського дна.

source: Sets the single color of the ocean.
es: Establecer el color único del océano.
it: Imposta il colore a tinta unita dell'oceano.
pt_br: Define a cor única do oceano.
ru: Задает единый цвет океана.
uk: Задає єдиний колір океану.

source: Sets the single color of the sky.
es: Establece el color único del cielo.
it: Imposta il colore a tinta unita del cielo.
pt_br: Define a cor única do céu.
ru: Задает единый цвет неба.
uk: Задає єдиний колір неба.

source: Sets the starting (top) color of the gradient.
es: Establece el inicio (Parte superior) del color del gradiente.
it: Imposta il colore iniziale del gradiente.
pt_br: Define a cor inicial (superior) do gradiente.
ru: Задает начальный (верхний) цвет градиента.
uk: Задає початковий (верхній) колір градієнта.

source: Sets the texture to use for the ocean floor.
es: Establece la textura para usar como fondo oceánico.
it: Imposta la texture per il fondale oceanico.
pt_br: Define a textura a ser usada para o fundo do oceano.
ru: Задает текстуру для использования на дне океана.
uk: Встановлює текстуру для дна океану.

source: Sets the texture to use for the ocean.
es: Establece la textura para utilizar de océano.
it: Imposta la texture per l'oceano.
pt_br: Define a textura a ser usada para o oceano.
ru: Задает текстуру для использования в океане.
uk: Встановлює текстуру, яку буде використано для океану.

source: Sets the units system to use when displaying physical quantities.
es: Establece el sistema de unidades cuando se muestran cantidades físicas.
it: Imposta il sistema di unità di misura per la visualizzazione di quantità fisiche.
pt_br: Define o sistema de unidades a ser usado ao exibir grandezas físicas.
ru: Устанавливает систему единиц, используемую при отображении физических величин.
uk: Встановлює систему одиниць, що використовується під час відображення фізичних величин.

source: Sets wind speed to zero.
es: Coloca la velocidad del viento a cero.
it: Imposta la velocità del vento a zero.
pt_br: Reduz a velocidade do vento para zero.
ru: Установить скорость ветра на ноль.
uk: Встановити швидкість вітру на нуль.

source: Settings "%s" already exist; do you want to replace them with the current settings?
es: Esta Configuración %s ya existen; ¿estas seguro de que quieres sobrescribirlas con las actuales?
it: Esiste già un set di parametri chiamato "%s"; volete sostituirli con i parametri correnti?
pt_br: As configurações '%s' já existem; você deseja substituí-las pelas configurações atuais?
ru: Настройки "%s " уже существуют; вы хотите заменить их текущими настройками?
uk: Налаштування "%s " вже існують; ви хочете замінити їх поточними налаштуваннями?

source: Settings Management
es: Administrador de Configuraciones
it: Gestione parametri salvati
pt_br: Gerenciamento de Configurações
ru: Управление Настройками
uk: Керування Налаштуваннями

source: Ship
es: Barco
it: Nave
pt_br: Navio/Objeto
ru: Корабль
uk: Корабель

source: Ship Debug Draw Options
es: Opción de depuración de dibujado de barco
it: Visualizzazione debug navi
pt_br: Opções de Renderização de Depuração dos Navios
ru: Параметры Чертежа Отладки Корабля
uk: Параметри Креслення Налагодження Корабля

source: Ship Issues
es: Problemas del barco
it: Problemi
pt_br: Problemas deste navio/objeto
ru: Судовые вопросы
uk: Суднові питання

source: Ship Name
es: Nombre del barco
it: Nome
pt_br: Nome do navio/objeto
ru: Название Корабля
uk: Назва Корабля

source: Ship Properties
es: Propiedades del barco
it: Proprietà
pt_br: Propriedades do navio/objeto
ru: Свойства Корабля
uk: Властивості Корабля

source: Ship files
es: Archivos de barco
it: File navi
pt_br: Arquivos do navio/objeto
ru: Файлы корабля
uk: Файли корабля

source: Ships
es: Barcos
it: Navi
pt_br: Navio/Objeto
ru: Корабли
uk: Кораблі

source: Shoal Radius Adjust
es: Ajuste de radio de los cardumenes
it: Dimensioni branco
pt_br: Ajuste do Raio de distância dos Cardumes
ru: Регулировка радиуса мелководья
uk: Регулювання радіуса мілководдя

source: Show AABBs
es: Mostrar CDAEs
it: Mostra AABBs
pt_br: Mostrar AABBs
ru: Показать AABB
uk: Показати AABB

source: Show Electrical Notifications
es: Mostrar notificaciones electricas
it: Mostra notifiche elementi elettrici
pt_br: Mostrar Notificações sobre Elementos Elétricos
ru: Показать электрические уведомления
uk: Показати електричні повідомлення

source: Show Extended Status Text
es: Mostrar texto de estatus extendido
it: Informazioni diagnostiche addizionali
pt_br: Mostrar Texto de Status Estendido
ru: Показать расширенный текст состояния
uk: Показати розширений текст стану

source: Show Frontiers
es: Mostrar Fronteras
it: Mostra bordi
pt_br: Mostrar Limites Extruturais
ru: Показать границы
uk: Показати межі

source: Show NPC Notifications
es: Mostrar notificaciones de NPC
it: Mostra notifiche NPC
pt_br: Mostrar Notificações sobre os NPC's
ru: Показывать Уведомления О НИПов
uk: Показати сповіщення НПС

source: Show Probe Panel
es: Mostrar panel de sondeado
it: Grafici
pt_br: Mostrar Painel de Sonda
ru: Показать панель зонда
uk: Показати панель зонда

source: Show Ship Descriptions at Load
es: Mostrar Descripciones de los barcos al cargar
it: Mostra descrizioni navi
pt_br: Mostar as Dexcrições dos navios ao iniciar
ru: Показать описание судна при загрузке
uk: Показати опис судна під час завантаження

source: Show Status Text
es: Mostrar texto de estatus
it: Informazioni diagnostiche
pt_br: Mostrar texto de Status
ru: Показать текст статуса
uk: Показати текст статусу

source: Show Stress
es: Mostrar estres
it: Visualizza stress
pt_br: Mostrar Estresse dos Materiais
ru: Показать Стресс
uk: Показати Стрес

source: Show Tips on Startup
es: Mostrar consejos al iniciar
it: Mostra suggerimenti all'avvio
pt_br: Mostrar dicas ao iniciar
ru: Показывать советы при запуске
uk: Показувати поради під час запуску

source: Show Tsunami Notifications
es: Mostrar notificaciones de tsunami
it: Mostra notifiche tsunami
pt_br: Mostrar Notificações sobre os Tsunamis
ru: Показывать Уведомления О Цунами
uk: Показувати Повідомлення Про Цунамі

source: Show credits and other I'vedunnit stuff
es: Mostrar créditos y otras cosas de I'vedunnit
it: Mostra i titoli di coda
pt_br: Mostrar créditos e outras coisas de 'Eu que fiz'
ru: Показать авторов и прочее
uk: Показувати Повідомлення Про Цунамі

source: Shows the ship either behind the sea water or in front of it.
es: Muestra el barco detrás o por delante del agua.
it: Visualizza la nave dietro all'acqua di mare o di fronte ad essa.
pt_br: Exibe os navios atrás ou à frente da água do mar.
ru: Показывает корабль за морской водой или перед ней.
uk: Показує корабель за морською водою або перед нею.

source: Side-Effects
es: Efectos secundarios
it: Effetti collaterali
pt_br: Efeitos Adicionais
ru: Побочные явления
uk: Побічні явища

source: Silt Hardness
es: Dureza de la abertura
it: Durezza sedimento
pt_br: Dureza do Silte
ru: Иловая твердость
uk: Мулова твердість

source: Simulation Settings
es: Configuración de la simulacion
it: Parametri simulazione
pt_br: Configurações da Simulação
ru: Настройки Моделирования
uk: Налаштування Моделювання

source: Simulation Settings...
es: Configuración de la simulación...
it: Parametri simulatore...
pt_br: Configurações da Simulação...
ru: Параметры Моделирования...
uk: Параметри Моделювання...

source: Size
es: Tamaño
it: Dimensioni
pt_br: Tamanho
ru: Размер
uk: Розмір

source: Size Multiplier
es: Multiplicador de el tamaño
it: Moltiplicatore dimensioni
pt_br: Multiplicador de Tamanho
ru: Множитель размера
uk: Множник розміру

source: Sky
es: Cielo
it: Cielo
pt_br: Céu
ru: Небо
uk: Небо

source: Slice
es: Cortar
it: Taglia
pt_br: Serra Elétrica
ru: Пила
uk: Пила

source: Smash
es: Golpear
it: Distruggi
pt_br: Marreta
ru: Молоток
uk: Молоток

source: Smash Tool
es: Herramienta de Golpeo
it: Strumento distruggi
pt_br: Marreta
ru: Инструмент Молоток
uk: Інструмент Молоток

source: Smoke
es: Humo
it: Fumo
pt_br: Fumaça
ru: Дым
uk: Дим

source: Smoke Emitter
es: Emisor de Humo
it: Emettitore fumo
pt_br: Emissor de Fumaça
ru: Излучатель дыма
uk: Випромінювач диму

source: Smoothness Adjust
es: Ajuste de suavidad
it: Gradualità
pt_br: Ajuste de Suavidade
ru: Регулировка плавности
uk: Регулювання плавності

source: Some of the changes made will only be enforced when the next ship is loaded. Reload the ship now?
es: Algunos de los cambios realizados solo surtirán efecto cuando el próximo barco sea cargado. Desea recargar el barco?
it: Alcuni dei cambiamenti effettuati avranno effetto solamente ricaricando la nave. Ricaricare la nave ora?
pt_br: Certas modificações só entrarão em efeito após o carregamento do próximo navio. Deseja recarregar o navio imediatamente?
ru: Некоторые изменения придут в силу когда будет загружен новый корабль. Перезагрузить корабль сейчас?
uk: Деякі внесені зміни будуть застосовані лише після завантаження наступного корабля. Зараз перезавантажити корабель?

source: Sound
es: Sonido
it: Suoni
pt_br: Sons
ru: Звук
uk: Звук

source: Sound Emitter
es: Emisor de Sonido
it: Emettitore suoni
pt_br: Emissor de Som
ru: Излучатель звука
uk: Випромінювач звуку

source: Sound and Advanced Settings
es: Sonido y configuraciones avanzadas
it: Suoni e parametri speciali
pt_br: Sons e Configurações Avançadas
ru: Звук и дополнительные настройки
uk: Звук і додаткові налаштування

source: Spawn Furniture NPC Group
es: Generar grupo de muebles NPC
it: Genera gruppo NPC mobilio
pt_br: Gerar grupo mobiliário
ru: Добавить Группу Мебельных НИПов
uk: Створити групу НПС меблів

source: Spawn Furniture NPC...
es: Generar muebles NPC...
it: Genera NPC mobilio...
pt_br: Gerar mobília...
ru: Добавить Мебельных НИПов...
uk: Створити меблевий НПС...

source: Spawn Human NPC Group
es: Generar grupo humano NPC
it: Genera gruppo NPC umani
pt_br: Gerar Grupo de NPC's Humanos
ru: Добавить Группу Человеческих НИПов
uk: Створити групу людських НПС

source: Spawn Human NPC...
es: Generar humano NPC...
it: Genera NPC umano...
pt_br: Gerar NPC Humano...
ru: Добавить Человеческих НИПов…
uk: Створити людських НПС...

source: Spawn Rain
es: Generar lluvia
it: Pioggia
pt_br: Invocar Chuva
ru: Создать дождь
uk: Створити дощ

source: Specific Heat (J/(Kg*K))
es: Calor especifico (J/(Kg*K))
it: Calore specifico (J/(Kg*K))
pt_br: Calor Específico (J/(Kg*K))
ru: Удельная теплота (Дж/(кг*К))
uk: Питома теплота (Дж/(кг*К))

source: Speed Adjust
es: Ajustar la velocidad
it: Velocità
pt_br: Ajuste de Velocidade
ru: Регулировка скорости
uk: Регулювання швидкості

source: Spread
es: Dispersion
it: Diffusione
pt_br: Dispersão
ru: Разброс
uk: Розкид

source: Spread Adjust
es: Ajuste de la dispersión
it: Diffusione
pt_br: Ajuste de Dispersão
ru: Регулировка разброса
uk: Регулювання Поширення Розповсюдження

source: Spring Algo Adjust
es: Ajuste automático del resorte
it: Algoritmo molle
pt_br: Ajuste do Algoritmo das Molas
ru: Регулировка Пружины Альго
uk: Регулювання Пружини Альго

source: Spring Damping Adjust
es: Ajuste de la amortiguación del resorte
it: Smorzamento molle
pt_br: Ajuste do Amortecimento das Molas
ru: Демпфирования пружины
uk: Демпфірування пружини

source: Spring Stiffness Adjust
es: Ajuste de la rigidez del resorte
it: Rigidità molle
pt_br: Ajuste de Rigidez das Molas
ru: Жесткость пружинности
uk: Жорсткість пружності

source: Start
es: Iniciar
it: Inizia
pt_br: Iniciar
ru: Начать
uk: Почати

source: Start in Full Screen
es: Iniciar en Pantalla completa
it: Avvia a pieno schermo
pt_br: Iniciar em Tela Cheia
ru: Запуск в полноэкранном режиме
uk: Запуск у повноекранному режимі

source: Static Forces
es: Fuerzas estaticas
it: Forze statiche
pt_br: Forças Estáticas
ru: Статические силы
uk: Статичні сили

source: Static Friction Adjust
es: Ajuste de la fricción estatica
it: Attrito statico
pt_br: Ajuste das Fricções Estáticas
ru: Регулировка сопротивления статического трения
uk: Регулювання статичного тертя

source: Static Pressure Adjust
es: Ajuste de presión estática
it: Pressione statica
pt_br: Ajuste das Pressões Estáticas
ru: Регулировка статического давления
uk: Регулювання статичного тиску

source: Static Pressure Complexity
es: Complejidad de las presiones estáticas
it: Complessità pressione statica
pt_br: Complexidade das Pressões Estáticas
ru: Сложность статического давления
uk: Складність статичного тиску

source: Static Pressure Net Force
es: Fuerza Neta de la presión estática
it: Pressione statica netta
pt_br: Força Resultante das Pressões Estáticas
ru: Сила Статического Давления
uk: Сила Статичного Тиску

source: Steam
es: Vapor
it: A vapore
pt_br: Vapor
ru: Пар
uk: Пар

source: Step
es: Paso
it: Passo
pt_br: Avanço
ru: Шаг
uk: Крок

source: Step one frame at a time
es: Pasar un fotograma a la vez
it: Incrementa un frame alla volta
pt_br: Avançar um quadro por vez
ru: Шаг один кадр за раз
uk: Крок один кадр за раз

source: Stickmen With Roles
es: Hombres de palo con roles
it: Fantocci con ruoli
pt_br: Bonecos-Palito com Funções
ru: Стикманы с ролями
uk: Стікмен з ролями

source: Stiffness
es: Rigidez
it: Rigidità
pt_br: Rigidez
ru: Жесткость
uk: Жорсткість

source: Stop
es: Parar
it: Fine
pt_br: Parar
ru: Стоп
uk: Стоп

source: Storms
es: Tormentas
it: Tempeste
pt_br: Tempestades
ru: Шторм
uk: Шторм

source: Strength
es: Fuerza
it: Resistenza
pt_br: Força
ru: Прочность
uk: Міцність

source: Strength Adjust
es: Ajuste de fuerza
it: Resistenza
pt_br: Ajuste de Força
ru: Регулировка силы
uk: Регулювання сили

source: Strength Randomization
es: Randomizacion de fuerza
it: Randomizzazione resistenza
pt_br: Randomização de Força
ru: Рандомизация прочности
uk: Рандомізація міцності

source: Stress Draw Options
es: Opciones de dibujado de estres
it: Opzioni visualizzazione stress
pt_br: Opções de Renderização de Estresse dos Materiais
ru: Варианты рисования стресса
uk: Варіанти малювання стресу

source: Stress Overlay
es: Superposición del estres
it: Mappa stress
pt_br: Sobreposição de Estresse
ru: Наложение стресса
uk: Накладання стресу

source: Structural Layer
es: Capa Estructural
it: Layer strutturale
pt_br: Camada Estrutural
ru: Структурный слой
uk: Структурний шар

source: Structure-only image files
es: Archivos de imagen solamente estructurales
it: File struttura navi
pt_br: Arquivos de imagem apenas da estrutura
ru: Файлы изображений только со структурой
uk: Файли зображень тільки зі структурою

source: Success
es: Exito
it: Successo
pt_br: Sucesso
ru: Успех
uk: Успіх

source: Swirl/Counterswirl
es: Remolino/Contra remolino
it: Vortice/anti-vortice
pt_br: Redemoinho/Redemoinho inverso
ru: Завихрение/противодействие
uk: Завихрення/протидія

source: Switch Type
es: Tipo de llave
it: Tipo interruttore
pt_br: Tipo de troca
ru: Тип переключателя
uk: Тип перемикача

source: TESTING
es: VEREFICADORES
it: CONTROLLO QUALITÀ
pt_br: TESTANDO
ru: ТЕСТИРОВАНИЕ
uk: ТЕСТУВАННЯ

source: TRANSLATION
es: TRADUCCION
it: TRADUZIONE
pt_br: TRADUÇÃO
ru: ПЕРЕВОД
uk: ПЕРЕКЛАД

source: Temperature
es: Temperatura
it: Temperatura
pt_br: Temperatura
ru: Температура
uk: Температура

source: Tension Overlay
es: Superposición de la tensión
it: Mappa tensione
pt_br: Sobreposição de Tensão
ru: Наложение натяжения
uk: Накладення натягу

source: Texture
es: Textura
pt_br: Textura
ru: Текстура
uk: Текстура

source: Texture Credits
es: Créditos de las Texturas
it: Accreditamenti texture
pt_br: Créditos das Texturas
ru: Авторы на текстуру
uk: Автори на текстуру

source: Texture Magnification
es: Aumento de las texturas
it: Scala texture
pt_br: Magnificação d Textura
ru: Увеличение текстуры
uk: Збільшення текстури

source: Texture Transparency
es: Transparencia de las texturas
it: Trasparenza texture
pt_br: Transparência da Textura
ru: Прозрачность текстуры
uk: Прозорість текстури

source: Texture mode: view ship with exterior texture.
es: Modo de texturas: ver el barco con la textura exterior.
it: Modalità texture: visualizza la nave con la texture esteriore.
pt_br: Modo textura: visualizar o navio com a textura externa.
ru: Режим текстуры: просмотр корабля с наружной текстурой.
uk: Режим текстури: дивіться корабель із зовнішньою текстурою.

source: Thanos' Snap
es: Chasquido de Thanos
it: Snap di Thanos
pt_br: Estalo do Thanos
ru: Щелчок Таноса
uk: Клацання Таноса

source: The amplitude of wind gusts, as a multiplier of the base wind speed.
es: Amplitud de las ráfagas de viento, como multiplicador de la base de la velocidad del viento.
it: L'ampiezza delle raffiche di vento.
pt_br: Regula a intensidade das rajadas de vento em relação à velocidade média do vento na simulação.
ru: Амплитуда порывов ветра как множитель базовой скорости ветра.
uk: Амплітуда поривів вітру як множник базової швидкості вітру.

source: The base speed of wind (Km/h), before modulation takes place. Wind speed in turn determines ocean wave characteristics such as their height, speed, and width.
es: La base de la velocidad del viento (Km/h), antes de que la modulación surta efecto. La velocidad del viento determina las características de las olas como su altura, velocidad y ancho.
it: La velocità base del vento (Km/h), sulla quale avviene la modulazione con raffiche e folate.
pt_br: A velocidade base do vento (Km/h), antes de qualquer variação. A velocidade do vento determina, por sua vez, características das ondas do oceano, como altura, velocidade e largura.
ru: Базовая скорость ветра (км/ч) до модуляции. Скорость ветра, в свою очередь, определяет характеристики океанских волн, такие как их высота, скорость и ширина.
uk: Базова швидкість вітру (км/год) до модуляції. Швидкість вітру, зі свого боку, визначає характеристики океанських хвиль, як-от їхня висота, швидкість і ширина.

source: The current changes to the layer will be lost; are you sure you want to continue?
es: Los cambios actuales a la capa serán perdidos; ¿estas seguro de que quieres continuar?
it: Le ultime modifiche a questo layer saranno perse; siete sicuri di voler continuare?
pt_br: Todas as mudanças atuais da camada serão perdidas. Tem certeza que deseja continuar?
ru: Текущие изменения в слое будут потеряны; вы уверены, что хотите продолжить?
uk: Поточні зміни в шарі будуть втрачені; ви впевнені, що хочете продовжити?

source: The density of air bubbles generated when water enters a ship.
es: La densidad de las burbujas de aire generadas cuando el agua entra al barco.
it: La densità delle bolle d'aria prodotte quando l'acqua penetra una nave.
pt_br: A densidade das bolhas de ar geradas quando a água adentra em um navio.
ru: Плотность пузырьков воздуха, образующихся при попадании воды на корабль.
uk: Щільність бульбашок повітря, що утворюються під час потрапляння води на корабель.

source: The density of plants (Km^2).
it: La densità delle piante (Km^2).
pt_br: A densidade das plantas (Km^2).
ru: Плотность растений (километр^2).
uk: Густота рослин (Км^"2)

source: The duration of a full daylight cycle (minutes).
es: Duración del ciclo Dia-Noche (minutos).
it: La durata di un ciclo giornaliero intero (minuti).
pt_br: A duração de um ciclo completo de luz do dia (em minutos).
ru: Продолжительность полного светового дня (минуты).
uk: Тривалість повного світлового дня (хвилини).

source: The duration of a storm (s).
es: Duración de la tormenta (s).
it: La durata di una tempesta (s).
pt_br: A duração de uma tempestade(s).
ru: Продолжительность шторма (секунды).
uk: Тривалість шторму (секунди).
