Repository: GabrieleGiuseppini/Floating-Sandbox
Catalog: Localization/*/ui_strings.po
Languages: es, it, pt_br, ru, uk

source: Adjusts the probability of a lightning hitting the ship. Set to zero to prevent altogether lightnings from hitting the ship.
es: Ajusta la probabilidad de que un rayo golpee el barco. Colocarlo en cero previene que rayos golpeen el barco en su totalidad.
it: Regola la probabilità che un fulmine colpisca la nave. Impostare a zero per impedire che i fulmini colpiscano la nave.
pt_br: Ajusta a probabilidade de um raio atingir a embarcação. Configure como zero para impedir completamente que raios atinjam o navio.
ru: Регулирует вероятность попадания молнии в корабль. Установите нулевое значение, чтобы предотвратить попадание молний в корабль.
uk: Регулює ймовірність потрапляння блискавки в корабель. Встановіть нульове значення, щоб запобігти потраплянню блискавок у корабель.

source: Adjusts the quantity of light emitted by luminescent materials.
es: Ajusta la cantidad de luz emitida por materiales luminiscentes.
it: Regola la quantità di luce emessa dai materiali luminosi.
pt_br: Ajusta a quantidade de luz emitida por materiais luminescentes.
ru: Регулирует количество света, излучаемого люминесцентными материалами.
uk: Регулює кількість світла, що випромінюється люмінесцентними матеріалами.

source: Adjusts the radius of the neighborhood tracked by fishes in a shoal.
es: Ajusta el radio del vecindario localizado de peces por cardumen.
it: Regola il raggio del perimetro controllato dai pesci nel branco.
pt_br: Ajusta o raio do monitoramento feito pelos peixes em um cardume.
ru: Регулирует радиус окрестностей, отслеживаемых рыбами на мелководье.
uk: Регулює радіус околиць, які відстежують риби на мілководді.

source: Adjusts the radius of the repair tool (m).
es: Ajusta el radio de la herramienta de reparación (m).
it: Regola il raggio dello strumento riparatore (m).
pt_br: Ajusta o raio da Ferramenta de Reparo (m).
ru: Регулирует радиус ремонтного инструмента (м).
uk: Регулює радіус ремонтного інструменту (м).

source: Adjusts the rate at which the ocean darkens with depth.
es: Ajusta la tasa a la cual el océano se oscurece con la profundidad.
it: Regola il gradiente di oscuramento del mare con la profondità.
pt_br: Ajusta a taxa com que o oceano escurece com a profundidade.
ru: Регулирует глубину затемнения океана.
uk: Регулює глибину затемнення океану.

source: Adjusts the rate with which materials consume when burning.
es: Ajusta la tasa a la cual los materiales se consumen con el fuego.
it: Regola la velocità con cui i materiali si consumano mentre bruciano.
pt_br: Ajusta a velocidade de consumo de materiais durante a queima.
ru: Регулирует скорость, с которой материалы уничтожаются при горении.
uk: Регулює швидкість, з якою матеріали знищуються під час горіння.

source: Adjusts the size of flames.
es: Ajusta el tamaño de las llamas.
it: Regola le dimensioni delle fiamme.
pt_br: Ajusta o tamanho das chamas.
ru: Регулирует размер пламени.
uk: Регулює розмір полум'я.

source: Adjusts the smoothness of waves caused by water displacement.
es: Ajusta la suavidad de las olas causadas por el desplazamiento del agua.
it: Regola la gradualità delle onde causate dal movimento di oggetti sulla superficie dell'acqua.
pt_br: Ajusta a suavidade das ondas causadas pelo deslocamento da água.
ru: Регулирует плавность волн, вызванных смещением воды.
uk: Регулює плавність хвиль, викликаних зміщенням води.

source: Adjusts the speed of fishes.
es: Ajusta la velocidad de los peces.
it: Regola la velocità dei pesci.
pt_br: Controla a velocidade de movimentação dos peixes.
ru: Регулирует скорость рыб.
uk: Регулює швидкість риб.

source: Adjusts the speed of ocean waves wrt their optimal value, which is determined by wind speed.
es: Ajusta la velocidad de las olas con su valor optimo, que es determinado por la velocidad del viento.
it: Regola la velocità delle onde rispetto al loro valore ottimale, il quale è determinato dalla velocità del vento.
pt_br: Ajusta a velocidade das ondas oceânicas em relação ao seu valor ideal, determinado pela velocidade do vento.
ru: Регулирует скорость океанских волн относительно их оптимального значения, которое определяется скоростью ветра.
uk: Регулює швидкість океанських хвиль щодо їхнього оптимального значення, яке визначається швидкістю вітру.

source: Adjusts the speed of the camera movements.
es: Ajusta la velocidad de el movimiento de la cámara.
it: Regola la velocità dei movimenti della telecamera.
pt_br: Ajusta a velocidade dos movimentos da câmera.
ru: Регулирует скорость движения камеры.
uk: Регулює швидкість руху камери.

source: Adjusts the speed with which heat propagates along materials.
es: Ajusta la velocidad a la cual el calor se propaga por los materiales.
it: Regola la velocità con cui il calore si propaga nei materiali.
pt_br: Ajusta a velocidade com a qual o calor se propaga pelos materiais.
ru: Регулирует скорость, с которой тепло распространяется по материалам.
uk: Регулює швидкість, з якою тепло поширюється матеріалами.

source: Adjusts the speed with which materials dissipate or accumulate heat to or from air and water.
es: Ajusta la velocidad a la cual los materiales disipan o acumulan calor desde o al aire o agua.
it: Regola la velocità con cui i materiali dissipano o catturano calore dall'aria o dal mare.
pt_br: Controla a taxa de troca de calor dos materiais com o ar e a água.
ru: Регулирует скорость, с которой материалы рассеивают или накапливают тепло в воздухе и воде.
uk: Регулює швидкість, з якою матеріали розсіюють або накопичують тепло в повітрі та воді.

source: Adjusts the speed with which materials rot when exposed to sea water. Set to zero to disable rotting altogether.
es: Ajusta la velocidad con la cual los materiales se oxidan al estar expuestos al agua. Colocarlo en cero deshabilita la oxidación completamente.
it: Regola la velocità con cui i materiali marciscono quando sono esposti all'acqua di mare. Impostate a zero per disabilitare completamente la putrefazione.
pt_br: Controla a taxa de decomposição dos materiais em contato com água do mar. Valor zero desativa o apodrecimento.
ru: Регулирует скорость, с которой материалы гниют под воздействием морской воды. Установите на ноль, чтобы полностью отключить гниение.
uk: Регулює швидкість, з якою матеріали гниють під впливом морської води. Встановіть на нуль, щоб повністю вимкнути гниття.

source: Adjusts the speed with which sea water enters or leaves a physical body.
es: Ajusta la velocidad a la cual el agua entra o sale de un cuerpo físico.
it: Regola la velocità con cui l'acqua di mare entra o esce dagli oggetti.
pt_br: Ajusta a velocidade com a qual a água do mar entra ou sai de um corpo físico.
ru: Регулирует скорость, с которой морская вода входит или выходит из физического тела.
uk: Регулює швидкість, з якою морська вода входить або виходить із фізичного тіла.

source: Adjusts the speed with which the repair tool attracts particles to repair damage. Warning: at high speeds the repair tool might become destructive!
es: Ajusta la velocidad a la cual la herramienta de reparación atrae las partículas para reparar el daño. Aviso: a altas velocidades la herramienta de reparación se puede volver destructiva!
it: Regola la velocità con cui lo strumento riparatore attrae particelle per riparare danni. Attenzione: velocità troppo alte possono distruggere, più che riparare!
pt_br: Ajusta a velocidade com a qual a Ferramenta de Reparar Estrutura atrai partículas para consertar danos. Atenção: em velocidades altas, a ferramenta pode se tornar destrutiva!
ru: Регулирует скорость, с которой ремонтный инструмент притягивает частицы для устранения повреждений. Предупреждение: на высоких скоростях ремонтный инструмент может стать разрушительным!
uk: Регулює швидкість, з якою ремонтний інструмент притягує частинки для усунення пошкоджень. Попередження: на високих швидкостях ремонтний інструмент може стати руйнівним!

source: Adjusts the speed with which water propagates within a physical body.
es: Ajusta la velocidad a la cual el agua se propaga por un cuerpo físico.
it: Regola la velocità con cui l'acqua si propaga negli oggetti.
pt_br: Controla a taxa de propagação interna de água em corpos físicos.
ru: Регулирует скорость, с которой вода распространяется внутри физического тела.
uk: Регулює швидкість, з якою вода поширюється всередині фізичного тіла.

source: Adjusts the static friction coefficient.
es: Ajusta el coeficiente de fricción estática.
it: Regola il coefficiente di attrito statico.
pt_br: Controla o valor do coeficiente de atrito estático entre superfícies.
ru: Регулирует коэффициент статического трения.
uk: Регулює коефіцієнт статичного тертя.

source: Adjusts the static pressure force exherted against the external hull of physical bodies. Set to zero to disable static pressure altogether.
es: Ajusta la presión estática ejercida en la quilla externa de los cuerpos físicos. Colocarlo en cero deshabilita la presión estática.
it: Regola la pressione statica esercitata contro lo scafo esterno degli oggetti. Impostate a zero per disabilitare completamente la pressione statica.
pt_br: Controla a magnitude da força de pressão estática sobre o casco de corpos físicos. Valor zero desativa a pressão estática.
ru: Регулирует силу статического давления, действующую на внешний корпус физических тел. Установите на ноль, чтобы полностью отключить статическое давление.
uk: Регулює силу статичного тиску, що діє на зовнішній корпус фізичних тіл. Встановіть на нуль, щоб повністю вимкнути статичний тиск.

source: Adjusts the strength of storms.
es: Ajusta la fuerza de las tormentas.
it: Regola la potenza delle tempeste.
pt_br: Ajusta a intensidade das tempestades.
ru: Регулирует силу штормов.
uk: Регулює силу штормів.

source: Adjusts the strength of the initial anti-matter bomb implosion.
es: Ajusta la fuerza inicial de las bombas Anti-Materia implosionan.
it: Regola la potenza dell'implosione iniziale delle bombe anti-materia.
pt_br: Ajusta a intensidade da implosão inicial das Bombas Anti-Matéria.
ru: Регулирует силу первоначального взрыва Анти-Материальной Бомбы.
uk: Регулює силу початкового вибуху Анти-Матеріальної Бомби.

source: Adjusts the temperature at which materials ignite.
es: Ajusta la temperatura a la cual los materiales se incendian.
it: Regola la temperatura a cui i materiali prendono fuoco.
pt_br: Controla o ponto de ignição térmico (temperatura de autoignição) dos materiais.
ru: Регулирует температуру, при которой материалы воспламеняются.
uk: Регулює температуру, за якої матеріали запалюються.

source: Adjusts the temperature at which materials melt.
es: Ajusta la temperatura a la cual los materiales se derriten.
it: Regola la temperatura a cui i materiali iniziano a fondersi.
pt_br: Controla o ponto de fusão (temperatura de fusão) dos materiais.
ru: Регулирует температуру, при которой материалы плавятся.
uk: Регулює температуру, за якої матеріали плавляться.

source: Adjusts the thrust exerted by engines.
es: Ajusta el empuje creado por los motores.
it: Regola la spinta esercitata dai motori.
pt_br: “Ajusta o empuxo exercido pelos motores.
ru: Регулирует тягу, создаваемую двигателями.
uk: Регулює тягу, створювану двигунами.

source: Adjusts the transparency of sea water.
es: Ajusta la transparencia del agua de mar.
it: Regola la trasparenza del mare.
pt_br: Ajusta a transparência da água do mar.
ru: Регулирует прозрачность морской воды.
uk: Регулює прозорість морської води.

source: Adjusts the volume of background music.
es: Ajusta el volumen de la música de fondo.
it: Regola il volume della musica di sottofondo.
pt_br: Ajusta o volume da música de fundo.
ru: Регулирует громкость фоновой музыки.
uk: Регулює гучність фонової музики.

source: Adjusts the volume of sounds generated by interactive tools.
es: Ajusta el volumen de los sonidos generados por la herramientas interactivas.
it: Regola il volume dei suoni prodotti dagli strumenti.
pt_br: Controla a intensidade sonora produzida por ferramentas interativas.
ru: Регулирует громкость звуков, генерируемых инструментами.
uk: Регулює гучність звуків, що генеруються інструментами.

source: Adjusts the volume of sounds generated by the simulation.
es: Ajusta el volumen de los sonidos generados por la simulación.
it: Regola il volume dei suoni prodotti dal simulatore.
pt_br: Ajusta o volume dos sons gerados pela simulação.
ru: Регулирует громкость звуков, генерируемых симуляцией.
uk: Регулює гучність звуків, що генеруються симуляцією.

source: Adjusts the volume of the music played when a ship is sinking.
es: Ajusta el volumen de la música reproducida cuando un barco se esta hundiendo.
it: Regola il volume della musica che viene riprodotta quando una nave inizia ad affondare.
pt_br: Ajusta o volume da música que é tocada quando um navio está afundando.
ru: Регулирует громкость музыки, воспроизводимой при затоплении судна.
uk: Регулює гучність музики, що відтворюється під час затоплення судна.

source: Adjusts the width of ocean waves wrt their optimal value, which is determined by wind speed.
es: Ajusta el ancho de las olas con su valor optimo, que es determinado por la velocidad del viento.
it: Regola l'ampiezza delle onde rispetto al loro valore ottimale, il quale è determinato dalla velocità del vento.
pt_br: Ajusta a largura das ondas oceânicas em relação ao seu valor ideal, determinado pela velocidade do vento.
ru: Регулирует ширину океанских волн относительно их оптимального значения, которое определяется скоростью ветра.
uk: Регулює ширину океанських хвиль щодо їхнього оптимального значення, яке визначається швидкістю вітру.

source: Advanced
es: Avanzado
it: Parametri speciali
pt_br: Avançado
ru: Дополнительно
uk: Додатково

source: Air
es: Aire
it: Aria
pt_br: Ar
ru: Воздух
uk: Повітря

source: Air Bubbles Density
es: Densidad de las burbujas de aire
it: Densità bolle d'aria
pt_br: Densidade das Bolhas de Ar
ru: Плотность Воздушных Пузырей
uk: Густина повітряних бульбашок

source: Air and Sky
es: Aire y Cielo
it: Aria e cielo
pt_br: Céu e Ar
ru: Воздух и небо
uk: Повітря та небо

source: All Layers:
es: Todas las capas:
it: Tutti i layers:
pt_br: Todas as Camadas:
ru: Слои:
uk: Шари:

source: All electrical components in the electrical layer are connected to at least one power source.
es: Todos los componentes en la capa eléctrica están conectados a al menos una fuente de poder.
it: Tutti i componenti nel layer elettrico sono connessi ad almeno una fonte di alimentazione.
pt_br: Todos os componentes elétricos da camadas elétricas estão ligados a pelo menos uma fonte de energia.
ru: Все электрические компоненты в электрическом слое подключены как минимум к одному источнику питания.
uk: Усі електричні компоненти в електричному шарі під'єднані щонайменше до одного джерела живлення.

source: All engine components in the electrical layer are connected to at least one engine controller.
es: Todos los componentes en la capa eléctrica están conectados a al menos un controlador de motor.
it: Tutti i motori nel layer elettrico sono connessi ad almeno un controllore motore.
pt_br: Todos os componentes dos motores na camadas elétricas estão conectados a pelo menos um controlador de motor.
ru: Все компоненты двигателя в электрическом слое подключены по крайней мере к одному контроллеру двигателя.
uk: Усі компоненти двигуна в електричному шарі під'єднані принаймні до одного контролера двигуна.

source: All engine controllers in the electrical layer are connected to at least one engine.
es: Todos los controles de motor en la capa eléctrica están conectados a al menos un motor.
it: Tutti i controllori motori nel layer elettrico sono connessi ad almeno un motore.
pt_br: Todos os controladores nas camada elétricas estão conectados a pelo menos um motor.
ru: Все контроллеры двигателей в электрическом слое подключены по крайней мере к одному двигателю.
uk: Усі контролери двигунів в електричному шарі під'єднані принаймні до одного двигуна.

source: All particles in the electrical layer have a particle in the structural layer beneath them. Particles in the electrical layer must always be above particles in the structural layer.
es: Todas las partículas en la capa eléctrica tienen una capa estructural debajo de ellas. Las partículas en la capa eléctrica siempre deben estar sobre una capa estructural.
it: Tutte le particelle nel layer elettrico hanno una corrispondente particella nel layer strutturale sottostante. Le particelle nel layer elettrico devono sempre essere sovrapposte a particelle nel layer strutturale.
pt_br: Cada partícula da camada elétrica corresponde a uma partícula na camada estrutural logo abaixo. As partículas da camada elétrica devem permanecer sempre acima das partículas da camada estrutural.
ru: Все частицы в электрическом слое имеют под собой частицу в структурном слое. Частицы в электрическом слое всегда должны находиться над частицами в структурном слое.
uk: Усі частинки в електричному шарі мають під собою частинку в структурному шарі. Частинки в електричному шарі завжди мають перебувати над частинками в структурному шарі.

source: All power sources in the electrical layer are connected to at least one electrical element.
es: Todas las fuentes de poder en la capa eléctrica están conectadas a al menos un elemento eléctrico.
it: Tutte le fonti di alimentazione nel layer elettrico sono collegate ad almeno un componente.
pt_br: Todas as fontes de energia nas camadas elétricas estão conectadas a pelo menos um elemento elétrico.
ru: Все источники питания в электрическом слое подключены по крайней мере к одному электрическому элементу.
uk: Усі джерела живлення в електричному шарі під'єднані принаймні до одного електричного елемента.

source: Alpha Threshold:
it: Soglia trasparenza:
pt_br: Limite de transparência:
ru: Порог Альфа Канала:
uk: Альфа-Поріг:

source: Analysis
es: Analisis
it: Analisi
pt_br: Análise
ru: Анализ
uk: Аналіз

source: Anonymous Stickmen
es: Hombre de palo anónimo
it: Fantocci anonimi
pt_br: Boneco-Palito Anônimo
ru: Анонимный Стикман
uk: Анонімні Стікмен

source: Anti-Alias:
pt_br: Suavização de Bordas:
ru: Анти-Алиас:
uk: Анти-Аліас:

source: Apply Saved Settings
es: Aplicar configuraciones guardadas
it: Applica parametri salvati
pt_br: Aplicar Configurações Salvas
ru: Применить Сохраненные Настройки
uk: Застосувати Збережені налаштування

source: Are you sure you want to delete settings "%s"?
es: ¿Estas seguro de que quieres eliminar las configuraciones %s?
it: Siete sicuri di voler eliminare i parametri "%s"?
pt_br: Tem certeza de que deseja excluir as configurações “%s”?
ru: Вы уверены, что хотите удалить настройки "%s"?
uk: Ви впевнені, що хочете видалити налаштування "%s"?

source: Are you sure you want to remove password protection for this ship, allowing everyone to make changes to it?
es: Estas seguro de que quieres eliminar la contraseña de protección del barco, permitiéndole a todos hacerles cambios?
it: Siete sicuri di voler rimuovere la password, rendendo possibile a chiunque di poter modificare la nave?
pt_br: Você tem certeza que deseja remover a proteção por senha para este objeto? Isso vai permitir que todos possam fazer alterações nele.
ru: Вы уверены, что хотите снять защиту паролем с этого корабля, позволив всем желающим вносить в него изменения?
uk: Ви впевнені, що хочете зняти захист паролем із цього корабля, дозволивши всім охочим вносити в нього зміни?

source: Are you sure you want to replace settings "%s" with the current settings?
es: ¿Estas seguro de que quieres reemplazar esta configuración %s con las configuraciones actuales?
it: Siete sicuri di voler sostituite i parametri "%s" con i parametri correnti?
pt_br: Tem certeza de que deseja substituir as configurações “%s” pelas configurações atuais?
ru: Вы уверены, что хотите заменить настройки "%s" текущими настройками?
uk: Ви впевнені, що хочете замінити налаштування "%s" поточними налаштуваннями?

source: At this moment it is not possible to check for updates; please try again later...
es: En este momento no es posible buscar actualizaciones; por favor intenta de nuevo mas tarde...
it: Al momento non è possibile verificare la disponibilità di aggiornamenti; riprova più tardi...
pt_br: No momento não é possível verificar se há atualizações; por favor, tente novamente mais tarde...
ru: В данный момент невозможно проверить наличие обновлений; пожалуйста, попробуйте позже...
uk: Наразі неможливо перевірити наявність оновлень; будь ласка, спробуйте пізніше...

source: Attract/Repel
es: Atraer/Repeler
it: Attrai/respingi
pt_br: Atrair/Repelir
ru: Приятжение/Отталкивание
uk: Притягання/Відштовхування

source: Author(s)
es: Autor(es)
it: Autore/i
pt_br: Autores:
ru: Автор(ы)
uk: Автор(и)

source: Author(s) of the texture - if different than the ship author, e.g. "Neurodancer (Shipbucket.com)"
es: Autor(es) de la textura -si es diferente del autor del barco, ej. "Neurodancer (Shipbucket.com)"
it: Autore/i della texture - quando diverso/i dall'autore/i della nave; per esempio, "Neurodancer (Shipbucket.com)"
pt_br: Autores das texturas - se for diferente do autor do objeto, por exemplo: ''Neurodancer (Shipbucket.com)''
ru: Автор(ы) текстуры - если отличается от автора корабля, например, "Neurodancer (Shipbucket.com)".
uk: Автор(и) текстури - якщо відрізняється від автора корабля, наприклад, "Neurodancer (Shipbucket.com)".

source: Author(s), e.g. "Ellen Ripley; David Gahan"
es: Autor(es). ej. "Ellen Ripley; David Gahan"
it: Autore/i; per esempio, "Ellen Ripley; David Gahan"
pt_br: Autores, por exemplo: ''Ellen Ripley; David Gahan''
ru: Автор(ы), например, "Эллен Рипли; Дэвид Гаан".
uk: Автор(и), наприклад, "Еллен Ріплі; Девід Гаан".

source: Auto-Focus at NPC Add
es: Auto-Enfocado al añadir NPC
it: Auto-focus all'aggiunta di NPC
pt_br: Foco Automático ao adicionar um NPC
ru: Автофокусировка при добавлении НИПов
uk: Автофокус на додавання НПС

source: Auto-Focus at Ship Load
es: Auto-Enfocado al cargar el Barco
it: Auto-focus al caricamento della nave
pt_br: Foco automático durante a carga do objeto
ru: Автофокусировка при загрузке судна
uk: Автофокусування під час завантаження судна

source: Auto-Texturization
es: Texturizacion automática
it: Auto-texturizzazione
pt_br: Texturização automática
ru: Автоматическое Текстурирование
uk: Автоматичне Текстурування

source: Auto-Trim
es: Recorte Automatico
it: Ritaglia
pt_br: Ajuste automático
ru: Автоматическая обрезка
uk: Автоматичне обрізання

source: Auto-texturization mode: view ship as when it is auto-texturized.
es: Modo de Auto-Texturizacion: ver el barco como si estuviese texturizado automaticamente.
it: Modalità auto-texturizzazione: mostra la nave come quando la modalità auto-texturizzazione è abilitata.
pt_br: Modo de auto-texturização: visualize o navio como quando ele é auto-texturizado.
ru: Режим автотекстурирования: просмотр корабля в режиме автотекстурирования.
uk: Режим автотекстурування: перегляд корабля в режимі автотекстурування.

source: Automatic Daylight Cycle
es: Ciclo Dia-Noche Automatico
it: Ciclo giornaliero automatico
pt_br: Ciclo Dia-Noite Automático
ru: Автоматический Дневной Цикл
uk: Автоматичний Денний Цикл

source: BUILD ENGINEERING
es: INGENIEROS CONSTRUCTORES
it: INGEGNERIA DI COMPILAZIONE
pt_br: ENGENHARIA DE CONSTRUÇÃO
ru: СТРОИТЕЛЬНАЯ ИНЖЕНЕРИЯ
uk: БУДІВЕЛЬНА ІНЖЕНЕРІЯ

source: Background Music Volume
es: Volumen de la música de fondo
it: Volume della musica di sottofondo
pt_br: Volume da Música de Fundo
ru: Громкость Фоновой Музыки
uk: Гучність фонової музики

source: Backup Ship
es: Respaldar Barco
it: Copia nave
pt_br: Backup de Objeto/Navio
ru: Резервный корабль
uk: Резервний корабель

source: Base Speed
es: Velocidad base
it: Velocità di base
pt_br: Velocidade Base
ru: Базовая скорость
uk: Базова швидкість

source: Blast
es: Explosion
it: Esplosione
pt_br: Força de Explosão
ru: Взрыв
uk: Вибух
