Repository: GabrieleGiuseppini/Floating-Sandbox
Catalog: Localization/*/ui_strings.po
Languages: es, it, pt_br, ru, uk

source: The electrical layer contains components that are not connected to a power source. Review your circuits to ensure all components are connected to at least one power source, such as a generator.
es: La capa eléctrica contiene componentes que no están conectados a una fuente de poder. Revisa tus circuitos para asegurar que todos los componentes están conectados a una fuente de poder, como un generador.
it: Il layer elettrico contiene componenti che non sono connessi ad alcuna fonte di alimentazione. Rivedete i circuiti per assicurarvi the tutti i componenti siano connessi ad almeno una fonte di alimentazione, quale ad esempio un generatore.
pt_br: A camada elétrica contém componentes que não estão conectados a uma fonte de energia. Revise seus circuitos para garantir que todos os componentes estejam ligados a pelo menos uma fonte de energia, como um gerador.
ru: Электрический слой содержит компоненты, которые не подключены к источнику питания. Просмотрите свои схемы, чтобы убедиться, что все компоненты подключены хотя бы к одному источнику питания, например, к генератору.
uk: Електричний шар містить компоненти, які не під'єднані до джерела живлення. Перегляньте свої схеми, щоб переконатися, що всі компоненти під'єднані хоча б до одного джерела живлення, наприклад, до генератора.

source: The electrical layer contains engine components that are not connected to an engine controller. Review your circuits to ensure all engine components (engines and engine cables) are connected to at least one engine controller.
es: La capa eléctrica contiene componentes de motor que no están conectados a controladores de motor. Revisa tus circuitos para asegurar de que todos los componentes de motor (motores y cables de motores) están conectados a al menos un controlador de motor.
it: Il layer elettrico contiene componenti motori che non sono connessi ad alcun controllore. Rivedete i circuiti per assicurarvi the tutti i componenti motori (trasmissioni e motori) siano connessi ad almeno un controllore.
pt_br: A camada elétrica contém componentes do motor que não estão conectados a um controlador de motor. Revise seus circuitos para garantir que todos os componentes do motor (motores e cabos do motor) estejam conectados a pelo menos um controlador de motor.
ru: Электрический слой содержит компоненты двигателя, которые не подключены к контроллеру двигателя. Просмотрите свои схемы, чтобы убедиться, что все компоненты двигателя (двигатели и кабели двигателя) подключены как минимум к одному контроллеру двигателя.
uk: Електричний шар містить компоненти двигуна, які не під'єднані до контролера двигуна. Перегляньте свої схеми, щоб переконатися, що всі компоненти двигуна (двигуни та кабелі двигуна) під'єднані щонайменше до одного контролера двигуна.

source: The electrical layer contains engine controllers that are not connected to any engines. Review your circuits to ensure all engine controllers are connected to at least one engine.
es: La capa eléctrica contiene controladores de motor que no están conectados a ningún motor. Revisa tus circuitos para asegurar que todos los controladores están conectados a al menos un motor.
it: Il layer elettrico contiene controllori che non sono connessi ad alcun motore. Rivedete i circuiti per assicurarvi the tutti i controllori siano connessi ad almeno un motore.
pt_br: A camada elétrica contém controladores de motor que não estão conectados a nenhum motor. Revise seus circuitos para garantir que todos os controladores de motor estejam conectados a pelo menos um motor.
ru: Электрический слой содержит контроллеры двигателя, которые не подключены ни к одному двигателю. Просмотрите свои схемы, чтобы убедиться, что все контроллеры двигателя подключены хотя бы к одному двигателю.
uk: Електричний шар містить контролери двигуна, які не під'єднані до жодного двигуна. Перегляньте свої схеми, щоб переконатися, що всі контролери двигуна під'єднані хоча б до одного двигуна.

source: The electrical layer contains power sources that are not connected to any passive elements. Review your circuits to ensure all power sources are connected to at least one passive electrical element, such as a lamp, a horn, or an engine controller.
es: La capa eléctrica contiene fuentes de poder que no están conectados a ningún elemento pasivo. Revisa tus circuitos para asegurar que todas las fuentes de poder están conectadas a al menos un elemento eléctrico pasivo, como una lampara, una bocina o un controlador de motor.
it: Il layer elettrico contiene fonti di alimentazione che non sono connessi ad alcun elemento passivo. Rivedete i circuiti per assicurarvi the tutte le fonti di alimentazione siano connesse ad almeno un elemento passivo, ad esempio una lampada, una sirena, o un controllore motori.
pt_br: A camada elétrica contém fontes de energia que não estão conectadas a nenhum elemento passivo. Revise seus circuitos para garantir que todas as fontes de energia estejam conectadas a pelo menos um elemento elétrico passivo, como uma lâmpada, uma buzina ou um controlador de motor.
ru: Электрический слой содержит источники питания, которые не подключены к каким-либо пассивным элементам. Просмотрите свои схемы и убедитесь, что все источники питания подключены хотя бы к одному пассивному электрическому элементу, такому как лампа, звуковой сигнал или контроллер двигателя.
uk: Електричний шар містить джерела живлення, які не під'єднані до будь-яких пасивних елементів. Перегляньте свої схеми і переконайтеся, що всі джерела живлення під'єднані хоча б до одного пасивного електричного елемента, такого як лампа, звуковий сигнал або контролер двигуна.

source: The electrical layer contains too many light-emitting particles, possibly causing the simulation to lag on low-end computers. It is advisable to reduce the number of light-emitting electrical particles.
es: La capa eléctrica contiene demasiadas partículas de emisión de luz, posiblemente causando que la simulación se enlentezca en computadoras de bajo poder. Es recomendable que se reduzca el numero de partículas de emisión de luz.
it: Il layer elettrico contiene troppe particelle luminose, con il rischio di rallentare la simulazione su computer meno recenti. Si suggerisce di diminuire il numero di particelle luminose.
pt_br: A camada elétrica contém partículas que emitem luz em excesso, o que pode causar lentidão na simulação em computadores com baixo desempenho. É recomendável reduzir o número de partículas elétricas que emitem luz.
ru: Электрический слой содержит слишком много светоизлучающих частиц, что может привести к задержке моделирования на компьютерах низкого класса. Рекомендуется уменьшить количество светоизлучающих электрических частиц.
uk: Електричний шар містить занадто багато світловипромінювальних частинок, що може призвести до затримки моделювання на комп'ютерах низького класу. Рекомендується зменшити кількість світловипромінювальних електричних частинок.

source: The electrical layer does not contain too many light-emitting particles.
es: La capa eléctrica no contiene muchas partículas de emisión de luz.
it: Il numero di particelle luminose nel layer elettrico non è eccessivo.
pt_br: A camada elétrica não contém muitas partículas que emitem luz.
ru: Электрический слой не содержит слишком много светоизлучающих частиц.
uk: Електричний шар не містить занадто багато світловипромінювальних частинок.

source: The electrical panel contains too many elements, cluttering the panel and making it difficult to use. It is advised to hide some elements and not exceed a maximum of about 20 elements.
es: El panel eléctrico contiene demasiados elementos, apelmazando el panel y haciéndolo difícil de usar. Es recomendado esconder algunos elementos y no exceder el máximo de 20 elementos.
it: Il pannello elettrico contiene troppi elementi visibili, rendendo il suo utilizzo complicato. Si suggerisce di far diventare invisibili alcuni elementi, rimanendo sotto un massimo di 20 elementi visibili.
pt_br: O painel elétrico contém elementos em excesso, deixando-o confuso e difícil de usar. É recomendável ocultar alguns elementos e não exceder um máximo de cerca de 20 elementos.
ru: Электрическая панель содержит слишком много элементов, загромождая панель и затрудняя ее использование. Рекомендуется скрыть некоторые элементы и не превышать максимум около 20 элементов.
uk: Електрична панель містить занадто багато елементів, захаращуючи панель і ускладнюючи її використання. Рекомендується приховати деякі елементи і не перевищувати максимум близько 20 елементів.

source: The electrical panel does not contain too many elements.
es: La capa eléctrica no contiene muchos elementos.
it: Il numero di elementi visibili nel pannello elettrico non è eccessivo.
pt_br: O painel elétrico não contém muitos elementos.
ru: Электрическая панель не содержит слишком много элементов.
uk: Електрична панель не містить занадто багато елементів.

source: The expected time between two automatically-generated rogue waves (seconds). Set to zero to disable automatic generation of rogue waves altogether.
es: Tiempo esperado entre dos olas gigantes automáticamente generadas (minutos). Colocarlo en cero deshabilita la generación automática de las olas gigantes.
it: L'intervallo di tempo medio tra due onde anomale (secondi). Impostate a zero per disabilitare completamente le onde anomale spontanee.
pt_br: O tempo esperado entre duas ondas gigantes geradas automaticamente (segundos). Defina como zero para desativar completamente a geração automática de ondas gigantes.
ru: Ожидаемое время между двумя автоматически генерируемыми разбойными волнами (секунды). Установите значение "ноль", чтобы полностью отключить автоматическую генерацию случайных волн.
uk: Очікуваний час між двома автоматично генерованими розбійними хвилями (секунди). Встановіть значення "нуль", щоб повністю вимкнути автоматичну генерацію випадкових хвиль.

source: The expected time between two automatically-generated storms (minutes). Set to zero to disable automatic generation of storms altogether.
es: Tiempo esperado entre dos tormentas automáticamente generadas (minutos). Colocarlo en cero deshabilita las tormentas.
it: L'intervallo di tempo medio tra due tempeste (minuti). Impostate a zero per disabilitare completamente le tempeste spontanee.
pt_br: O tempo esperado entre duas tempestades geradas automaticamente (minutos). Defina como zero para desativar completamente a geração automática de tempestades.
ru: Ожидаемое время между двумя автоматически созданными штормами (в минутах). Установите в ноль, чтобы полностью отключить автоматическое создание штормов.
uk: Очікуваний час між двома автоматично створеними штормами (у хвилинах). Встановіть нуль, щоб повністю вимкнути автоматичне створення штормів.

source: The expected time between two automatically-generated tsunami waves (minutes). Set to zero to disable automatic generation of tsunami waves altogether.
es: Tiempo esperado entre dos olas automáticamente generadas (minutos). Colocarlo en cero deshabilita la generación automática de olas y tsunamis.
it: L'intervallo di tempo medio tra due tsunami (minuti). Impostate a zero per disabilitare completamente gli tsunami spontanei.
pt_br: O tempo esperado entre duas ondas de tsunami geradas automaticamente (minutos). Defina como zero para desativar completamente a geração automática de tsunamis.
ru: Ожидаемое время между двумя автоматически сгенерированными волнами цунами (в минутах). Установите в ноль, чтобы полностью отключить автоматическое создание волн цунами.
uk: Очікуваний час між двома автоматично згенерованими хвилями цунамі (у хвилинах). Встановіть нуль, щоб повністю вимкнути автоматичне створення хвиль цунамі.

source: The exterior layer texture is not too large.
it: L'immagine del layer esterno è troppo grande.
ru: Наружный слой текстуры не слишком большой.
uk: Текстура зовнішнього шару не надто велика.

source: The exterior layer texture might be too large for some computers. Resize the texture in the exterior layer so that no dimension is larger than 4096 pixels.
it: L'immagine del layer esterno potrebbe essere troppo grande per alcuni utenti. Cambia le dimensioni affinché non siano più grandi di 4096 pixel.
ru: Наружный слой текстуры может быть слишком большим для некоторых компьютеров. Измените размер текстуры интерьерного слоя так, чтобы ни один размер не был выше 4096 пикселей.
uk: Текстура зовнішнього шару може бути занадто великою для деяких комп'ютерів. Змініть розмір текстури у зовнішньому шарі так, щоб жоден з вимірів не перевищував 4096 пікселів.

source: The heat generated by bomb explosions (KJ/s).
es: Calor generado por las explosiones de las bombas (KJ/s).
it: Il calore generato dalle esplosioni delle bombe (KJ/s).
pt_br: O calor gerado pelas explosões das Bombas (KJ/s).
ru: Тепло, выделяемое при взрывах бомб (кДж /с).
uk: Тепло, що виділяється під час вибухів бомб (кДж/с).

source: The heat produced by the HeatBlaster tool (KJ/s).
es: Calor generado por el lanzallamas (KJ/s).
it: La quantità di calore prodotta dall'HeatBlaster (KJ/s).
pt_br: O calor gerado pela Ferramenta do Explosor de Calor (KJ/s).
ru: Тепло, выделяемое инструментом Тепловым Бластером (кДж/с).
uk: Тепло, що виділяється інструментом Тепловим Бластером (кДж/с).

source: The heat produced by the laser ray (KJ/s).
es: Calor generado por el rayo laser (KJ/s).
it: La quantità di calore prodotta dal raggio laser (KJ/s).
pt_br: O calor gerado pelo Raio Laser (KJ/s).
ru: Тепло, выделяемое лазерным лучом (КДж/с).
uk: Тепло, що виділяється лазерним променем (КДж/с).

source: The height of the canvas.
es: La altura del lienzo.
it: L'altezza dell'area di lavoro.
pt_br: A altura da tela.
ru: Высота холста.
uk: Висота полотна.

source: The interior layer texture is not too large.
it: L'immagine del layer interno non è troppo grande.
ru: Интерьерный слой текстуры не слишком большой.
uk: Текстура внутрішнього шару не надто велика.

source: The interior layer texture might be too large for some computers. Resize the texture in the interior layer so that no dimension is larger than 4096 pixels.
it: L'immagine del layer interno potrebbe essere troppo grande per alcuni utenti. Cambia le dimensioni affinché non siano più grandi di 4096 pixel.
ru: Интерьерный слой текстуры может быть слишком большим для некоторых компьютеров. Измените размер текстуры интерьерного слоя так, чтобы ни один размер не был выше 4096 пикселей.
uk: Текстура внутрішнього шару може бути занадто великою для деяких комп'ютерів. Змініть розмір текстури у внутрішньому шарі так, щоб жоден з вимірів не перевищував 4096 пікселів.

source: The latest available version is %s, and you are running version %s; there are no new updates...
es: La versión mas nueva es %s, y tu estas corriendo la versión %s; no hay nuevas actualizaciones...
it: L'ultima versione disponibile è %s, e voi state usando la versione %s; non ci sono nuovi aggiornamenti...
pt_br: A versão mais recente disponível é %s, e você está executando a versão %s; não há novas atualizações...
ru: Последняя доступная версия - %s, и вы используете версию %s; новых обновлений нет...
uk: Остання доступна версія - %s, і ви використовуєте версію %s; нових оновлень немає...

source: The level of detail of materials' textures
es: El nivel de detalle de las texturas de los materiales
it: Il livello di dettaglio delle texture dei materiali
pt_br: O nível de detalhamento das texturas dos materiais
ru: Уровень детализации текстур материалов
uk: Рівень деталізації текстур матеріалів

source: The maximum number of particles that may burn at any given moment in time on a ship; together with the combustion heat adjustment, determines the speed with which fire spreads to adjacent particles. Warning: higher values require more computing resources, with the risk of slowing the simulation down!
es: El numero máximo de partículas que se queman al mismo tiempo; en conjunto con el ajuste de calor de combustión, determina la velocidad a la cual el fuego se dispersa a partículas cercanas. Aviso: valores altos consumen mas recursos, con el riesgo de enlentecer la simulación!
it: Il numero massimo di particelle della nave che possono essere a fuoco. Insieme al parametro "Calore combustione", determina la velocità con cui il fuoco si propaga alle particelle adiacenti. Attenzione: valori elevati richiedono l'uso di maggiori risorse di calcolo, con il rischio di rallentare la simulazione!
pt_br: O número máximo de partículas que podem estar em combustão a qualquer momento em uma nave; junto com o ajuste de calor de combustão, determina a velocidade com que o fogo se espalha para partículas adjacentes. Aviso: valores mais altos exigem mais recursos computacionais, podendo desacelerar a simulação.
ru: Максимальное количество частиц, которые могут гореть в любой момент времени на корабле; вместе с регулировкой теплоты сгорания определяет скорость, с которой огонь распространяется на соседние частицы. Предупреждение: более высокие значения требуют больше вычислительных ресурсов, что может замедлить симуляцию!
uk: Максимальна кількість частинок, які можуть горіти в будь-який момент часу; разом із регулюванням теплоти згоряння визначає швидкість, з якою вогонь поширюється на сусідні частинки. Попередження: вищі значення вимагають більше обчислювальних ресурсів, що може уповільнити симуляцію!

source: The minimum alpha value for a texture pixel to be considered opaque; values of alpha greater than this value are considered opaque.
it: Il valore minimo di trasparenza sotto il quale un pixel è considerato opaco.
pt_br: O valor mínimo de alfa para que um pixel de textura seja considerado opaco; valores de alfa maiores que este valor são considerados opacos.
ru: Минимальнаый порог альфы канала пикселя текстуры; величины альфа канала больше порога, будут оценены как непрозрачные.
uk: Мінімальне значення альфа для того, щоб піксель текстури вважався непрозорим, значення альфа, що перевищують це значення, вважаються непрозорими.

source: The number of clouds in the world's sky. This is the total number of clouds in the world; at any moment in time, the number of clouds that are visible will be less than or equal to this value.
es: Numero de nubes en el cielo. Este es el numero total de nubes en el mundo; en cualquier momento, el numero de nubes visibles será igual o menor a este valor.
it: La quantità di nuvole nel cielo. Questo parametro rappresenta la quantità totale di nuvole nel mondo; il numero di nuvole visibili sarà sempre minore o uguale a questo parametro.
pt_br: Define a quantidade total de nuvens na simulação. Nem todas estarão visíveis simultaneamente, mas o total não excederá este valor.
ru: Количество облаков в небе мира. Это общее количество облаков в мире; в любой момент времени количество видимых облаков будет меньше или равно этому значению.
uk: Кількість хмар у небі світу. Це загальна кількість хмар у світі; у будь-який момент часу кількість видимих хмар буде меншою або дорівнюватиме цьому значенню.

source: The number of fishes in the ocean.
es: Numero de peces en el océano.
it: La quantità di pesci nell'oceano.
pt_br: O número de peixes no Oceano.
ru: Количество рыб в океане.
uk: Кількість риб в океані.

source: The number of stars in the sky.
es: Numero de estrellas en el cielo.
it: La quantità di stelle nel cielo.
pt_br: O número de Estrelas no céu.
ru: Количество звезд на небе.
uk: Кількість зірок на небі.

source: The ocean depth (m).
es: Profundidad oceánica (m)
it: La profondità dell' oceano (m).
pt_br: A profundidade do Oceano (m).
ru: Глубина океана (метры).
uk: Глибина океану (метри).

source: The radius of HeatBlaster tool (m).
es: Radio de la herramienta del lanzallamas (m).
it: Il raggio di azione dell'HeatBlaster (m).
pt_br: O raio da ferramenta de Explosor de Calor (m).
ru: Радиус инструмента Тепловой Бластер (метры).
uk: Радіус інструменту Тепловий Бластер (метри).

source: The radius of bomb explosions (m).
es: Radio de la explosión de la bomba (m).
it: Il raggio di azione delle esplosioni delle bombe (m).
pt_br: O raio das explosões das Bombas (m).
ru: Радиус взрыва бомбы (метры).
uk: Радіус вибуху бомби (метри).

source: The radius of the blast tool (m).
es: Radio de la herramienta de explosiones (m).
it: Il raggio di azione dell'HeatBlaster (m).
pt_br: O raio da ferramenta de Explosão (m).
ru: Радиус взрывного инструмента (метры).
uk: Радіус вибухового інструменту (метри).

source: The selected ship does not have a ropes layer
es: El barco seleccionado no tiene una capa de cuerdas
it: La nave selezionata non contiene un layer delle funi
pt_br: O navio ou objeto selecionado não contém uma camada de cordas
ru: Выбранное судно не имеет слоя канатов
uk: Обране судно не має шару канатів

source: The selected ship does not have a structural layer
es: El barco seleccionado no tiene una capa estructural
it: La nave selezionata non contiene un layer strutturale
pt_br: O navio ou objeto selecionado não contém uma camada de estrutura
ru: Выбранное судно не имеет структурного слоя
uk: Обране судно не має структурного шару

source: The selected ship does not have an electrical layer
es: El barco seleccionado no tiene una capa electrica
it: La nave selezionata non contiene un layer elettrico
pt_br: O navio ou objeto selecionado não contém uma camada elétrica
ru: Выбранное судно не имеет электрического слоя
uk: Обране судно не має електричного шару

source: The selected ship does not have an exterior layer
es: El barco seleccionado no tiene una capa externa
it: La nave selezionata non contiene un layer esteriore
pt_br: O navio ou objeto selecionado não contém uma camada externa
ru: Выбранный корабль не имеет наружного слоя текстуры
uk: Обраний корабель не має зовнішнього шару

source: The selected ship does not have an interior layer
es: El barco seleccionado no tiene una capa interna
it: La nave selezionata non contiene un layer interno
pt_br: O navio ou objeto selecionado não contém uma camada interna
ru: Выбранный корабль не имеет интерьерного слоя текстуры
uk: Обраний корабель не має внутрішнього шару

source: The ship is password-protected, please provide the password to continue:
es: Este barco esta protegido por contraseña, por favor coloque la contraseña para continuar:
it: Questa nave è protetta da un password; digita la password per proseguire:
pt_br: Este navio ou objeto é protegido por senha, por favor insira a senha para continuar:
ru: Корабль защищен паролем, пожалуйста, введите пароль, чтобы продолжить:
uk: Корабель захищено паролем, будь ласка, введіть пароль, щоб продовжити:

source: The ship may not be saved unless the following error(s) are resolved:
es: El barco no será guardado antes de corregir los siguientes errores:
it: La nave non può essere salvata fino a quando i seguenti errori non sono stati risolti:
pt_br: Este navio ou objeto não poderá ser salvo até que os seguintes problemas sejam resolvidos:
ru: Корабль не может быть сохранен, пока не будет устранена следующая ошибка(и):
uk: Корабель не може бути збережений, доки не буде усунуто наступну помилку(и):

source: The size of the eraser tool.
es: Radio de la herramienta de borrar.
it: Le dimensioni del cancellino.
pt_br: O tamanho da ferramenta de apagar.
ru: Размер инструмента ластика.
uk: Розмір інструменту гумки.

source: The size of the line tool.
es: Radio de la herramienta de lineas.
it: Le dimensioni dello strumento linee.
pt_br: O tamanho da ferramenta de linha.
ru: Размер линейного инструмента.
uk: Розмір лінійного інструменту.

source: The size of the pencil tool.
es: Radio de la herramienta de lápiz.
it: Le dimensioni dello strumento matita.
pt_br: O tamanho da ferramenta de lápis.
ru: Размер инструмента "карандаш".
uk: Розмір інструменту "олівець".
