Repository: GabrieleGiuseppini/Floating-Sandbox
Catalog: Localization/*/ui_strings.po
Languages: es, it, pt_br, ru, uk

source: &Controls
es: &Controles
it: &Controlli
pt_br: &Controles
ru: &Управление
uk: &Управління

source: &File
es: &Archivo
pt_br: &Início
ru: &Файл
uk: &Файл

source: &Help
es: &Ayuda
it: &Aiuto
pt_br: &Ajuda
ru: &Справка
uk: &Довідка

source: &NPCs
it: &NPC
ru: &НИПы
uk: &НПС

source: &Options
es: &Opciones
it: &Opzioni
pt_br: &Opções
ru: &Параметры
uk: &Параметри

source: &ShipBuilder
es: &Constructor de barcos
pt_br: &Construtor de Navios/Objetos
ru: &Судостроитель
uk: &Суднобудівник

source: &Tools
es: &Herramientas
it: &Strumenti
pt_br: &Ferramentas
ru: &Инструменты
uk: &Інструменти

source: (Game View)
es: (Vista del juego)
it: (Visualizzazione gioco)
pt_br: (Visualização do jogo)
ru: (Просмотр игры)
uk: (Перегляд гри)

source: (Min 5 characters, at least one digit or punctuation character)
es: (Mínimo 5 caracteres, por lo menos un digito o signo de puntuación)
it: (Almeno 5 lettere, e almeno un numero o una punteggiatura)
pt_br: (Mínimo de 5 caracteres, incluindo pelo menos um número ou um símbolo)
ru: (Не менее 5 знаков, по крайней мере одна цифра или знак препинания)
uk: (Не менше 5 знаків, принаймні одна цифра або розділовий знак)

source: (Structure View)
es: (Vista estructural)
it: (Visualizzazione struttura)
pt_br: (Visualização de Estrutura)
ru: (Просмотр структуры)
uk: (Перегляд структури)

source: 3RD-PARTY SOFTWARE
es: Software de Terceros
it: SOFTWARE AGGIUNTIVO
pt_br: SOFTWARE DE TERCEIROS
ru: ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ТРЕТЬЕЙ СТОРОНЫ
uk: ПРОГРАМНЕ ЗАБЕЗПЕЧЕННЯ ТРЕТЬОЇ СТОРОНИ

source: 90 CCW
es: 90 en sentido Antihorario
it: 90 AO
pt_br: 90° anti-horário
ru: 90º налево
uk: 90º ліворуч

source: 90 CW
es: 90 en sentido Horario
it: 90 O
pt_br: 90° horário
ru: 90º направо
uk: 90º праворуч

source: A G2-Labs Production
es: Una producción G2-Labs
it: Una produzione G2-Labs
pt_br: Uma produção da G2 Labs
ru: Продукция G2-Labs
uk: Виробництво G2-Labs

source: A New Version Is Available!
es: Una nueva versión esta disponible!
it: È disponibile una nuova versione!
pt_br: Uma nova versão está disponível! Atualize agora!
ru: Доступна новая версия!
uk: Доступна нова версія!

source: AM Bomb Implosion Strength
es: Fuerza de implosión bomba anti materia
it: Potenza implosione bomba AM
pt_br: Força de implosão das Bombas Anti-Matéria
ru: Сила взрыва Анти-Материальной Бомбы
uk: Сила вибуху Анти-Матеріальної Бомби

source: Abandon And Return
es: Abandonar y regresar
it: Torna al simulatore
pt_br: Descartar e Retornar
ru: Бросить и вернуться
uk: Кинути і повернутися

source: Abort
es: Abortar
it: Interrompi
pt_br: Interromper
ru: Отмена
uk: Скасувати

source: Abort the paste operation.
es: Abortar la accion de pegado.
it: Interrompi l'operazione di incollaggio.
pt_br: Cancelar a operação de colar.
ru: Отменить операцию вставки.
uk: Скасувати операцію вставки.

source: About %s
es: Acerca de %s
it: Informazioni su %s
pt_br: Sobre %s
ru: Об игре %s
uk: Про гру %s

source: About and Credits
es: Acerca de y créditos
it: Informazioni e ringraziamenti
pt_br: Sobre o jogo e créditos
ru: Об игре и Благодарности
uk: Про Гру та Подяки

source: Add or clean this layer.
es: Añadir o limpiar esta capa.
it: Aggiungi o azzera il layer.
pt_br: Inserir ou limpar esta camada...
ru: Добавьте или очистите этот слой.
uk: Додайте або очистіть цей пласт.

source: Add/Clear
es: Añadir/Borrar
it: Aggiungi/azzera
pt_br: Inserir/Limpar
ru: Добавить/убрать
uk: Додати/прибрати

source: Adjust Terrain
es: Ajustar Terreno
it: Regola fondale
pt_br: Ajustar o Terreno
ru: Настройка Рельефа
uk: Налаштування Рельєфу

source: Adjusts how "splashy" water flows inside a physical body.
es: Ajusta cuan "loca" el agua entra dentro de un cuerpo físico.
it: Regola la vivacità dell'acqua all'interno di un oggetto.
pt_br: Ajusta a intensidade de respingos do fluxo de água dentro de um corpo físico.
ru: Регулирует, с каким усилием "брызжущая" вода втекает внутрь физического тела.
uk: Регулює, з яким зусиллям "бризкаюча" вода втікає всередину фізичного тіла.

source: Adjusts how detailed water inside a physical body looks.
es: Ajusta el detalle del agua dentro de los cuerpos físicos.
it: Regola il livello di dettaglio dell'acqua all'interno di un oggetto.
pt_br: Ajusta o nível de detalhamento visual da água contida em um corpo físico.
ru: Регулирует, насколько детализированной выглядит вода внутри физического тела.
uk: Регулює, наскільки деталізованою виглядає вода всередині фізичного тіла.

source: Adjusts how long it takes for smoke to vanish.
es: Ajusta cuanto tiempo le toma al humo desvanecerse.
it: Regola il tempo necessario affinché il fumo svanisca.
pt_br: Ajusta o tempo de dissipação da fumaça.
ru: Регулирует, сколько времени потребуется для исчезновения дыма.
uk: Регулює, скільки часу потрібно для зникнення диму.

source: Adjusts how much the ocean floor rolls up and down.
es: Ajusta cuanto se mueve el fondo oceánico hacia arriba y hacia abajo.
it: Regola l'ondulazione del fondale oceanico.
pt_br: Ajusta a amplitude de oscilação do fundo oceânico.
ru: Регулирует, неровность океанского дна.
uk: Регулює нерівність океанського дна.

source: Adjusts how wide light emitted by luminescent materials spreads out.
es: Ajusta que tanto se dispersa la luz emitida por materiales luminiscentes.
it: Regola l'estensione della luce diffusa dai materiali luminosi.
pt_br: Ajusta a dispersão angular da luz emitida por materiais luminescentes.
ru: Регулирует, насколько широко распространяется свет, излучаемый люминесцентными материалами.
uk: Регулює, наскільки широко поширюється світло, що випромінюється люмінесцентними матеріалами.

source: Adjusts the amount by which internal pressure in the ship counterbalances the external hydrostatic pressure. Lower values increase the depth at which internal pressure stops contributing to the total hydrostatic pressure.
es: Ajusta la cantidad de presión hidrostática que el barco ejerce al exterior. Valores menores incrementan la profundidad a la cual la presión interna deja de contribuir a la presión hidrostática.
it: Regola la contro-pressione esercitata dalla pressione interna. Valori bassi fanno sì che la pressione interna smetta di controbilanciare quella esterna a maggiori profondità.
pt_br: Ajusta o grau em que a pressão interna da embarcação contrabalança a pressão hidrostática externa. Valores menores aumentam a profundidade na qual a pressão interna deixa de contribuir para a pressão hidrostática total.
ru: Регулирует величину, на которую внутреннее давление в судне уравновешивает внешнее гидростатическое давление. Более низкие значения увеличивают глубину, на которой внутреннее давление перестает вносить вклад в общее гидростатическое давление.
uk: Регулює величину, на яку внутрішній тиск у судні врівноважує зовнішній гідростатичний тиск. Нижчі значення збільшують глибину, на якій внутрішній тиск перестає робити внесок у загальний гідростатичний тиск.

source: Adjusts the amount of heat generated by working electrical elements, such as lamps and generators.
es: Ajusta cual es la cantidad de calor generado por elementos eléctricos, como lamparas y generadores.
it: Regola il calore emesso da elementi elettrici in tensione, quali lampade e generatori.
pt_br: Ajusta a quantidade de calor gerado por elementos elétricos em operação, como lâmpadas e geradores.
ru: Регулирует количество тепла, выделяемого работающими электрическими элементами, такими как лампы и генераторы.
uk: Регулює кількість тепла, що виділяється працюючими електричними елементами, такими як лампи та генератори.

source: Adjusts the amount of weaknesses injected in structures. Changes to this setting will only be in effect when the next ship is loaded.
es: Cambia la debilidad inducida en las estructuras. Cambios a esta configuración son solo visibles cuando un nuevo barco es cargado.
it: Regola la quantità di punti deboli iniettati nelle strutture. Le modifiche a questa impostazione saranno in vigore solo quando viene caricata la nave successiva.
pt_br: Ajusta a quantidade de pontos fracos introduzidos nas estruturas. Alterações nesta configuração só terão efeito ao carregar o próximo navio.
ru: Регулирует количество слабых мест, вводимых в конструкции. Изменения в этой настройке вступят в силу только при загрузке следующего судна.
uk: Регулює кількість слабких місць, що вводяться в конструкції. Зміни в цьому налаштуванні набудуть чинності тільки під час завантаження наступного судна.

source: Adjusts the blast force generated by bomb explosions.
es: Ajusta la fuerza de la explosión generada por las bombas.
it: Regola la potenza dell'esplosione delle bombe.
pt_br: Ajusta a força de explosão gerada por detonações de bombas.
ru: Регулирует силу взрыва, создаваемую взрывами бомб.
uk: Регулює силу вибуху, створювану вибухами бомб.

source: Adjusts the blast force generated by the Blast tool.
es: Ajusta la fuerza de la explosión generada por la herramienta de explosión.
it: Regola la potenza dello strumento "Esplosione".
pt_br: Ajusta a força de explosão gerada pela ferramenta Explosão.
ru: Регулирует силу взрыва, создаваемую инструментом взрыва.
uk: Регулює силу вибуху, створювану інструментом вибуху.

source: Adjusts the breaking point of springs under stress. Has no effect on the rigidity of a ship.
es: Ajusta el punto de ruptura de los resortes bajo estrés. No tiene efecto sobre la rigidez del barco.
it: Regola il punto di rottura di materiali sotto stress strutturale. Non ha alcun effetto sulla rigidità di una nave.
pt_br: Ajusta o ponto de ruptura das molas sob tensão. Não afeta a rigidez da embarcação.
ru: Регулирует предел прочности пружин под напряжением. Не оказывает никакого влияния на жесткость корабля.
uk: Регулює межу міцності пружин під напругою. Не має жодного впливу на жорсткість корабля.

source: Adjusts the chaoticness of flames.
es: Ajusta el caos de las llamas.
it: Regola la caoticità delle fiamme.
pt_br: Ajusta o nível de caos das chamas.
ru: Регулирует хаотичность пламени.
uk: Регулює хаотичність полум'я.

source: Adjusts the contrast of the user-drawn ocean floor terrain. Setting this to zero disables the ability to adjust the ocean floor.
es: Ajusta el contraste del suelo marino dibujado por el usuario. Colocar la configuración a cero deshabilita la habilidad de ajustar el suelo marino.
it: Regola il contrasto del fondale oceanico disegnato dall'utente. L'impostazione di questo valore a zero disabilita la possibilità di regolare il fondale oceanico.
pt_br: Ajusta o contraste do terreno do fundo oceânico desenhado pelo usuário. Configurar este valor como zero desativa a possibilidade de ajustar o fundo oceânico.
ru: Настраивает контрастность нарисованного пользователем рельефа океанского дна. Установка этого значения на ноль отключает возможность регулировки дна океана.
uk: Налаштовує контрастність намальованого користувачем рельєфу океанського дна. Встановлення цього значення на нуль відключає можливість регулювання дна океану.

source: Adjusts the contrast of water inside physical bodies.
es: Ajusta el contraste del agua dentro de cuerpos físicos.
it: Regola il contrasto dell'acqua all'interno di un oggetto.
pt_br: Ajusta o contraste da água dentro de corpos físicos.
ru: Регулирует контраст воды внутри физических тел.
uk: Регулює контраст води всередині фізичних тіл.

source: Adjusts the density of air, and thus also the buoyancy it exerts on physical bodies.
es: Ajusta la densidad el aire, y por lo tanto la flotabilidad que genera sobre los objetos físicos.
it: Regola la densità dell'aria, e quindi anche la galleggiabilità che esercita sugli oggetti.
pt_br: Ajusta a densidade do ar e, consequentemente, a força de empuxo que ele exerce sobre corpos físicos.
ru: Регулирует плотность воздуха, а следовательно, и плавучесть, которую он оказывает на физические тела.
uk: Регулює густину повітря, а отже, і плавучість, яку воно чинить на фізичні тіла.

source: Adjusts the density of sea water, and thus also the buoyancy it exerts on physical bodies.
es: Ajusta la densidad el agua de mar, y por lo tanto la flotabilidad que genera sobre los objetos físicos.
it: Regola la densità dell'acqua di mare, e quindi anche la galleggiabilità che esercita sugli oggetti.
pt_br: Ajusta a densidade da água do mar e, consequentemente, a força de empuxo que ela exerce sobre corpos físicos.
ru: Регулирует плотность морской воды, а следовательно, и плавучесть, которую она оказывает на физические тела.
uk: Регулює щільність морської води, а отже, і плавучість, яку вона чинить на фізичні тіла.

source: Adjusts the density of smoke particles.
es: Ajusta la densidad de las partículas de humo.
it: Regola la densità delle particelle di fumo.
pt_br: Ajusta a densidade das partículas de fumaça.
ru: Регулирует плотность частиц дыма.
uk: Регулює щільність частинок диму.

source: Adjusts the elasticity of collisions between materials.
es: Ajusta la elasticidad de las colisiones entre materiales.
it: Regola l'elasticità delle collisioni tra materiali.
pt_br: Ajusta a elasticidade das colisões entre materiais.
ru: Регулирует эластичность столкновений между материалами.
uk: Регулює пружність зіткнень між матеріалами.

source: Adjusts the elasticity of collisions with the ocean floor.
es: Ajusta la elasticidad de las colisiones con el fondo marino.
it: Regola l'elasticità delle collisioni con il fondale oceanico.
pt_br: Ajusta a elasticidade das colisões com o fundo do oceano.
ru: Регулирует упругость столкновений с океанским дном.
uk: Регулює пружність зіткнень з океанським дном.

source: Adjusts the extent of blast force fields onto NPCs.
es: Ajustar la extensión del campo de fuerza de la explosión en los NPCs.
it: Regola l'impatto delle esplosioni sugli NPC.
pt_br: Ajusta a intensidade do campo de força da explosão sobre NPCs.
ru: Регулирует степень воздействия силовых полей взрыва на НИПов.
uk: Налаштовує ступінь дії полів сили вибуху на НПС.

source: Adjusts the extent to which rain floods exposed areas of a ship.
es: Ajusta la extensión a la cual la lluvia inunda areas expuestas del barco.
it: Regola la misura in cui la pioggia inonda le aree esposte di una nave.
pt_br: Ajusta a intensidade com que a chuva inunda áreas expostas de uma embarcação.
ru: Регулирует степень затопления дождем открытых участков судна.
uk: Регулює ступінь затоплення дощем відкритих ділянок судна.

source: Adjusts the extent to which structures are weakened. Changes to this setting will only be in effect when the next ship is loaded.
es: Cambia hasta que punto las estructuras pueden ser debilitadas. Cambios a esta configuración son solo visibles cuando un nuevo barco es cargado.
it: Regola la misura in cui le strutture sono indebolite. Le modifiche a questa impostazione saranno in vigore solo quando viene caricata la nave successiva.
pt_br: Ajusta o grau de enfraquecimento das estruturas. Alterações nesta configuração só terão efeito ao carregar o próximo navio.
ru: Регулирует степень ослабления структур. Изменения в этой настройке вступят в силу только при загрузке следующего судна.
uk: Регулює ступінь ослаблення структур. Зміни в цьому налаштуванні набудуть чинності тільки під час завантаження наступного судна.

source: Adjusts the friction exherted by and onto NPC particles.
es: Ajusta la fricción ejercida por y en las partículas NPC.
it: Regola l'attrito esercitato da e con le particelle degli NPC.
pt_br: Ajusta o atrito exercido pelos e sobre partículas de NPC.
ru: Регулирует трение, которое оказывается на частицы НИПов.
uk: Регулює тертя частинок НПС і на них.

source: Adjusts the friction exherted by the ocean floor.
es: Ajusta la fricción ejercida por el fondo marino.
it: Regola l'attrito esercitato dal fondale oceanico.
pt_br: Ajusta o atrito exercido pelo fundo do oceano.
ru: Регулирует трение, создаваемое океанским дном.
uk: Регулює тертя, яке створює океанське дно.

source: Adjusts the frictional drag force (or 'skin' drag) exerted by air on physical bodies.
es: Ajusta la fuerza del arrastre por fricción (o fricción superficial) ejercido por el aire en cuerpos físicos.
it: Regola l'attrito esercitato dall'aria sugli oggetti.
pt_br: Ajusta a força de arrasto por atrito (ou arrasto de superfície) exercida pelo ar sobre corpos físicos.
ru: Регулирует силу трения (или "оболочного" сопротивления), оказываемую воздухом на физические тела.
uk: Регулює силу тертя (або "оболонкового" опору), що чиниться повітрям на фізичні тіла.

source: Adjusts the frictional drag force (or 'skin' drag) exerted by sea water on physical bodies.
es: Ajusta la fuerza del arrastre por fricción (o fricción superficial) ejercido por el agua en cuerpos físicos.
it: Regola l'attrito esercitato dall'acqua di mare sugli oggetti.
pt_br: Ajusta a força de arrasto por atrito (ou arrasto de superfície) exercida pela água do mar sobre corpos físicos.
ru: Регулирует силу трения (или «поверхностного» сопротивления), оказываемую морской водой на физические тела.
uk: Регулює силу тертя (або "поверхневого" опору), що чиниться морською водою на фізичні тіла.

source: Adjusts the global damping of velocities.
es: Ajusta la amortiguación global de las velocidades.
it: Regola lo smorzamento globale delle velocità.
pt_br: Ajusta o amortecimento global das velocidades.
ru: Регулирует глобальное подавление скоростей.
uk: Регулює глобальне придушення швидкостей.

source: Adjusts the hardness of the silt layer on top of the ocean floor, which slowly buries ship wrecks over time. Setting to 1.0 disables completely the simulation of silt.
es: Ajusta la dureza de la capa de limo en el tope del fondo del océano, que lentamente hunde los pecios mientras pasa el tiempo. Colocar esta configuración en 1.0 deshabilita la simulación de limo.
it: Regola la consistenza dello strato di sedimento sul fondale oceanico, il quale seppellisce lentamente i relitti. Impostando questo valore a 1.0 disabiliterà completamente la simulazione dello strato di sedimento.
pt_br: Ajusta a dureza da camada de lodo sobre o fundo do oceano, que gradualmente enterra destroços de navios ao longo do tempo. Configurar para 1,0 desativa completamente a simulação do lodo.
ru: Регулирует твердость слоя ила на дне океана, который с течением времени медленно закапывает обломки кораблей. Установка на 1.0 полностью отключает моделирование ила.
uk: Регулює твердість шару мулу на дні океану, який з плином часу повільно закопує уламки кораблів. Встановлення на 1.0 повністю вимикає моделювання мулу.

source: Adjusts the heat generated by fire; together with the maximum number of burning particles, determines the speed with which fire spreads to adjacent particles.
es: Ajusta el calor generado por el fuego; en conjunto con el máximo numero de partículas quemándose, determina la velocidad a la cual el fuego se dispersa a las partículas cercanas.
it: Regola il calore sviluppato dalla combustione; insieme al numero massimo di particelle che possono bruciare, determina la velocità con cui il fuoco si propaga alle particelle adiacenti.
pt_br: Ajusta o calor gerado pelo fogo; juntamente com o número máximo de partículas em combustão, determina a velocidade com que o fogo se propaga para partículas adjacentes.
ru: Регулирует тепло, выделяемое огнем; вместе с максимальным количеством горящих частиц определяет скорость, с которой огонь распространяется на соседние частицы.
uk: Регулює тепло, що виділяється вогнем; разом із максимальною кількістю частинок, що горять, визначає швидкість, з якою вогонь поширюється на сусідні частинки.

source: Adjusts the height of ocean waves wrt their optimal value, which is determined by wind speed.
es: Ajusta la altura a la cual llegan las olas con su valor optimo, que es determinado por la velocidad del viento.
it: Regola l'altezza delle onde rispetto al loro valore ottimale, il quale è determinato dalla velocità del vento.
pt_br: Ajusta a altura das ondas do oceano em relação ao valor ótimo, que é determinado pela velocidade do vento.
ru: Регулирует высоту океанских волн относительно их оптимального значения, которое определяется скоростью ветра.
uk: Регулює висоту океанських хвиль щодо їхнього оптимального значення, яке визначається швидкістю вітру.

source: Adjusts the kinetic friction coefficient.
es: Ajusta el coeficiente de fricción cinética.
it: Regola il coefficiente di frizione cinetica.
pt_br: Ajusta o coeficiente de atrito cinético.
ru: Регулирует коэффициент кинетической энергии.
uk: Регулює кінетичний коефіцієнт тертя.

source: Adjusts the magnitude of forces generated by high-velocity impacts with water.
es: Ajusta la magnitud de la fuerza generada por impactos a alta velocidad con el agua.
it: Regola le forze generate dagli impatti ad alta velocità con l'acqua.
pt_br: Ajusta a magnitude das forças geradas por impactos de alta velocidade na água.
ru: Регулирует величину сил, возникающих при ударах воды с большой скоростью.
uk: Регулює величину сил, що виникають під час ударів води з великою швидкістю.

source: Adjusts the magnitude of the waves caused by water displacement.
es: Ajusta la magnitud de las olas causadas por el desplazamiento del agua.
it: Regola l'ampiezza delle onde causate dal movimento di oggetti sulla superficie dell'acqua.
pt_br: Ajusta a magnitude das ondas geradas pelo deslocamento de água.
ru: Регулирует величину волн, вызванных смещением воды.
uk: Регулює величину хвиль, викликаних зміщенням води.

source: Adjusts the number of atmospheres that are injected or drained by the inject pressure tool (atm).
es: Ajusta el numero de atmosferas inducidas o extraídas por la herramienta de presión (atm).
it: Regola il numero di atmosfere iniettate o drenate dallo strumento di pressurizzazione (atm).
pt_br: Ajusta o número de atmosferas injetadas ou drenadas pela ferramenta Injetar Pressão (atm).
ru: Регулирует количество атмосфер, нагнетаемых или откачиваемых инструментом давления нагнетания (атм).
uk: Регулює кількість атмосфер, що нагнітаються або відкачуються інструментом тиску нагнітання (атм).

source: Adjusts the power of water pumps.
es: Ajusta el poder de las bombas de agua.
it: Regola la potenza delle pompe.
pt_br: Ajusta a potência das bombas de água.
ru: Регулирует мощность водяных насосов.
uk: Регулює потужність водяних насосів.

source: Adjusts the pressure drag force (or 'form' drag) exerted by air on physical bodies.
es: Ajusta el arrastre por presión (o arrastre de 'rozamiento') ejercido por el aire sobre cuerpos físicos.
it: Regola la resistenza idrodinamica esercitata dall'aria sugli oggetti.
pt_br: Ajusta a força de arrasto por pressão (ou arrasto de forma) exercida pelo ar sobre corpos físicos.
ru: Регулирует силу сопротивления давлению (или "форму" сопротивления), оказываемую воздухом на физические тела.
uk: Регулює силу опору тиску (або "форму" опору), що чиниться повітрям на фізичні тіла.

source: Adjusts the pressure drag force (or 'form' drag) exerted by sea water on physical bodies.
es: Ajusta el arrastre por presión (o arrastre de 'rozamiento') ejercido por el agua de mar sobre cuerpos físicos.
it: Regola la resistenza idrodinamica esercitata dall'acqua di mare sugli oggetti.
pt_br: Ajusta a força de arrasto por pressão (ou arrasto de forma) exercida pela água do mar sobre corpos físicos.
ru: Регулирует силу сопротивления давления (или сопротивление формы), оказываемое морской водой на физические тела.
uk: Регулює силу опору тиску (або опір форми), що чиниться морською водою на фізичні тіла.
