Repository: GabrieleGiuseppini/Floating-Sandbox
Catalog: Localization/*/ui_strings.po
Languages: es, it, pt_br, ru, uk

source: The size of the rectangle tool's line.
es: Tamaño de la línea de la herramienta rectangular.
it: Le dimensioni del bordo del rettangolo.
pt_br: O tamanho da ferramenta de retângulo.
ru: Размер линии инструмента прямоугольника.
uk: Размер линии инструмента прямоугольника.

source: The specified texture image is empty, and thus it may not be used for this ship.
es: La imagen de textura especificada esta vacía, y por lo tanto no puede ser usada para este barco.
it: L'immagine è vuota, per cui non può essere utilizzata per questa nave.
pt_br: A imagem de textura especificada está vazia e, portanto, não pode ser usada neste navio/objeto.
ru: Указанное изображение текстуры пустое, поэтому оно не может быть использовано для этого корабля.
uk: Зазначене зображення текстури порожнє, тому воно не може бути використане для цього корабля.

source: The starting radius of the damage caused by destructive tools (m).
es: Radio de destrucción inicial causado por las herramientas destructivas (m)
it: Il raggio iniziale del danno causato dagli strumenti distruttivi (m).
pt_br: Define a área inicial afetada quando ferramentas destrutivas são aplicadas, medida em metros.
ru: Начальный радиус поражения разрушающими инструментами (метры).
uk: Початковий радіус ураження руйнівними інструментами (метри).

source: The structural layer contains at least one particle.
es: La capa estructural contiene al menos una particula.
it: Il layer strutturale contiene almeno una particella.
pt_br: A camada estrutural contém pelo menos uma partícula.
ru: Структурный слой содержит по меньшей мере одну частицу.
uk: Структурний шар містить принаймні одну частинку.

source: The structural layer contains too many particles, possibly causing the simulation to lag on low-end computers. It is advisable to reduce the number of structural particles.
es: La capa estructural contiene demasiadas partículas, posiblemente causando que la simulación se enlentezca en computadoras de bajo poder, es recomendable reducir el numero de partículas estructurales.
it: Il layer strutturale contiene troppe particelle, con il rischio di rallentare la simulazione su computer meno recenti. Si suggerisce di diminuire il numero di particelle strutturali.
pt_br: A camada estrutural contém muitas partículas, o que pode causar lentidão na simulação em computadores com baixo desempenho. É recomendável reduzir o número de partículas estruturais.
ru: Структурный слой содержит хотя бы одну частицу.Структурный слой содержит слишком много частиц, что может привести к задержке моделирования на компьютерах низкого класса. Рекомендуется уменьшить количество структурных частиц.
uk: Структурний шар містить хоча б одну частинку.Структурний шар містить занадто багато частинок, що може призвести до затримки моделювання на комп'ютерах низького класу. Рекомендується зменшити кількість структурних частинок.

source: The structural layer does not contain too many particles.
es: La capa estructural no contiene demasiadas partículas.
it: Il numero di particelle nel layer strutturale non è eccessivo.
pt_br: A camada estrutural não contém muitas partículas.
ru: Структурный слой не содержит слишком много частиц.
uk: Структурний шар не містить занадто багато частинок.

source: The structural layer is empty. Place at least one particle in it.
es: La capa estructural esta vacía. Por favor coloca al menos una partícula en ella.
it: Il layer strutturale è vuoto. Occorre collocare almeno una particella.
pt_br: A camada estrutural está vazia. Coloque pelo menos uma partícula de estrutura nela.
ru: Структурный слой пуст. Поместите в него хотя бы одну частицу.
uk: Структурний шар порожній. Помістіть у нього хоча б одну частинку.

source: The temperature of air (K).
es: Temperatura del aire (K).
it: La temperatura dell'aria (K).
pt_br: A temperatura do Ar (K).
ru: Температура воздуха (К).
uk: Температура повітря (К).

source: The temperature of water (K).
es: Temperatura del agua (K).
it: La temperatura dell'acqua (K).
pt_br: A temperatura as água (K).
ru: Температура воды (К).
uk: Температура води (К).

source: The transparency of materials' textures
es: Ajusta la transparencia de las texturas de los materiales
it: La trasparenza delle texture dei materiali
pt_br: A transparência das texturas dos materiais
ru: Прозрачность текстур материалов
uk: Прозорість текстур матеріалів

source: Thermal Conductivity (W/(m*K))
es: Conductividad térmica (W/(m*K))
it: Conduttività termica (W/(m*K))
pt_br: Condutividade Térmica (W/(m·K))
ru: Теплопроводность (Вт/(м*К))
uk: Теплопровідність (Вт/(м*К))

source: Thermal Conductivity Adjust
es: Ajuste de la conductividad térmica
it: Conduttività termica
pt_br: Ajuste da Condutividade Térmica
ru: Регулировка теплопроводности
uk: Регулювання теплопровідності

source: Thermal Expansion Coefficient (1/MK)
es: Coeficiente de expansión termal (1/MK)
it: Coefficiente di espansione termica (1/MK)
pt_br: Coeficiente de Expansão Térmica (1/MK)
ru: Коэффициент теплового расширения (1/MK)
uk: Коефіцієнт теплового розширення (1/К)

source: Thermal Switch
it: Interruttore termico
ru: Термопереключатель
uk: Термічний вимикач

source: Thermodynamics
es: Termodinamicas
it: Termodinamica
pt_br: Termodinâmicas
ru: Термодинамика
uk: Термодинаміка

source: This file is not a Floating Sandbox ship file.
es: Al archivo no esta en el formato de Floating Sandbox.
it: Questo file non è un file di navi di Floating Sandbox.
pt_br: O arquivo selecionado não é um navio ou objeto do Floating Sandbox. Por favor, escolha um arquivo com a extensão ‘'.shp’' ou uma imagem no formato ‘'.PNG’'.
ru: Этот файл не является файлом корабля Floating Sandbox.
uk: Цей файл не є файлом корабля Floating Sandbox.

source: This file is not a valid ship file - it may be corrupted or damaged.
es: Este archivo no es un archivo valido de barco - Puede estar corrupto o dañado.
it: Questo file non è corretto - potrebbe essere danneggiato.
pt_br: O arquivo selecionado não é válido - pode estar corrompido ou danificado.
ru: Этот файл не является действительным файлом корабля - он может быть поврежден или испорчен.
uk: Цей файл не є дійсним файлом корабля - він може бути пошкоджений або зіпсований.

source: This setting is for testing physical instability of the mass-spring network with different damping values; it is not meant for improving the rigidity of physical bodies.
es: Esta configuración es para probar la inestabilidad física de la masiva red de resortes con diferente valor de amortiguamiento; no esta diseñado para mejorar la rigidez de los cuerpos físicos.
it: Questo parametro serve per divertirsi con l'instabilità delle strutture aventi alti smorzamenti di velocità; il parametro non è utile a migliorare la rigidità degli oggetti.
pt_br: Esta configuração é usada para testar a instabilidade física da rede massa-mola com diferentes valores de amortecimento; não se destina a melhorar a rigidez dos corpos físicos.
ru: Этот параметр предназначен для тестирования физической нестабильности цепи масса-пружина с различными значениями демпфирования; он не предназначен для улучшения жесткости физических тел.
uk: Ця установка призначена для тестування фізичної нестійкості масово-пружинної мережі з різними значеннями демпфування; вона не призначена для підвищення жорсткості фізичних тіл.

source: This setting is for testing physical instability of the mass-spring network with high stiffness values; it is not meant for improving the rigidity of physical bodies.
es: Esta configuración es para probar la inestabilidad física de la masiva red de resortes con diferentes valores de rigidez; no esta diseñado para mejorar la rigidez de los cuerpos físicos.
it: Questo parametro serve per divertirsi con l'instabilità delle strutture aventi alte rigidità; il parametro non è utile a migliorare la rigidità degli oggetti.
pt_br: Esta configuração é para testar a instabilidade física da rede massa-mola com valores altos de rigidez; não se destina a melhorar a rigidez dos corpos físicos.
ru: Этот параметр предназначен для проверки физической нестабильности сети масса-пружина с высокими значениями жесткости; он не предназначен для улучшения жесткости физических тел.
uk: Цей параметр призначений для перевірки фізичної нестабільності мережі маса-пружина з високими значеннями жорсткості; він не призначений для поліпшення жорсткості фізичних тіл.

source: This ship cannot be loaded because it has unrecognized materials - it was likely created with a different version of Floating Sandbox or with a non-standard release.
it: Questa nave non può essere caricata in quanto contiene materiali sconosciuti; probabilmente è stata creata con una release non ufficiale di Floating Sandbox, o con una release più recente.
pt_br: Este navio ou objeto não pode ser carregado porque contém materiais não reconhecidos – provavelmente foi criado em uma versão diferente do Floating Sandbox ou em uma versão não oficial.
ru: Этот корабль не может быть загружен, потому что он имеет нераспознанные материалы - вероятно, он был создан с помощью устаревшого, или нестандартного выпуска Floating Sandbox.
uk: Цей корабель неможливо завантажити, оскільки він містить нерозпізнані матеріали - ймовірно, його було створено за допомогою іншої версії Floating Sandbox або з нестандартним релізом.

source: This ship has been created with a newer version of Floating Sandbox, and it cannot be loaded with this version. Upgrade Floating Sandbox to the newest release.
es: Este barco ha sido creado con una versión mas nueva de Floating Sandbox y no puede ser cargado en esta versión. Actualiza a la ultima versión de Floating Sandbox.
it: Questa nave è stata creata con una versione più recente di Floating Sandbox, e pertanto non può essere caricata. Aggiornare Floating Sandbox all'ultima versione.
pt_br: Este navio ou objeto foi criado em uma versão mais recente do Floating Sandbox, portanto, não pode ser carregado nesta versão. Atualize o Floating Sandbox para a versão mais recente e tente novamente.
ru: Этот корабль был создан в более новой версии Floating Sandbox, и он не может быть загружен в этой версии. Обновите Floating Sandbox до новейшей версии.
uk: Цей корабель було створено в новішій версії Floating Sandbox, і його не можна завантажити в цій версії. Оновіть Floating Sandbox до найновішої версії.

source: This ship is password-protected for editing.
es: Este barco esta protegido por contraseña para ser editado.
it: Questa nave è protetta per le modifiche da una password.
pt_br: Este navio ou objeto é protegido por senha, portanto, insira a senha do navio ou objeto para edita-lo.
ru: Этот корабль защищен паролем для редактирования.
uk: Цей корабель захищений паролем для редагування.

source: This software is licensed to Mattia, Elia, and all the others kids in the world!
es: Este software esta licenciado para Mattia, Elia y todos los niños de todo el mundo!
it: Questo software è dato in licenza a Mattia, Elia, e a tutti gli altri bambini del mondo!
pt_br: Este software está licenciado para Mattia, Elia e todas as outras crianças do mundo!
ru: Лицензия для Маттиа, Элии и всех остальных детей мира!
uk: Ліцензія для Маттіа, Елії та всіх інших дітей світу!

source: Threshold Temperature (K)
it: Temperatura soglia (K)
ru: Пороговая температура для переключения (K)
uk: Порогова Температура (K)

source: Timed Switch
it: Interruttore a tempo
ru: Переключатель замедленного действия
uk: Перемикач часу

source: Timer Duration (s)
it: Ritardo
ru: Время Таймера (сек.)
uk: Тривалість таймера (с)

source: Toggle Anti-Matter Bomb
es: Bombas Anti-Materia
it: Bomba anti-materia
pt_br: Inserir Bombas Anti-Matéria
ru: Антиматериальная бомба
uk: Антиматеріальна бомба

source: Toggle Impact Bomb
es: Bomba de impacto
it: Bomba a impatto
pt_br: Inserir Bombas de Impácto
ru: Граната
uk: Граната

source: Toggle Physics Probe
es: Sonda de sensores
it: Sonda fisica
pt_br: Inserir Sonda de Física
ru: Переключить физический зонд
uk: Переключити фізичний зонд

source: Toggle Pin
es: Colocar/Quitar Pin
it: Spillo
pt_br: Inserir Ponto de Congelamento
ru: Прицепить булавку (гвоздик)
uk: Причепити шпильку (гвоздик)

source: Toggle RC Bomb
es: Bomba a Control Remoto
it: Bomba telecomandata
pt_br: Inserir Bombas RC
ru: Радиоуправляемая бомба
uk: Радіокерована бомба

source: Toggle RC Fire-Extinguishing Bomb
es: Alternar bomba de extinción de incendios RC
it: Bomba estinguente
pt_br: Inserir Bomba de Extinção de Incêndio RC
ru: Радиоуправляемая Огнетушающая Бомба
uk: Перемкніть Вогнегасну бомбу

source: Toggle Switch
es: Llave
it: Interruttore a levetta
pt_br: Inserir Interruptor
ru: Перекидной переключатель
uk: Радіокерована бомба

source: Toggle Timer Bomb
es: Bomba de tiempo
it: Bomba ad orologeria
pt_br: Inserir Bombas-Relógio
ru: Бомба с таймером
uk: Бомба з таймером

source: Toggle to Exterior With Non-NPC Tool
es: Alternar al exterior con una herramienta que no sea NPC
it: Cambia ad esteriore con strumenti non-NPC
pt_br: Alternar para a Vista Externa com a Ferramenta Não-NPC
ru: Переключение На Вид Снаружи С Инструментом, Не относящимся к НИПам
uk: Перемикання на зовнішній вигляд за допомогою інструмента, що не є NPC

source: Tolerance:
es: Tolerancia:
it: Tolleranza:
pt_br: Tolerância:
ru: Толерантность:
uk: Толерантність:

source: Too many attempts, aborting.
es: Demasiados intentos, abortando.
it: Tentativi esauriti, operazione annullata.
pt_br: Muitas tentativas, cancelando.
ru: Слишком много попыток, прерывание.
uk: Занадто багато спроб, переривання.

source: Tool Settings
es: Configuraciones de herramientas
it: Parametri strumenti
pt_br: Configurações das Ferramentas
ru: Настройки инструмента
uk: Налаштування інструменту

source: Tools Volume
es: Volumen de las Herramientas
it: Volume suoni strumenti
pt_br: Volume das Ferramentas
ru: Громкость инструментов
uk: Гучність інструментів

source: Trace a structure covering the texture layer.
it: Crea una struttura coprente il layer esterno.
ru: Трасировка изображения в структурный слой.
uk: Обведіть структуру, що покриває шар текстури.

source: Translate the texture layer.
it: Trasla il layer strutturale.
ru: Трансляция слоя изображения.
uk: Перекладіть шар текстури.

source: Transparency
es: Transparencia
it: Trasparenza
pt_br: Transparência
ru: Прозрачность
uk: Прозорість

source: Transparent:
es: Transparente:
it: Trasparente:
pt_br: Transparente:
ru: Прозрачный:
uk: Прозорість:

source: Triangles
es: Triangulos
it: Triangoli
pt_br: Triângulos
ru: Треугольники
uk: Трикутники

source: Trigger Lightning
es: Generar Rayo
it: Provoca fulmine
pt_br: Invocar Raio
ru: Ударить молнией
uk: Вдарити блискавкою

source: Trigger Rogue Wave
es: Generar Ola gigante
it: Provoca onda anomala
pt_br: Invocar Onda Gigante
ru: Вызвать волну
uk: Викликати хвилю

source: Trigger Storm
es: Generar Tormenta
it: Provoca tempesta
pt_br: Invocar Tempestade
ru: Вызвать шторм
uk: Викликати шторм

source: Trigger Tsunami
es: Generar Tsunami
it: Provoca tsunami
pt_br: Invocar Tsunami
ru: Вызвать цунами
uk: Викликати цунамі

source: Trim
es: Desviación
it: Ritaglio
pt_br: Aparar
ru: Отклонение
uk: Відхилення

source: Trim Electrical
es: Ajustar eléctrica
it: Ritaglio layer elettrico
pt_br: Ajustar a Elétrica
ru: Электрическое отклонение
uk: Електричне відхилення

source: Trim:
es: Ajustar:
it: Assetto:
pt_br: Ajustar:
ru: Отклонение:
uk: Відхилення:

source: True
es: Verdadero
pt_br: Verdadeiro
ru: Включить
uk: Увімкнути

source: Tsunami Rate
es: Frecuencia de los tsunamis
it: Frequenza tsunami
pt_br: Taxa de Tsunamis
ru: Сила цунами
uk: Сила цунамі

source: Turnaround NPC/NPCs
es: Girar NPC/NPCs
it: Gira NPC/gruppo
pt_br: Virar NPC/NPC's
ru: Развернуть НИПа/НИПов
uk: Повернути НПС

source: Type
es: Escribir
it: Tipo
pt_br: Tipo
ru: Тип
uk: Тип

source: Type New Password
es: Escribir nueva contraseña
it: Digita nuova password
pt_br: Inserir Nova Senha
ru: Введите новый пароль
uk: Введіть новий пароль

source: Type your new password:
es: Escribe tu nueva contraseña:
it: Digita la nuova password:
pt_br: Digite sua nova senha:
ru: Введите свой новый пароль:
uk: Введіть свій новий пароль:

source: Ultra-Violent Mode
es: Modo ultra violento
it: Modo ultra-violento
pt_br: Modo Ultra-Violento
ru: Ультра-жестокий режим
uk: Ультра-жорстокий режим

source: Under Construction
es: En construcción
it: In costruzione
pt_br: Em Construção
ru: В процессе строительства
uk: У процесі будівництва

source: Undo
es: Deshacer
it: Ripristina
pt_br: Desfazer
ru: Отменить
uk: Скасувати

source: Undo the last edit operation (Ctrl+Z).
es: Deshacer la ultima operación de edición (Ctrl+Z).
it: Annulla l'ultima operazione (Ctrl+Z).
pt_br: Desfazer a última edição (CRTl+Z).
ru: Отмена последней операции редактирования (Ctrl+Z).
uk: Скасування останньої операції редагування (Ctrl+Z).

source: Units system:
es: Sistema de unidades:
it: Sistema di unità di misura:
pt_br: Unidades do Sistema:
ru: Система единиц измерения:
uk: Система одиниць вимірювання:

source: Update Time
es: Actualizar tiempo
it: Durata update
pt_br: Hora da Atualização
ru: Время обновления
uk: Час оновлення

source: Use the global auto-texturization settings of the simulator.
es: Usar las configuraciones globales del simulador de auto-texturizacion.
it: Usa le impostazioni globali di auto-texturizzazione.
pt_br: Usar as configurações globais de auto-texturização do simulador.
ru: Используйте глобальные настройки автотекстурирования симулятора.
uk: Використовуйте глобальні налаштування автотекстурування симулятора.

source: Use the global auto-texturization settings.
es: Usar las configuraciones globales de auto-texturizacion.
it: Usa le impostazioni globali di auto-texturizzazione.
pt_br: Usar as configurações globais de auto-texturização.
ru: Используйте глобальные настройки автотекстурирования.
uk: Використовуйте глобальні налаштування автотекстурування.

source: User Interface
es: Interfaz de usuario
it: Interfaccia grafica
pt_br: Interface do Usuário
ru: Пользовательский интерфейс
uk: Користувацький інтерфейс

source: Validation
es: Validacion
it: Validazione
pt_br: Validação
ru: Проверка
uk: Перевірка

source: Vector Field Draw Options
es: Opciones de dibujo de campo vectorial
it: Visualizzazione campi vettoriali
pt_br: Opções de Renderização dos Campos Vetoriais
ru: Параметры рисования векторного поля
uk: Параметри малювання векторного поля

source: Velocities
es: Velocidades
it: Velocità
pt_br: Velocidades
ru: Точечная скорость
uk: Точкова швидкість

source: View
es: Vista
it: Visualizza
pt_br: Visualizar
ru: Посмотреть
uk: Переглянути

source: View the structure as it is rendered by the simulator.
es: Ver la estructura tal cual es renderizada en el simulador.
it: Visualizza la struttura derivata dalle particelle strutturali.
pt_br: Visualizar a estrutura como ela é renderizada pelo simulador.
ru: Просмотрите структуру в том виде, в котором она отображается в симуляторе.
uk: Перегляньте структуру в тому вигляді, в якому вона відображається в симуляторі.

source: WARNING! These settings will only be enforced after the simulator has been restarted!!!
es: ADVERTENCIA! Estas configuraciones solo serán aplicadas cuando el simulador se reinicie!!!
it: ATTENZIONE! Questi parametri avranno effetto solamente dopo il riavvio del simulatore!!!
pt_br: ATENÇÃO! Estas configurações só terão efeito após o jogo ser reiniciado!!!
ru: ПРЕДУПРЕЖДЕНИЕ! Эти настройки вступят в силу только после перезапуска симулятора !!!
uk: ПОПЕРЕДЖЕННЯ! Ці налаштування набудуть чинності тільки після перезапуску симулятора !!!

source: Warning
es: Advertencia
it: Attenzione
pt_br: Alerta
ru: Предупреждение
uk: Попередження

source: Water
es: Agua
it: Acqua
pt_br: Água
ru: Вода
uk: Вода

source: Water Inflow
es: Flujo de entrada del agua
it: Influsso acqua
pt_br: Entrada de Água
ru: Приток воды
uk: Приплив води

source: Water Ingress
es: Ingreso de agua
it: Influsso acqua
pt_br: Infiltração de Água
ru: Попадание воды
uk: Потрапляння води

source: Water Momenta
es: Momentum del agua
it: Quantità moto acqua
pt_br: Movimentos da Água
ru: Водяные Импульсы
uk: Водяні Імпульси

source: Water Pump
es: Bomba de agua
it: Pompa acqua
pt_br: Bomba D'água
ru: Водяная помпа
uk: Водяна помпа

source: Water Pump Power Adjust
es: Ajusta el poder de las bombas de agua
it: Potenza pompe
pt_br: Ajuste de Força da Bomba D'água
ru: Мощность водяного насоса
uk: Потужність водяного насоса

source: Water Switch
es: Llave de agua
it: Interruttore ad acqua
pt_br: Interruptor de Água
ru: Переключатель воды
uk: Перемикач води

source: Water Velocities
es: Velocidades del agua
it: Velocità acqua
pt_br: Velocidades da Água
ru: Скорости Воды
uk: Швидкості води

source: Water and Ocean
es: Agua y Oceano
it: Acqua ed oceano
pt_br: Água e Oceano
ru: Вода и океан
uk: Вода й океан

source: Waterline
es: Linea de flotación
it: Linea di galleggiamento
pt_br: Linha D'água
ru: Ватерлиния
uk: Ватерлінія

source: Waterline Analysis
es: Análisis de la linea de flotación
it: Analisi linea di galleggiamento
pt_br: Análise da Linha D'água
ru: Анализ ватерлинии
uk: Аналіз ватерлінії

source: Watertight Door
es: Compuerta Hermetica
it: Porta a tenuta stagna
pt_br: Porta Estanque
ru: Водонепроницаемая дверь
uk: Водонепроникні двері

source: Watertight Factor
es: Factor Hermetico
it: Fattore tenuta stagna
pt_br: Fator de Estanqueidade
ru: Фактор водонепроницаемости
uk: Фактор водонепроникності

source: Wave Phenomena
es: Fenómeno de las olas
it: Fenomeni marini
pt_br: Fenômenos de Ondas
ru: Волновые явления
uk: Хвильові явища

source: WaveMaker
es: Generador de olas
pt_br: Invocador de Ondas
ru: Создатель волн
uk: Творець хвиль

source: Welcome!
es: Bienvenido!
it: Benvenuti!
pt_br: Seja Bem-Vindo!
ru: Добро пожаловать!
uk: Ласкаво просимо!

source: What's the name of your new ship?
es: ¿Cual es el nombre de tu nuevo barco?
it: Qual è il nome della vostra nuova nave?
pt_br: Qual vai ser o nome do seu novo navio/objeto?
ru: Как называется ваш новый корабль?
uk: Як називається ваш новий корабель?

source: When a ship does not have a high-definition image, generates one using material-specific textures. Changes to this setting will only be visible after the next ship is loaded.
es: Cuando un barco no tiene una imagen de alta definición, genera una usando texturas de materiales específicos. Cambios a esta configuración solo serán visibles luego de que un nuevo barco es cargado.
it: Genera automaticamente un'immagine ad alta definizione - per le navi che non ne possiedono una - utilizzando textures specifiche ai materiali. Le modifiche a questa impostazione saranno visibili solamente dopo il caricamento di una nave.
pt_br: “Quando um navio não possui uma imagem em alta definição, é gerada uma usando texturas específicas dos materiais. Alterações nesta configuração só serão visíveis após o próximo navio a ser carregado.
ru: Когда у корабля нет изображения высокой четкости, он создает его с использованием текстур, специфичных для материала. Изменения в этой настройке будут видны только после загрузки следующего судна.
uk: Коли в корабля немає зображення високої чіткості, він створює його з використанням текстур, специфічних для матеріалу. Зміни в цьому налаштуванні буде видно тільки після завантаження наступного судна.
