Repository: GabrieleGiuseppini/Floating-Sandbox
Catalog: Localization/*/ui_strings.po
Languages: es, it, pt_br, ru, uk

source: Quit the game
es: Salir del juego
it: Esci dal simulatore
pt_br: Sair do Jogo
ru: Выйти из игры
uk: Вийти з гри

source: Radius
es: Radio
it: Raggio
pt_br: Raio
ru: Радиус
uk: Радіус

source: Rain Flood Adjust
es: Ajustar la inundación por lluvia
it: Inondazione pioggia
pt_br: Ajustar alagamento pelas Chuvas
ru: Дождь и наводнение
uk: Дощ і повінь

source: Random
es: Aleatorio
it: A caso
pt_br: Aleatório
ru: Рандом
uk: Випадковий

source: Rate
es: Ritmo
it: Velocità
pt_br: Taxa
ru: Скорость
uk: Швидкість

source: Ready!
es: Listo!
it: Pronti!
pt_br: Vamos Lá!
ru: Готово!
uk: Готові!

source: Recent directories:
es: Directorios Recientes:
it: Cartelle recenti:
pt_br: Diretórios Recentes:
ru: Последние каталоги:
uk: Останні каталоги:

source: Red Screen
es: Pantalla roja
it: Schermo rosso
pt_br: Tela Vermelha
ru: Красный экран
uk: Червоний екран

source: Reduce the view (-).
es: Alejar la vista (-).
it: Rimpicciolisci (-).
pt_br: Reduzir a visualização (-).
ru: Уменьшите обзор (-).
uk: Зменшіть огляд (-).

source: Reload Current Ship
es: Recargar Barco actual
it: Ri-carica nave corrente
pt_br: Recarregar objeto/navio atual
ru: Перезагрузить текущий корабль
uk: Перезавантажити поточний корабель

source: Reload Last-Modified Simulation Settings
es: Recargar las ultimas configuraciones de simulación
it: Carica precedenti parametri simulazione
pt_br: Recarregar as Configurações de Simulação Modificadas por Último
ru: Перезагрузить последние измененные настройки моделирования
uk: Перезавантажити останні змінені налаштування моделювання

source: Reload Previous Ship
es: Recargar Barco anterior
it: Carica nave precedente
pt_br: Recarregar objeto/navio Anterior
ru: Перезагрузить предыдущий корабль
uk: Перезавантажити попередній корабель

source: Reload Previous Ship on Startup
es: Recargar barco anterior al iniciar
it: Carica nave precedente all'avvio
pt_br: Recarregar o Navio Anterior na Inicialização
ru: Перезагрузить предыдущий корабль при запуске
uk: Перезавантажити попередній корабель під час запуску

source: Remove
es: Remover
it: Rimuovi
pt_br: Remover
ru: Удалить
uk: Видалити

source: Remove Electrical Layer
es: Remover capa eléctrica
it: Rimuovi layer elettrico
pt_br: Remover Camada Elétrica
ru: Удалите электрический слой
uk: Видаліть електричний шар

source: Remove Exterior Layer
es: Remover capa exterior
it: Rimuovi layer esteriore
pt_br: Remover Camada Exterior
ru: Удалить слой наружной текстуры
uk: Видалити зовнішній шар

source: Remove Interior Layer
es: Remover capa interior
it: Rimuovi layer interno
pt_br: Remover Camada Interior
ru: Удалить слой интерьерой текстуры
uk: Видалити внутрішній шар

source: Remove NPC/NPCs
es: Remover NPC/NPCs
it: Rimuovi NPC/gruppo
pt_br: Remover NPC/NPC's
ru: Удалить НИПа/НИПов
uk: Видалити НПС

source: Remove Ropes Layer
es: Remover capa de cuerda
it: Rimuovi layer funi
pt_br: Remover Camada de Cordas
ru: Удалить слой канатов
uk: Видалити шар канатів

source: Remove empty space around the ship.
es: Remueve espacio vacío al rededor del barco.
it: Rimuovi spazio vuoto attorno alla nave.
pt_br: Remover espaço vazio ao redor do navio/objeto.
ru: Удаляет пустое пространство вокруг корабля.
uk: Видаляє порожній простір навколо корабля.

source: Remove the current selection (Ctrl+D).
es: Remover la selección actual (Ctrl+D)
it: Rimuovi la selezione corrente (Ctrl+D).
pt_br: Remover a atual seleção (Crtl+D).
ru: Снять текущее выделение (Ctrl+D).
uk: Зняти поточне виділення (Ctrl+D).

source: Remove the password lock.
es: Remover la contraseña.
it: Rimuovi la protezione password.
pt_br: Remover a proteção por senha.
ru: Снимите блокировку пароля.
uk: Удаляет пустое пространство вокруг корабля.

source: Remove this layer from the ship.
es: Remover esta capa del barco.
it: Rimuovi questo layer dalla nave.
pt_br: Remover esta camada do objeto/navio.
ru: Удалите этот слой с корабля.
uk: Видаліть цей шар із корабля.

source: Rendering
es: Renderización
it: Visualizzazione
pt_br: Renderização
ru: Рендеринг
uk: Рендеринг

source: Renders clouds with additional details. Requires more computational resources.
es: Renderiza las nubes con detalles adicionales. Consume mas recursos.
it: Visualizza le nuvole con ulteriori dettagli. Richiede maggiori tempi di calcolo.
pt_br: Renderiza as nuvens com mais qualidade. Atenção: Isso requer maior poder gráfico do computador.
ru: Отображает облака с дополнительными деталями. (Требуется больше вычислительных ресурсов).
uk: Відтворює хмари з додатковими деталями. (Потрібно більше обчислювальних ресурсів).

source: Renders flames out of the HeatBlaster tool.
es: Renderiza llamas fuera la herramienta del lanzallamas .
it: Visualizzazione le fiamme dell'HeatBlaster.
pt_br: Renderiza as chamas da Ferramenta de Explosor de Calor.
ru: Визуализирует пламя с помощью инструмента Тепловой бластер.
uk: Візуалізує полум'я за допомогою інструмента Тепловий бластер.

source: Renders the ocean floor with additional details. Requires more computational resources.
es: Renderiza el fondo oceánico con detalles adicionales. Consume mas recursos.
it: Visualizza il fondale oceanico con ulteriori dettagli. Richiede maggiori tempi di calcolo.
pt_br: Renderiza o leito oceânico com mais qualidade. Atenção: Isso requer maior poder gráfico do computador.
ru: Отображает дно океана с дополнительными деталями. (Требуется больше вычислительных ресурсов).
uk: Відображає дно океану з додатковими деталями. (Потрібно більше обчислювальних ресурсів).

source: Renders the ocean with additional details. Requires more computational resources.
es: Renderiza el océano con detalles adicionales. Requiere mas poder de procesamiento.
it: Visualizza l'oceano con ulteriori dettagli. Richiede maggiori tempi di calcolo.
pt_br: Renderiza o oceano com mais qualidade. Atenção: Isso requer maior poder gráfico do computador.
ru: Отображает океан с дополнительными деталями. (Требуется больше вычислительных ресурсов).
uk: Відображає океан із додатковими деталями. (Потрібно більше обчислювальних ресурсів).

source: Repair
es: Reparar
it: Ripara
pt_br: Reparar
ru: Ремонт
uk: Ремонт

source: Repair Tool
es: Herramienta de Reparacion
it: Strumento ripara
pt_br: Ferramenta de Reparo
ru: Инструмент для ремонта
uk: Інструмент для ремонту

source: Replace Saved Settings with Current
es: Reemplazar configuraciones guardadas con las actuales
it: Sostituisci parametri salvati con parametri correnti
pt_br: Substituir Configurações Salvas pelas Atuais
ru: Заменить сохраненные настройки текущими
uk: Замінити збережені налаштування поточними

source: Reset View
es: Reiniciar Vista
it: Ripristina panoramica
pt_br: Resetar Visualização
ru: Сбросить вид
uk: Скинути вигляд

source: Resets all settings to their default values.
es: Reinicia todas las configuraciones a las que vienen por defecto.
it: Ripristina tutti i parametri ai loro valori di default.
pt_br: Retorna todas as configurações para os seus valores iniciais.
ru: Сбрасывает все настройки до значений по умолчанию.
uk: Скидає всі налаштування до значень за замовчуванням.

source: Resize Ship
es: Redimensionar Barco
it: Ri-dimensiona nave
pt_br: Redimensionar navio/objeto
ru: Изменить размер корабля
uk: Змінити розмір корабля

source: Resize the ship.
es: Redimensionar el barco.
it: Cambia le dimensioni della nave.
pt_br: Redimensionar este navio/objeto.
ru: Изменение размера корабля.
uk: Зміна розміру корабля.

source: Resolving the following warning(s) would improve this ship:
es: Resolviendo las siguientes advertencia(s) mejoraría el barco:
it: La risoluzione dei seguenti problemi migliorerebbe la nave:
pt_br: Resolver os seguintes problemas melhorará este navio/objeto:
ru: Устранение следующего(их) предупреждения(й) улучшит это судно:
uk: Усунення наступного(их) попередження(й) поліпшить це судно:

source: Restart Required
es: Reinicio Requerido
it: Riavvio necessario
pt_br: Reinicialização Necessária
ru: Требуется перезапуск
uk: Потрібен перезапуск

source: Restore
es: Restaurar
it: Ripristina
pt_br: Restaurar
ru: Восстановить
uk: Відновити

source: Restore Default Terrain
es: Restaurar terreno por defecto
it: Ripristina fondale
pt_br: Restaurar o Terreno aos valores padrão
ru: Восстановить ландшафт по умолчанию
uk: Відновити ландшафт за замовчуванням

source: Restore view settings to their defaults (HOME).
es: Restaurar la vista a la posición por defecto (INICIO).
it: Ripristina tutti i parametri ai loro valori di default (HOME).
pt_br: Restaurar as configurações de visualização para os padrões (HOME).
ru: Сбрасывает все настройки до значений по умолчанию (HOME).
uk: Скидає всі налаштування до значень за замовчуванням (HOME).

source: Restore!
es: Restaurar!
it: Ripristina!
pt_br: Restaurar!
ru: Восстановить!
uk: Відновити!

source: Retry in %d...
es: Reintentar en %d...
it: Riprova in %d...
pt_br: Repetir em %d...
ru: Повторная попытка через %d...
uk: Повторна спроба через %d...

source: Revert to Defaults
es: Revertir a por defecto
it: Ripristina parametri default
pt_br: Reverter ao original
ru: Вернуться к значениям по умолчанию
uk: Повернутися до значень за замовчуванням

source: Revert to Saved Settings
es: Revertir a las configuraciones guardadas
it: Ripristina parametri salvati
pt_br: Reverter as configurações salvas
ru: Вернуться к сохраненным настройкам
uk: Повернутися до збережених налаштувань

source: Reverts all changes effected since the window was last opened, and closes the window.
es: Revierte todos los cambios a los últimos desde que la ventana se abrió, luego cierra la ventana.
it: Ripristina tutti i parametri modificati e chiude la finestra.
pt_br: Reverte todas as alterações feitas desde a última vez que a janela foi aberta, e depois fecha a janela.
ru: Отменяет все изменения, затронутые с момента последнего открытия окна, и закрывает окно.
uk: Скасовує всі зміни, яких торкнулися з моменту останнього відкриття вікна, і закриває вікно.

source: Reverts all changes effected since the window was last opened.
es: Revierte todos los cambios a los últimos desde la ultima vez que se abrió la ventana.
it: Ripristina tutti i parametri modificati.
pt_br: Reverte todas as alterações feitas desde a última vez que a janela foi aberta.
ru: Отменяет все изменения, затронутые с момента последнего открытия окна.
uk: Скасовує всі зміни, яких торкнулися з моменту останнього відкриття вікна.

source: Reverts all settings to the selected settings.
es: Revierte todas las configuraciones a las seleccionadas.
it: Ripristina tutti i parametri ai valori selezionati.
pt_br: Reverte todas as configurações pelas selecionadas.
ru: Возвращает все настройки к выбранным настройкам.
uk: Повертає всі налаштування до обраних налаштувань.

source: Reverts the user-drawn ocean floor terrain to the default terrain.
es: Revierte el suelo dibujado por el usuario al suelo por defecto.
it: Ripristina il fondale oceanico al fondale di default.
pt_br: Restaura o leito oceânico ao estado original, removendo as alterações feitas.
ru: Возвращает нарисованный пользователем ландшафт дна океана к ландшафту по умолчанию.
uk: Повертає намальований користувачем ландшафт дна океану до ландшафту за замовчуванням.

source: Rewind
es: Retroceder
it: Riavvolgi
pt_br: Retroceder
ru: Перемотка
uk: Перемотка

source: Rogue Wave Rate
es: Frecuencia de la ola gigante
it: Frequenza onde anomale
pt_br: Taxa de Ondas Gigantes
ru: Скорость Разбойной Волны
uk: Швидкість розбійної хвилі

source: Ropes Layer
es: Capas de cuerda
it: Layer funi
pt_br: Camada das Cordas
ru: Слой канатов
uk: Шар канатів

source: Rot Acceler8r
es: Aceleración de Oxidacion
it: Accelerazione putrefazione
pt_br: Acelerador de Decomposição
ru: Ускоритель гниения
uk: Прискорювач гниття

source: Rotate CCW
es: Rotar AH
it: Rotazione AO
pt_br: Rotacionar no sentido anti-horário
ru: Вращать налево
uk: Обертати ліворуч

source: Rotate CW
es: Rotar H
it: Rotazione O
pt_br: Rotacionar no sentido horário
ru: Вращать вправо
uk: Обертати вправо

source: Rotate ship 90 degrees clockwise when loaded
es: Rotar el barco 90° en sentido horario al ser cargado
it: Carica la nave ruotata di 90 gradi in senso orario
pt_br: Rotacionar o navio ou objeto 90 graus no sentido horário ao ser carregado
ru: Поворот судна на 90 градусов по часовой стрелке при погрузке
uk: Поворот судна на 90 градусів за годинниковою стрілкою під час навантаження

source: Rotate the pasted region 90 degrees anti-clockwise.
es: Rotar la region pegada 90° en sentido antihorario.
it: Ruota la regione incollata di 90 gradi in senso anti-orario.
pt_br: Rotacionar a região colada 90 graus no sentido anti-horário.
ru: Поверните вставленную область на 90 градусов против часовой стрелки.
uk: Поверніть вставлену область на 90 градусів проти годинникової стрілки.

source: Rotate the pasted region 90 degrees clockwise.
es: Rotar la region 90° en sentido horario.
it: Ruota la regione incollata di 90 gradi in senso orario.
pt_br: Rotacionar a região colada 90 graus no sentido horário.
ru: Поверните вставленную область на 90 градусов по часовой стрелке.
uk: Поверніть вставлену область на 90 градусів за годинниковою стрілкою.

source: Rotate the ship 90 degrees anti-clockwise.
es: Rotar el barco 90° en sentido antihorario.
it: Ruota la nave di 90 gradi in senso anti-orario.
pt_br: Rotacionar o navio ou objeto 90 graus no sentido anti-horário.
ru: Поверните корабль на 90 градусов налево.
uk: Поверніть корабель на 90 градусів наліво.

source: Rotate the ship 90 degrees clockwise.
es: Rotar el barco 90° en sentido horario.
it: Ruota la nave di 90 gradi in senso orario.
pt_br: Rotacionar o navio ou objeto 90 graus no sentido horário.
ru: Поверните корабль на 90 градусов на право.
uk: Поверніть корабель на 90 градусів праворуч.

source: Rotting
es: Oxidacion
it: Putrefazione
pt_br: Apodrecimento
ru: Гниение
uk: Гниття

source: Rust Receptivity
es: Receptividad del oxido
it: Suscettibilità alla ruggine
pt_br: Sensibilidade à ferrugem
ru: Восприимчивость к ржавчине
uk: Сприйнятливість до іржі

source: SHIP ENGINEERING
es: INGENIEROS EN BARCOS
it: INGEGNERIA NAVALE
pt_br: ENGENHARIA DOS NAVIOS
ru: СУДОСТРОЕНИЕ
uk: СУДНОБУДУВАННЯ

source: SHIP LITERATURE
es: HISTORIAS DE BARCOS
it: LETTERATURA NAVALE
pt_br: LITERATURA DOS NAVIOS
ru: КОРАБЕЛЬНАЯ ЛИТЕРАТУРА
uk: КОРАБЕЛЬНА ЛІТЕРАТУРА

source: SI (Celsius)
ru: SI (Цельсия)
uk: SI (Цельсія)

source: SI (Kelvin)
ru: SI (Кельвин)
uk: SI (Кельвін)

source: SPECIAL THANKS
es: AGRADECIMIENTOS ESPECIALES
it: RINGRAZIAMENTI SPECIALI
pt_br: AGRADECIMENTOS ESPECIAIS
ru: ОТДЕЛЬНОЕ СПАСИБО
uk: ОКРЕМА ПОДЯКА

source: Sample the material under the cursor.
es: Muestrear el material debajo del cursor.
it: Esamina il materiale sotto il cursore.
pt_br: Amostrar o material sob o cursor.
ru: Возьмите образец материала под курсором.
uk: Візьміть зразок матеріалу під курсором.

source: Save
es: Guardar
it: Salva
pt_br: Salvar
ru: Сохранить
uk: Зберегти

source: Save And Return
es: Guardar y volver al juego
it: Salva e torna
pt_br: Salvar e Retornar
ru: Сохранить и вернуть
uk: Зберегти і повернути

source: Save Current Settings
es: Guardar configuraciones actuales
it: Salva parametri correnti
pt_br: Salvar as configurações atuais
ru: Сохранить текущие настройки
uk: Зберегти поточні налаштування

source: Save Screenshot
es: Tomar captura de pantalla
it: Salva screenshot
pt_br: Salvar Captura de Tela
ru: Сохранить снимок экрана
uk: Зберегти знімок екрана

source: Save Settings
es: Guardar configuraciones
it: Salva parametri
pt_br: Salvar Configurações
ru: Сохранить Настройки
uk: Зберегти Налаштування

source: Save Settings on Exit
es: Guardar configuraciones al salir
it: Salva parametri in uscita
pt_br: Salvar Configurações ao sair do jogo
ru: Сохранить настройки при выходе
uk: Зберегти налаштування під час виходу

source: Save Ship
es: Guardar Barco
it: Salva nave
pt_br: Salvar navio/objeto
ru: Сохранить корабль
uk: Зберегти корабель

source: Save Ship As
es: Guardar barco como
it: Salva con nome
pt_br: Salvar navio/objeto como
ru: Сохранить корабль как
uk: Зберегти корабель як

source: Save an Image
es: Guardar una Imagen
it: Salva un'immagine
pt_br: Salvar como Imagem
ru: Сохранить изображение
uk: Зберегти зображення

source: Save and Quit
es: Guardar y Salir
it: Salva ed esci
pt_br: Salvar e Sair
ru: Сохранить и выйти
uk: Зберегти і вийти

source: Save the current ship and return to the simulator.
es: Guardar el barco actual y volver al simulador.
it: Salva questa nave e torna al simulatore.
pt_br: Salvar o navio/objeto atual e retornar ao simulador.
ru: Сохранить текущий корабль и вернуться в симулятор.
uk: Зберегти поточний корабель і повернутися в симулятор.

source: Save the current ship file to a backup file.
es: Guardar el barco actual a un archivo de respaldo.
it: Salva questa nave in un file di backup.
pt_br: Salvar o arquivo do navio ou objeto atual em um arquivo de backup.
ru: Сохранить текущий файл корабля в резервный файл.
uk: Зберегти поточний файл корабля в резервний файл.

source: Save the current ship to a different file.
es: Guardar el barco actual a un archivo diferente.
it: Salva questa nave in un nuovo file.
pt_br: Salvar o navio ou objeto atual em um arquivo diferente.
ru: Сохранить текущий корабль в другой файл.
uk: Зберегти поточний корабель в інший файл.

source: Save the current ship.
es: Guardar el barco actual.
it: Salva questa nave.
pt_br: Salvar o navio/objeto atual.
ru: Сохранить текущий корабль.
uk: Зберегти поточний корабель.

source: Save the structural layer
es: Guardar la capa estructural
it: Salva il layer strutturale
pt_br: Salvar a camada estrutural
ru: Сохраните структурный слой
uk: Збережіть структурний шар

source: Save this ship
es: Guardar este Barco
it: Salva questa nave
pt_br: Salvar este navio/objeto
ru: Сохранить этот корабль
uk: Зберегти цей корабель

source: Saves the current settings using the specified name.
es: Guarda las configuraciones actuales usando el nombre especifico.
it: Salva i parametri correnti sotto il nome selezionato.
pt_br: Salva as configurações atuais usando o nome especificado.
ru: Сохраняет текущие настройки под указанным именем.
uk: Зберігає поточні налаштування під зазначеним ім'ям.

source: Scare/Allure Fishes
es: Alejar/Atraer peces
it: Impaurisci/attrai pesci
pt_br: Assustar/Atrair os Peixes
ru: Пугать/приманивать рыб
uk: Лякати/приманювати риб

source: Screenshot directory:
es: Directorio de capturas de pantalla:
it: Cartella degli screenshot:
pt_br: Diretório das Capturas de Tela:
ru: Каталог снимков экрана:
uk: Каталог знімків екрана:

source: Scrub/Rot
es: Fregar/Oxidar
it: Strofina/arrugginisci
pt_br: Limpar/Decompor
ru: Губка/Гниение
uk: Губка/Гниття

source: Scrub/Rot Tool
es: Herramienta de Fregar/Oxidar
it: Strumento strofina/arrugginisci
pt_br: Ferramenta de Limpar/Decompor
ru: Инструмент Губка / Гниение
uk: Інструмент Губка / Гниття

source: Sea
es: Mar
it: Mare
pt_br: Mar
ru: Море
uk: Море

source: Search in this folder:
es: Buscar en esta carpeta:
it: Cerca nella cartella:
pt_br: Encontrar nesta pasta:
ru: Искать в этой папке:
uk: Шукати в цій папці:

source: Secondary Material
es: Material Secundario
it: Materiale secondario
pt_br: Material Secundário
ru: Вторичный материал
uk: Вторинний матеріал

source: See Ship Through Water
es: Ver barco a través del agua
it: Mare trasparente
pt_br: Ver navio na água
ru: Увидеть корабль сквозь воду
uk: Побачити корабель крізь воду

source: See ship information
es: Ver la información del barco
it: Informazioni nave
pt_br: Ver informações do objeto/navio
ru: Смотрите информацию о судне
uk: Дивіться інформацію про судно

source: Select Next NPC
es: Seleccionar NPC siguiente
it: Seleziona prossimo NPC
pt_br: Selecionar o próximo o NPC
ru: Выбрать Следующего НИПа
uk: Виберіть наступний НПС

source: Select an area for copying and/or cutting.
es: Seleccionar un área para copiar y/o pegar.
it: Seleziona un'area da copiare e/o da tagliare.
pt_br: Selecionar uma área para copiar e/ou cortar.
ru: Выберите область для копирования и/или резки.
uk: Виберіть область для копіювання та/або різання.

source: Select directory that screenshots will be saved to:
es: Seleccionar directorio en el cual las capturas de pantalla son guardadas:
it: Seleziona cartella per screenshots:
pt_br: Selecione o diretório em que as Capturas de Tela serão salvas:
ru: Выберите каталог, в который будут сохраняться скриншоты:
uk: Виберіть каталог, у який зберігатимуться скріншоти:

source: Select this layer as the primary layer.
es: Seleccionar esta capa como la capa primaria.
it: Imposta questo layer come layer principale.
pt_br: Selecionar esta camada como uma camada primária.
ru: Выберите этот слой в качестве основного.
uk: Виберіть цей шар як основний.

source: Selects how heat is rendered on the ship.
es: Selecciona como el calor es renderizado en el barco.
it: Imposta la modalità di visualizzazione del calore sulla nave.
pt_br: Selecione como o calor é renderizado no corpo do navio.
ru: Выбирает способ отвода тепла на корабле.
uk: Обирає спосіб відведення тепла на кораблі.

source: Selects how stress is rendered on the ship.
es: Selecciona como el estrés es renderizado en el barco.
it: Imposta la modalità di visualizzazione dello stress strutturale della nave.
pt_br: Seleciona como os materiais em estresse são renderizados no navio.
ru: Выбор способа отображения напряжения на корабле.
uk: Вибір способу відображення напруги на кораблі.

source: Selects whether the game starts in full-screen mode or as a normal window.
es: Selecciona si el juego inicia en modo de ventana o en pantalla completa.
it: Seleziona se il simulatore debba partire a pieno schermo oppure come una normale finestra.
pt_br: Seleciona se o jogo sempre vai iniciar em modo Tela Cheia ou em uma janela normal.
ru: Выбирает, будет ли игра запускаться в полноэкранном режиме или в виде обычного окна.
uk: Вибирає, чи буде гра запускатися в повноекранному режимі або у вигляді звичайного вікна.

source: Self-Powered
es: Auto-Alimentado
it: Auto-alimentato
pt_br: Autoalimentado
ru: Самостоятельная работа
uk: Самостійна робота

source: Set a password to prevent unauthorized people from making changes to this ship.
es: Colocar la contraseña para prevenir a personas no autorizadas de hacer cambios en el barco.
it: Imposta una password per impedire ad altre persone di apportare modifiche a questa nave.
pt_br: Crie uma senha para prevenir que pessoas não autorizadas de criar edições neste navio/objeto.
ru: Установите пароль, чтобы предотвратить внесение изменений на этом корабле посторонними лицами.
uk: Встановіть пароль, щоб запобігти внесенню змін на цьому кораблі сторонніми особами.

source: Set a password to protect edits to this ship.
es: Colocar una contraseña para proteger ediciones a este barco.
it: Imposta una password per impedire modifiche a questa nave.
pt_br: Definir uma senha para proteger que façam edições neste navio.
ru: Установите пароль для защиты редактирования этого судна.
uk: Встановіть пароль для захисту редагування цього судна.

source: Set auto-texturization settings.
es: Establecer configuración de texturizacion automática.
it: Imposta proprietà auto-texturizzazione.
pt_br: Definir configurações de auto-texturização.
ru: Установите параметры автотекстурирования.
uk: Встановіть параметри автотекстурування.

source: Set ship-specific auto-texturization settings.
es: Establecer las configuraciones de auto texturizacion a barcos específicos.
it: Imposta proprietà auto-texturizzazione per questa nave.
pt_br: Definir configurações de auto-texturização específicas para o navio ou objeto.
ru: Установка параметров автотекстурирования для конкретного корабля.
uk: Встановлення параметрів автотекстурування для конкретного корабля.
