Repository: GabrieleGiuseppini/Floating-Sandbox
Catalog: Localization/*/ui_strings.po
Languages: es, it, pt_br, ru, uk

source: When a ship does not have a high-definition image, generates one using the materials' matte colors. Changes to this setting will only be visible after the next ship is loaded.
es: Cuando un barco no tiene una imagen de alta definición, genera una usando los colores de los materiales. Cambios a esta configuración solo serán visibles cuando un nuevo barco es cargado.
it: Genera automaticamente un'immagine ad alta definizione - per le navi che non ne possiedono una - utilizzando colori specifici ai materiali. Le modifiche a questa impostazione saranno visibili solamente dopo il caricamento di una nave.
pt_br: Quando um navio não possui uma imagem em alta definição, é gerada uma usando as cores foscas dos materiais. Alterações nesta configuração só serão visíveis após o próximo navio ser carregado.
ru: Если у корабля нет изображения высокой четкости, оно создается с использованием матовых цветов материалов. Изменения этого параметра будут видны только после загрузки следующего корабля.
uk: Якщо корабель не має зображення високої чіткості, генерує його, використовуючи матові кольори матеріалів. Зміни в цьому налаштуванні будуть видимі тільки після завантаження наступного корабля.

source: When checked, the game starts with the ship that had been loaded when the game was last played.
es: Si habilitado, el juego inicia con e barco que fue cargado la ultima vez que se jugo.
it: Abilitando questa opzione, all'avvio del simulatore verrà caricata automaticamente l'ultima nave utilizzata.
pt_br: Quando marcado, o jogo inicia com o navio que estava carregado na última vez em que o jogo foi executado.
ru: Если этот флажок установлен, игра начинается с корабля, который был загружен при последней игре.
uk: Якщо цей прапорець встановлено, гра починається з корабля, який був завантажений під час останньої гри.

source: When enabled, draw lines with pixel edges touching each other.
es: Si habilitado, dibuja las líneas con bordes de pixeles tocándose entre si.
it: Abilitando questa opzione le linee verranno tracciate con pixel adiacenti l'uno all'altro.
pt_br: Quando ativado, desenhar linhas com as bordas dos pixels tocando-se.
ru: Если включено, рисует линии с краями пикселей, касающимися друг друга.
uk: Якщо увімкнено, малює лінії з краями пікселів, що торкаються один одного.

source: When enabled, empty regions are pasted as transparent; otherwise, empty regions are pasted as opaque and will erase anything on the background.
es: Cuando este habilitado, todas las regiones vacías serán pegadas transparentemente, de lo contrario, las regiones vacías serán pegadas como opacas y eliminaran todo lo que este de fondo.
it: Abilitando questa opzione le regioni vuote verranno incollate come se fossero trasparenti; disabilitandola, invece, le regioni vuote verranno incollate come se fossero opache, e sostituiranno tutto ciò che è sottostante.
pt_br: Quando ativado, regiões vazias são coladas como transparentes; caso contrário, regiões vazias são coladas como opacas e apagarão qualquer coisa que estiver no fundo.
ru: Если эта функция включена, пустые области вставляются как прозрачные; в противном случае пустые области вставляются как непрозрачные и стирают все, что находится на фоне.
uk: Якщо цю функцію ввімкнено, порожні області вставляються як прозорі; інакше порожні області вставляються як непрозорі і стирають все, що знаходиться на тлі.

source: When enabled, textures imported into the exterior layer are slightly modified to optimize coverage by the structure layer.
it: Abilitando questa opzione un'imaggine importata nel layer esterno viene modificata lievemente per ottimizzare la sua copertura da parte del layer strutturale.
ru: Если включено, импорт текстур в наружный слой немного оптимизирован для покрытия структурного слоя.
uk: Під час стирання текстури, імпортовані у зовнішній шар, дещо змінюються для оптимізації покриття структурним шаром.

source: When enabled, the contours of erased background color regions are anti-aliased in order to minimize the appearance of jagged lines.
es: Al estar Habilitado, los contornos de las regiones de color de fondo borradas se suavizan para minimizar la aparición de líneas irregulares.
it: Abilitando questa opzione i contorni delle regioni cancellate verranno sottoposti ad anti-aliasing, minimizzando la comparsa di dentellature.
pt_br: Quando ativado, os contornos das regiões com cor de fundo apagadas recebem suavização (anti-serrilhado) para minimizar a aparência de linhas serrilhadas.
ru: Если эта функция включена, контуры областей со стертым цветом фона сглаживаются, чтобы минимизировать появление неровных линий.
uk: Якщо цю функцію ввімкнено, контури областей зі стертим кольором фону згладжуються, щоб мінімізувати появу нерівних ліній.

source: When enabled, the selection affects all layers instead of just the current layer.
es: Al estar habilitado, la selección afecta todas las capas en lugar de solo la actual.
it: Abilitando questa opzione la selezione comprenderà tutti i layer, invece del solo layer corrente.
pt_br: Quando ativado, a seleção afeta todas as camadas em vez de apenas a camada atual.
ru: Если эта функция включена, выделение затрагивает все слои, а не только текущий слой.
uk: Якщо цю функцію ввімкнено, виділення зачіпає всі шари, а не тільки поточний шар.

source: Which material to fill the rectangle with.
es: Que material usar para llenar el rectángulo.
it: Quale materiale usare per riempire il rettangolo.
pt_br: Com qual material preencher o retângulo.
ru: Каким материалом заполнить прямоугольник.
uk: Яким матеріалом заповнити прямокутник.

source: Width Adjust
es: Ajuste de el ancho
it: Larghezza
pt_br: Ajuste de Largura
ru: Регулировка ширины волн
uk: Регулювання ширини хвиль

source: Wind
es: Viento
it: Vento
pt_br: Ventania
ru: Ветер
uk: Вітер

source: Wind Speed
es: Velocidad del viento
it: Velocità vento
pt_br: Velocidades das Ventanias
ru: Скорость Ветра
uk: Швидкість вітру

source: Wind and Waves
es: Viento y olas
it: Vento e onde
pt_br: Ventanias e Ondas
ru: Ветер и волны
uk: Вітер і хвилі

source: Wind speed conjured by the WindMaker tool (Km/h).
es: Velocidad del viento generada por la herramienta de viento (Km/h).
it: Velocità del vento generato dallo strumento WindMaker (Km/h).
pt_br: Velocidade da ventania gerada pela ferramenta Invocador de Ventania (Km/h).
ru: Скорость ветра, рассчитанная инструментом Поток Воздуха (км/ч).
uk: Швидкість вітру, розрахована інструментом Потік Повітря (км/год).

source: WindMaker
es: Generador de viento
pt_br: Invocador de Ventania
ru: Поток Воздуха
uk: Потік повітря

source: WindMaker Tool
es: Herramienta generadora de Viento
it: Strumento WindMaker
pt_br: Invocador de Ventania
ru: Инструмент Поток Воздуха
uk: Інструмент Потік повітря

source: Year Built
es: Año de construccion
it: Anno costruzione
pt_br: Ano de Construção
ru: Год постройки
uk: Рік побудови

source: Year in which the ship was built, e.g. "1911"
es: Año en el cual el barco fue construido, ej. "1911"
it: L'anno in cui la nave è stata costruita; ad esempio, "1911"
pt_br: Ano em que o navio ou objeto foi construído ou criado, por exemplo ''1911''
ru: Год постройки судна, например, "1911".
uk: Рік побудови судна, наприклад, "1911".

source: Yes
es: Si
it: Si
pt_br: Sim
ru: Да
uk: Так

source: Yes, I want to use the suggested name
es: Si, quiero usar el nombre sugerido
it: Si, voglio utilizzare il nome suggerito
pt_br: Sim, quero usar o nome sugerido
ru: Да, я хочу использовать предложенное имя
uk: Так, я хочу використовувати запропоноване ім'я

source: Zero
es: Cero
ru: Ноль
uk: Нуль

source: Zoom In
es: Acercar Vista
it: Ingrandisci
pt_br: Ampliar
ru: Увеличить
uk: Збільшити

source: Zoom Increment
es: Incremento del zoom
it: Incremento di zoom
pt_br: Incremento de Zoom
ru: Увеличение масштаба
uk: Збільшення масштабу

source: Zoom Out
es: Alejar Vista
it: Rimpicciolisci
pt_br: Diminuir
ru: Уменьшить
uk: Зменшити

source: The width of the canvas.
es: El ancho del lienzo.
it: La larghezza dell'area di lavoro.
pt_br: A largura da tela.
uk: Ширина полотна.

source: (c) Gabriele Giuseppini (G2-Labs) 2018-2025
pt_br: Direitos Autorais - Gabriele Giuseppini (G2-Labs) 2018-2025

source: Copyright (c) 1998-2005 Julian Smart, Robert Roebling et al
pt_br: Direitos Autorais (c) 1998-2005 Julian Smart, Robert Roebling et al

source: Copyright (c) 2005-2011 Karl Walsh (Codehead)
pt_br: Direitos Autorais (c) 2005-2011 Karl Walsh (Codehead)

source: Copyright (c) 2009-2010 Cybozu Labs, Inc.; Copyright (c) 2011-2014 Kazuho Oku
pt_br: Direitos Autorais (c) 2009-2010 Cybozu Labs, Inc./2011-2014 Kazuho Oku

source: Copyright (c) 2011 Paul Mineiro
pt_br: Direitos Autorais (c) 2011 Paul Mineiro

source: Copyright (c) Laurent Gomila
pt_br: Direitos Autorais - Laurent Gomila

source: USCS
es: SUCS
