Repository: GabrieleGiuseppini/Floating-Sandbox
Catalog: Localization/*/ui_strings.po
Languages: es, it, pt_br, ru, uk

source: Blast Force Adjust
es: Ajuste de la fuerza de explosion
it: Potenza esplosione
pt_br: Ajustar Força de Explosão
ru: Регулировка Силы взрыва
uk: Регулювання Сили вибуху

source: Blast Heat
es: Calor de la explosion
it: Calore esplosione
pt_br: Calor da Explosão
ru: Взрывная жара
uk: Вибухова спека

source: Blast Radius
es: Radio de acción de la explosión
it: Raggio esplosione
pt_br: Raio da Explosão
ru: Радиус взрыва
uk: Радіус вибуху

source: Blast Tool
es: Herramienta de explosion
it: Strumento esplosione
pt_br: Ferramenta Explosão
ru: Взрывной инструмент
uk: Вибуховий інструмент

source: Blue Sky
es: Cielo Azul
it: Cielo blu
pt_br: Céu Azul
ru: Синее небо
uk: Синє небо

source: Bombs
es: Bombas
it: Bombe
pt_br: Bombas
ru: Бомбы
uk: Бомби

source: Boot Settings
es: Configuraciones de inicio
it: Parametri d'avvio
pt_br: Configurações de Inicialização
ru: Настройки Загрузки
uk: Налаштування Завантаження

source: Bright Ambient Light
es: Aclarar luz ambiental
it: Aumenta luminosità
pt_br: Luz ambiente intensa
ru: Осветлить Окружающий Свет
uk: Освітлити навколишнє Світло

source: Bumpiness
es: Irregularidad
it: Ondulazione
pt_br: Irregularidade
ru: Бугристость
uk: Горбкуватість

source: Buoyant Volume
es: Volumen flotante
it: Volume galleggiabilità
pt_br: Volume de flutuação
ru: Объем плавучести
uk: Обсяг плавучості

source: Burning Point Adjust
es: Ajuste del punto de ignicion
it: Punto di combustione
pt_br: Ajuste do Ponto de Combustão
ru: Точка горения
uk: Точка горіння

source: Buy Merchandise...
es: Comprar Merchandising...
it: Acquista gadget...
pt_br: Comprar produtos...
ru: Купить Мерч...
uk: Купи товари...

source: Cable
it: Cavo
pt_br: Cabo
ru: Кабель
uk: Кабель

source: Calibrating game on the computer...
es: Calibrando juego en la computadora...
it: Calibrazione del simulatore...
pt_br: Adaptando o jogo no computador...
ru: Калибровка игры под ваш компьютер...
uk: Калібрування гри під ваш комп'ютер...

source: Camera Speed
es: Velocidad de la camara
it: Velocità telecamera
pt_br: Velocidade da Câmera
ru: Скорость камеры
uk: Швидкість камери

source: Cancel
es: Cancelar
it: Annulla
pt_br: Cancelar
ru: Отмена
uk: Скасування

source: Cannot Check for Updates at This Moment
es: No se pueden buscar actualizaciones en este momento
it: Impossibile verificare la disponibilità di aggiornamenti
pt_br: Não é possível verificar se há atualizações neste momento
ru: Не удается проверить наличие обновлений в данный момент
uk: Не вдається перевірити наявність оновлень у цей момент

source: Canvas Background Color:
es: Color de fondo del lienzo:
it: Colore sfondo:
pt_br: Cor de fundo da tela:
ru: Цвет фона холста:
uk: Колір фону полотна:

source: Category
it: Classificazione
pt_br: Categorias
ru: Категория
uk: Категорія

source: Category of the ship
it: Classificazione della nave
pt_br: Categorias do objeto
ru: Категория корабля
uk: Категорія судна

source: Center Texture
es: Centrar Textura
it: Centra texture
pt_br: Textura Central
ru: Текстура центра
uk: Текстура центру

source: Change direction of ships' order
es: Cambiar el orden de dirección de los barcos
it: Cambia la direzione dell'ordine di visualizzazione delle navi
pt_br: Alterar a direção da ordem dos objetos
ru: Изменение направления следования судов
uk: Зміна напрямку слідування суден

source: Change general ShipBuilder settings.
es: Cambiar configuraciones generales del Constructor de Barcos.
it: Modifica le impostazioni dello ShipBuilder.
pt_br: Alterar as configurações gerais do Construtor de Navios/Objetos.
ru: Изменить общие настройки ShipBuilder.
uk: Змінити загальні налаштування ShipBuilder.

source: Change order of ships
es: Cambiar orden de los barcos
it: Cambia l'ordine di visualizzazione delle navi
pt_br: Alterar a ordem dos objetos
ru: Изменение порядка следования судов
uk: Зміна порядку проходження суден

source: Changes the amount by which the camera position changes when using the pan controls.
es: Cambia la cantidad en que cambia la posición de la cámara cuando se utilizan los controles panorámicos.
it: Regola di quanto cambia la posizione della camera quando si usano i controlli per la panoramica.
pt_br: Altera a quantidade de deslocamento da câmera ao usar os controles de panorâmica.
ru: Изменяет величину изменения положения камеры при использовании элементов управления панорамированием.
uk: Змінює величину зміни положення камери під час використання елементів керування панорамуванням.

source: Changes the amount by which zoom changes when using the zoom controls.
es: Cambia la cantidad en la cual el zoom cambia usando los controles del zoom.
it: Regola di quanto cambia lo zoom quando si usano i controlli per lo zoom.
pt_br: Altera a quantidade de mudança do zoom ao usar os controles de zoom.
ru: Изменяет величину изменения масштаба при использовании элементов управления масштабированием.
uk: Змінює величину зміни масштабу під час використання елементів керування масштабуванням.

source: Changes the level of detail of materials' textures.
es: Cambia el nivel de detalle de las texturas de los materiales.
it: Regola il livello di dettaglio delle texture dei materiali.
pt_br: Alterar o nível de detalhe das texturas dos materiais.
ru: Изменяет уровень детализации текстур материалов.
uk: Змінює рівень деталізації текстур матеріалів.

source: Changes the level of detail of materials' textures. Changes to this setting will only be visible after the next ship is loaded.
es: Cambia el nivel de detalle de las texturas de los materiales. Cambios a esta configuración son solo visibles cuando un nuevo barco es cargado.
it: Regola il livello di dettaglio delle texture dei materiali. Le modifiche a questa impostazione saranno visibili solo dopo il caricamento di una nave.
pt_br: Controla o nível de detalhamento das texturas dos materiais. As mudanças só entram em efeito ao carregar o próximo navio.
ru: Изменяет уровень детализации текстур материалов. Изменения этого параметра будут видны только после загрузки следующего корабля.
uk: Змінює рівень деталізації текстур матеріалів. Зміни цього параметра буде видно тільки після завантаження наступного корабля.

source: Changes the maximum number of NPCs. Warning: higher values require more computing resources, with the risk of slowing the simulation down! Changes to this setting will only be visible after the next ship is loaded.
es: Cambia el numero máximo de NPCs. Advertencia: Valores elevados requieren mas recursos, con el riesgo de enlentecer la simulación! Cambios a esta configuración son solo visibles cuando un nuevo barco es cargado.
it: Regola il limite massimo sul numero di NPC. Attenzione: valori elevati richiedono l'uso di maggiori risorse di calcolo, con il rischio di rallentare la simulazione! Le modifiche a questa impostazione saranno visibili solo dopo il caricamento di una nave.
pt_br: Controla o número máximo de NPCs no jogo. Valores elevados podem sobrecarregar o sistema e reduzir o desempenho da simulação. Mudanças entram em efeito somente após carregar o próximo navio.
ru: Изменяет максимальное число НИПов. Внимание: более высокие значения потребуют больше вычислительный процессов, с риском замедления симуляции! Изменения этого параметра будут видны только после загрузки следующего корабля.
uk: Змінює максимальну кількість НПС. Попередження: вищі значення потребують більше обчислювальних ресурсів, що може сповільнити симуляцію! Зміни цього параметра будуть помітні лише після завантаження наступного корабля.

source: Changes the number of NPCs spawned when a group is added.
es: Cambia el numero de NPCs generados cuando un grupo es añadido.
it: Regola la quantità di NPC generati quando si aggiunge un gruppo.
pt_br: Altera o número de NPCs gerados quando um grupo é adicionado.
ru: Изменяет число НИПов при добавлении группы.
uk: Змінює кількість НПС, що з'являються під час додавання групи.

source: Changes the transparency of materials' textures.
es: Ajusta la transparencia de las texturas de los materiales.
it: Regola la trasparenza delle texture dei materiali.
pt_br: Altera o nível de transparência dos materiais.
ru: Изменяет прозрачность текстур материалов.
uk: Змінює прозорість текстур матеріалів.

source: Changes the transparency of materials' textures. Changes to this setting will only be visible after the next ship is loaded.
es: Cambia la transparencia de las texturas de los materiales. Cambios a esta configuración son solo visibles cuando un nuevo barco es cargado.
it: Regola la trasparenza delle texture dei materiali. Le modifiche a questa impostazione saranno visibili solo dopo il caricamento di una nave.
pt_br: Controla o nível de transparência das texturas dos materiais. Mudanças só entram em efeito ao carregar o próximo navio.
ru: Изменяет прозрачность текстур материалов. Изменения этого параметра будут видны только после загрузки следующего корабля.
uk: Змінює прозорість текстур матеріалів. Зміни цього параметра буде видно тільки після завантаження наступного корабля.

source: Check for Updates on Startup
es: Buscar actualizaciones al iniciar
it: Controlla aggiornamenti all'avvio
pt_br: Verificar se há atualizações ao iniciar
ru: Проверка Наличия Обновлений при Запуске
uk: Перевірка наявності оновлень під час запуску

source: Check for Updates...
es: Buscar actualizaciones...
it: Controlla disponibilità aggiornamenti...
pt_br: Verificar Atualizações...
ru: Проверить Наличие Обновлений...
uk: Перевірити Наявність Оновлень...

source: Check the ship for issues.
es: Revisando el barco por problemas.
it: Analizza la nave.
pt_br: Verificar se há problemas no objeto.
ru: Проверьте корабль на наличие проблем.
uk: Перевірте корабель на наявність проблем.

source: Checking for Updates...
es: Buscando Actualizaciones...
it: Ricerca aggiornamenti...
pt_br: Verificando por Atualizações...
ru: Проверка наличия Обновлений...
uk: Перевірка наявності Оновлень...

source: Checking for updates...
es: Buscando actualizaciones...
it: Verifica disponibilità aggiornamenti in corso...
pt_br: Verificando por atualizações...
ru: Проверка наличия обновлений...
uk: Перевірка наявності оновлень...

source: Checking ship...
es: Revisando el barco...
it: Analisi nave...
pt_br: Verificando Objeto...
ru: Проверяем корабль...
uk: Перевіряємо корабель...

source: Clear the password to allow everyone to make changes to this ship.
es: Quitar la contraseña para permitir a todos hacer cambios en el barco.
it: Rimuovi la password per consentire a chiunque di modificare la nave.
pt_br: Excluir a senha para permitir que todos façam alterações neste objeto.
ru: Снимите пароль, чтобы разрешить всем желающим вносить изменения на этом корабле.
uk: Зніміть пароль, щоб дозволити всім охочим вносити зміни на цьому кораблі.

source: Closes the window keeping all changes.
es: Cierra la ventana manteniendo los cambios.
it: Chiude la finestra mantenendo i nuovi parametri.
pt_br: Fecha a janela mantendo todas as alterações.
ru: Закрывает окно, сохраняя все изменения.
uk: Закриває вікно, зберігаючи всі зміни.

source: Combustion
es: Combustión
it: Combustione
pt_br: Combustão
ru: Горение
uk: Згорання

source: Combustion Heat Adjust
es: Ajuste de el calor para la combustión
it: Calore combustione
pt_br: Ajuste do Calor de Combustão
ru: Температура горения
uk: Температура горіння

source: Combustion Speed Adjust
es: Ajuste de la velocidad de la combustión
it: Velocità di combustione
pt_br: Ajuste da Velocidade de Combustão
ru: Скорость горения
uk: Швидкість горіння

source: Combustion Type
es: Tipo de Combustión
it: Modalità combustione
pt_br: Tipo de Combustão
ru: Вид горения
uk: Вид горіння

source: Commit
es: Actuar
it: Conferma
pt_br: Confirmar
ru: Выполнить
uk: Виконати

source: Commit the paste operation.
es: Cometer la accion de pegar.
it: Conferma l'operazione di incollaggio.
pt_br: Confirmar a operação de colar.
ru: Выполните операцию вставки.
uk: Виконати операцію вставки.

source: Conductive
es: Conductivo
it: Conduttivo
pt_br: Condutivo
ru: Проводящий
uk: Провідний

source: Confirm password:
es: Confirmar contraseña:
it: Conferma password:
pt_br: Confirmar senha:
ru: Подтвердите пароль:
uk: Підтвердіть пароль:

source: Congratulations! The ship has no issues and it may be saved.
es: Felicidades! El barco no tiene problemas y será guardado.
it: Congratulazioni! La nave non presenta problemi e può quindi essere salvata.
pt_br: Parabéns! Este objeto não apresenta nenhum problema e pode ser salvo com êxito.
ru: Поздравляем! Корабль не имеет проблем и может быть сохранен.
uk: Вітаємо! Корабель не має проблем і може бути збережений.

source: Contiguous Only:
es: Solo contiguo:
it: Solo confinante:
pt_br: Apenas sequências:
ru: Только смежные:
uk: Тільки суміжні:

source: Continuous Auto-Focus
es: Auto-Enfocado Continuo
it: Auto-Focus continuo
pt_br: Foco-automático contínuo
ru: Непрерывная автофокусировка
uk: Безперервне автофокусування

source: Continuous Auto-Focus on NPC
es: Auto-Enfocado Continuo en NPC
it: Auto-Focus continuo su NPC
pt_br: Foco-automático contínuo no NPC
ru: Непрерывная автофокусировка на НИПов
uk: Безперервний автофокус на НПС

source: Continuous Auto-Focus on Ship
es: Auto-Enfocado Continuo en Barcos
it: Auto-Focus continuo sulla nave
pt_br: Foco-automático contínuo no objeto/navio
ru: Непрерывная автофокусировка на Корабле
uk: Безперервний автофокус на судні

source: Contrast
es: Contraste
it: Contrasto
pt_br: Contraste
ru: Контраст
uk: Контраст

source: Controls the sensitivity of the ship to ambient light; lower values allow the ship to be visible also at night.
es: Controla la sensibilidad del barco ante la luz del ambiente; Valores inferiores permiten al barco ser visible en la noche.
it: Regola la sensibilità della nave alla luminosità ambientale; valori bassi permettono alla nave di essere visible anche di notte.
pt_br: Controla a sensibilidade do navio à luz ambiente; valores mais baixos permitem que o navio permaneça visível mesmo à noite.
ru: Управляет чувствительностью корабля к окружающему свету; более низкие значения позволяют видеть корабль даже ночью.
uk: Керує чутливістю корабля до навколишнього світла; нижчі значення дають змогу бачити корабель навіть уночі.

source: Controls the sensitivity of the ship to depth darkening; lower values allow the ship to be visible also at depth.
es: Controla la sensibilidad del oscurecimiento del barco por profundidad; Valores inferiores permiten al barco ser visible en las profundidades.
it: Regola la sensibilità della nave al gradiente di profondità; valori bassi permettono alla nave di essere visible anche negli abissi.
pt_br: Controla a sensibilidade do navio ao escurecimento com a profundidade; valores mais baixos permitem que o navio permaneça visível mesmo em grandes profundidades.
ru: Управляет чувствительностью корабля к затемлению глубины; более низкие значения позволяют видеть корабль даже под дном.
uk: Контролює чутливість корабля до глибинного затемнення; нижчі значення дозволяють судну бути видимим також на глибині.

source: Copy
es: Copiar
it: Copia
pt_br: Copiar
ru: Копировать
uk: Копіювати

source: Copy the current selection to the clipboard (Ctrl+C).
es: Copiar la actual selección al portapapeles (Ctrl+C).
it: Copia la selezione nella clipboard (Ctrl+C).
pt_br: Copiar selecionando para a área de transferência (CRTL+C).
ru: Копирование текущего выделения в буфер обмена (Ctrl+C).
uk: Копіювання поточного виділення в буфер обміну (Ctrl+C).

source: Create New Ship...
es: Crear un barco nuevo...
it: Crea nuova nave...
pt_br: Criar novo navio/objeto...
ru: Создать новый корабль...
uk: Створити новий корабель...

source: Create a new empty ship (Ctrl+N).
es: Crear un nuevo barco vacío (Ctrl+N).
it: Crea una nuova nave (Ctrl+N).
pt_br: Criar um novo navio/objeto do zero (CRTL+N).
ru: Создайте новый пустой корабль (Ctrl+N).
uk: Створіть новий порожній корабель (Ctrl+N).

source: Crepuscular
it: Crepuscolare
ru: Сумеречный
uk: Сутінковий

source: Cut
es: Cortar
it: Taglia
pt_br: Cortar
ru: Вырезать
uk: Вирізати

source: Darkening Rate
es: Velocidad de oscurecimiento
it: Gradiente oscuramento
pt_br: Taxa de Escurecimento
ru: Коэффициент затемнения дна
uk: Коефіцієнт затемнення дна

source: Daylight Cycle Duration
es: Duración del ciclo Dia-Noche
it: Durata ciclo giornaliero
pt_br: Tempo de duração do ciclo dia-noite
ru: Продолжительность дневного цикла
uk: Тривалість денного циклу

source: Debug
es: Depurar
ru: Откладка
uk: Відкладка

source: Default
es: Defecto
it: Predefinito
pt_br: Padrão
ru: По умолчанию
uk: За замовчуванням

source: Default Language (from system)
es: Lenguaje por defecto (Del sistema)
it: Lingua del sistema
pt_br: Linguagem padrão (do sistema)
ru: Язык по Умолчанию (системный)
uk: Мова за замовчуванням (системна)

source: Delete Saved Settings
es: Eliminar configuraciones guardadas
it: Elimina parametri salvati
pt_br: Deletar Configurações Salvas
ru: Удалить Сохраненные Настройки
uk: Видалити Збережені налаштування

source: Deletes the selected settings.
es: Elimina todas las configuraciones seleccionadas.
it: Elimina i parametri selezionati.
pt_br: Deletar as configurações selecionadas.
ru: Удаляет выбранные настройки.
uk: Видаляє вибрані налаштування.

source: Density
it: Densità
pt_br: Densidade
ru: Плотность
uk: Щільність

source: Density Adjust
es: Ajuste de la densidad
it: Densità
pt_br: Ajustar Densidade
ru: Регулировка плотности
uk: Регулювання щільності

source: Depth
es: Profundidad
it: Profondità
pt_br: Profundidade
ru: Глубина
uk: Глибина

source: Depth Darkening
es: Oscurecimiento por profundidad
it: Gradiente di profondità
pt_br: Escurecimento por Profundidade
ru: Коэффициент затемнения дна
uk: Глибина затемнення

source: Depth Gradient
es: Gradiente de Profundidad
it: Gradiente profondità
pt_br: Gradiente de Profundidade
ru: Градиент Глубины
uk: Градієнт Глибини

source: Description
es: Descripción
it: Descrizione
pt_br: Descrição
ru: Описание
uk: Опис

source: Description of the ship, as long or short as you want, or empty to leave the ship without a description
es: Descripción de el barco, tan larga o corta como quieras, o vacía si quieres dejar al barco sin descripción
it: Una breve o estesa descrizione della nave; lasciare vuoto per non associare alcuna descrizione
pt_br: A descrição do navio/objeto, pode ser grande ou longa, ou vazia para deixar o navio/objeto sem uma descrição
ru: Описание корабля, длинное или короткое, по вашему желанию, или пустое, чтобы оставить корабль без описания
uk: Опис корабля, довгий або короткий, за вашим бажанням, або порожній, щоб залишити корабель без опису

source: Description:
es: Descripción:
it: Descrizione:
pt_br: Descrição:
ru: Описание:
uk: Опис:

source: Deselect
es: Deseleccionar
it: De-seleziona
pt_br: Desmarcar
ru: Снять выделение
uk: Зняти виділення

source: Deselect NPC
es: Deseleccionar NPC
it: De-seleziona NPC
pt_br: Desmarcar NPC
ru: Отменить Выбор НИПа
uk: Скасувати вибір НПС

source: Destroy
es: Destruir
it: Distruzione
pt_br: Destruir
ru: Уничтожить
uk: Знищити

source: Destroy Radius
es: Radio de destruccion
it: Raggio distruzione
pt_br: Raio de Destruição
ru: Радиус Уничтожения
uk: Радіус Знищення

source: Destroy!
es: Destruir!
it: Distruggi!
pt_br: Destruir!
ru: Уничтожить!
uk: Знищити!

source: Destructive Tools
es: Herramientas Destructivas
it: Strumenti di distruzione
pt_br: Ferramentas de Destruição
ru: Разрушительные инструменты
uk: Руйнівні інструменти

source: Detail
es: Detalle
it: Dettaglio
pt_br: Detalhe
ru: Детали
uk: Деталі

source: Detonate Anti-Matter Bombs
es: Detonar bombas Anti-Materia
it: Innesca bombe anti-materia
pt_br: Detonar todas as Bombas Anti-Matéria
ru: Взорвать Анти-Материальные Бомбы
uk: Підірвати Анти-Матеріальні Бомби

source: Detonate RC Bombs
es: Detonar bombas a Control Remoto
it: Innesca bombe telecomandate
pt_br: Detonar todas as Bombas RC
ru: Взорвать Радиоуправляемые Бомбы
uk: Підірвати радіокеровані бомби

source: Diesel
ru: Дизель
uk: Дизель

source: Diffusion Speed
es: Velocidad de difusión
it: Velocità di diffusione
pt_br: Velocidade de Difusão
ru: Скорость диффузии
uk: Швидкість дифузії

source: Dim Ambient Light
es: Oscurecer luz ambiental
it: Diminuisci luminosità
pt_br: Luz ambiente fraca
ru: Затемнить Окружающий Свет
uk: Затемнити навколишнє Світло

source: Direction (rad)
es: Dirección (Rad)
it: Direzione (rad)
pt_br: Direção (radianos)
ru: Направление (рад)
uk: Напрямок (рад)

source: Disable continuous auto-focus.
es: Deshabilita el auto-enfocado continuo.
it: Abilita o disabilita l'auto-focus continuo.
pt_br: Desabilitar o foco contínuo-automático.
ru: Отключение непрерывной автофокусировки.
uk: Вимкніть безперервний автофокус.

source: Discard the current ship and return to the simulator.
es: Descartar el barco actual y volver al simulador.
it: Abbandona le modifiche a questa nave e torna al simulatore.
pt_br: Descartar o objeto/navio atual e retornar ao simulador.
ru: Выбросить текущий корабль и вернуться в симулятор.
uk: Викинути поточний корабель і повернутися в симулятор.

source: Displace Water
es: Desplazar agua
it: Genera onde
pt_br: Deslocar Água
ru: Вытеснение воды
uk: Витіснення води

source: Displacement Waves
es: Desplazamiento de las olas
it: Onde da spostamento
pt_br: Ondas geradas pelo deslocamento de água
ru: Смещение волн
uk: Зміщення хвиль

source: Do you also want to rename the ship file to "%s"?
es: ¿Estas seguro de que quieres renombrar el archivo de barco %s?
it: Volete anche cambiare il nome del file della nave con "%s"?
pt_br: Você também quer renomear o arquivo do objeto/navio para "%s"?
ru: Вы также хотите переименовать файл корабля в "%s"?
uk: Ви також хочете перейменувати файл корабля на "%s"?

source: Do you want to save your changes before continuing?
es: ¿Quieres guardar los cambios antes de continuar?
it: Volete salvare i cambiamenti in sospeso prima di continuare?
pt_br: Você deseja salvar sua alterações antes de continuar?
ru: Хотите ли вы сохранить изменения перед продолжением?
uk: Чи хочете ви зберегти зміни перед продовженням?

source: Don't check for updates at startup
es: No buscar actualizaciones al iniciar
it: Non controllare nuovi aggiornamenti all'avvio
pt_br: Não checar por atualizações ao iniciar
ru: Не проверять наличие обновлений при запуске
uk: Не перевіряти наявність оновлень під час запуску

source: Don't notify about this version again
es: No notificar sobre esta versión de nuevo
it: Ignora questa versione nel futuro
pt_br: Não me notificar sobre essa versão novamente
ru: Больше не напоминать об этой версии
uk: Більше не нагадувати про цю версію

source: Don't show descriptions when ships are loaded
es: No mostrar descripciones cuando los barcos son cargados
it: Non mostrare più descrizioni quando le navi vengono caricate
pt_br: Não me mostrar as descrições dos objetos quando selecionados
ru: Не показывать описания при загрузке кораблей
uk: Не показувати описи під час завантаження кораблів

source: Don't show this tip again
es: No mostrar este consejo de nuevo
it: Non mostrare più questo suggerimento
pt_br: Não mostrar esse guia novamente
ru: Не показывать этот совет снова
uk: Не показувати цю пораду знову

source: Donate...
es: Donar...
it: Dona...
pt_br: Nos compre um café...
ru: Пожертвование...
uk: Пожертва...

source: Done
es: Hecho
it: Fatto
pt_br: Pronto!
ru: Готово
uk: Готово

source: Draw Decay
es: Dibujar Decaimiento
it: Visualizza il livello di putrefazione
pt_br: Renderizar Decaimento
ru: Показывать Распад
uk: Показувати Розпад

source: Draw Explosions
es: Dibujar explosiones
it: Visualizza esplosioni
pt_br: Renderizar Explosões
ru: Отрисовка взрывов
uk: Відмальовування вибухів

source: Draw Flames
es: Dibujar Llamas
it: Visualizza fiamme
pt_br: Renderizar Chamas
ru: Показывать Огонь
uk: Показувати Вогонь
