Repository: GabrieleGiuseppini/Floating-Sandbox
Catalog: Localization/*/ui_strings.po
Languages: es, it, pt_br, ru, uk

source: Draw HeatBlaster Flame
es: Dibujar Llama del Lanzallamas
it: Visualizza la fiamma dell'HeatBlaster
pt_br: Renderizar Disparador de Calor
ru: Показывать Огонь от Огнемета
uk: Показувати Вогонь від Вогнемета

source: Draw Internal Pressure
es: Dibujar Presión interna
it: Visualizza pressione interna
pt_br: Renderizar Pressão Interna
ru: Показывать внутреннее давление
uk: Показувати внутрішній тиск

source: Draw Mode
es: Modo de Dibujo
it: Visualizzazione
pt_br: Modo de Renderização
ru: Режим Прорисовки
uk: Режим Промальовування

source: Draw Only Edge Springs
es: Dibujar solo los resortes del borde
it: Visualizza solamente molle esterne
pt_br: Renderizar apenas as conexões de borda
ru: Показывать Только Края
uk: Показувати тільки краї

source: Draw Only Points
es: Dibujar solo puntos
it: Visualizza solamente particelle
pt_br: Renderizar apenas pontos
ru: Показывать Только Точки
uk: Показувати тільки крапки

source: Draw Only Springs
es: Dibujar solo resortes
it: Visualizza solamente molle
pt_br: Renderizar apenas as conexões elásticas
ru: Показывать Только Пружины
uk: Показувати Тільки Пружини

source: Draw Strength
es: Dibujar Fuerza
it: Visualizza resistenza
pt_br: Força de Renderização
ru: Показывать Прочность
uk: Показувати Міцність

source: Draw Structure
es: Dibujar estructura
it: Mostra struttura
pt_br: Renderizar Extrutura
ru: Показывать Структуру
uk: Показувати Структуру

source: Draw a rope between two endpoints.
es: Dibujar una cuerda entre dos puntos.
it: Traccia una fune tra due estremità.
pt_br: Renderizar uma corda conectando dois pontos.
ru: Нарисуйте веревку между двумя конечными точками.
uk: Намалюйте мотузку між двома кінцевими точками.

source: Draw electrical elements in lines.
es: Dibujar elementos eléctricos en líneas.
it: Colloca elementi elettrici lungo linee.
pt_br: Renderizar elementos elétricos no formato de linhas.
ru: Нарисуйте электрические элементы в виде линий.
uk: Намалюйте електричні елементи у вигляді ліній.

source: Draw in Wireframe Mode
es: Dibujar en modo estructura metalica
it: Disegna wireframe
pt_br: Renderizar em modo estrutura de arame
ru: Показывать в Каркасном Режиме
uk: Показувати в Каркасному Режимі

source: Draw individual electrical elements.
es: Dibujar individualmente los elementos eléctricos.
it: Colloca elementi elettrici.
pt_br: Renderizar cada elemento elétrico separadamente.
ru: Нарисуйте отдельные электрические элементы.
uk: Намалюйте окремі електричні елементи.

source: Draw individual structure particles.
es: Dibujar individualmente las partículas estructurales.
it: Colloca particelle strutturali.
pt_br: Renderizar cada partícula estrutural separadamente.
ru: Нарисуйте отдельные частицы структуры.
uk: Намалюйте окремі частинки структури.

source: Draw particles in lines.
es: Dibujar las partículas en líneas.
it: Colloca particelle lungo linee.
pt_br: Renderizar partículas como traçados lineares.
ru: Рисуйте частицы линиями.
uk: Малюйте частинки лініями.

source: Draw rectangles of particles.
es: Dibujar cuadrados de partículas.
it: Colloca particelle lungo rettangoli.
pt_br: Renderizar partículas dispostas em formato retangular.
ru: Нарисуйте прямоугольники из частиц.
uk: Намалюйте прямокутники з частинок.

source: Draws NPCs as stick-men, color-coded according to their roles.
es: Dibuja los NPCs como hombres de palo, cuyo color cambia con su rol.
it: Disegna gli NPC come fantocci, colorati a seconda del loro ruolo.
pt_br: Renderiza NPCs em forma de bonecos-palito, aplicando codificação por cores conforme o papel de cada um.
ru: Изображает НИПов стикманами, отображенными цветами их роли.
uk: Малює НПС як паличок, позначених кольорами відповідно до їхніх ролей.

source: Draws NPCs as uniformly-colored stick-men, with no distinctions among roles.
es: Dibuja los NPCs como hombres de palo uniformes, cuyo color no cambia con su rol.
it: Disegna gli NPC come fantocci, senza distinzioni tra ruoli.
pt_br: Renderiza NPCs em forma de bonecos-palito com coloração uniforme, sem diferenciação de papéis.
ru: Изображает НИПов одинаковыми, без различии цвета их роли.
uk: Малює НПС як одноколірних паличок без відмінностей між ролями.

source: Draws NPCs with skins.
es: Dibuja los NPCs con texturas.
it: Disegna gli NPC con le loro skins.
pt_br: Renderiza NPCs utilizando suas texturas ou aparências completas.
ru: Изображает НИПов скинами.
uk: Малює НПС зі скінами.

source: Draws the ocean floor using a static color.
es: Dibujar el fondo oceánico usando un color estatico.
it: Disegna il fondale oceanico a tinta unita.
pt_br: Renderiza o leito oceânico utilizando uma cor estática.
ru: Изображает дно океана однотонным цветом.
uk: Зображує дно океану однотонним кольором.

source: Draws the ocean floor using a static image.
es: Dibujar el fondo oceánico usando una imagen estática.
it: Disegna il fondale oceanico con una texture.
pt_br: Renderiza o leito oceânico utilizando uma textura/imagem estática.
ru: Изображает дно океана, используя статический узор.
uk: Зображує дно океану, використовуючи статичний візерунок.

source: Draws the ocean using a single color.
es: Dibujar el fondo oceánico usando un solo color.
it: Disegna l'oceano a tinta unita.
pt_br: Renderiza o oceano com uma cor uniforme.
ru: Изображает океан однотонным цветом.
uk: Зображує океан однотонним кольором.

source: Draws the ocean using a static pattern.
es: Dibujar el fondo oceánico usando un patrón estático.
it: Disegna l'oceano con una texture.
pt_br: Renderiza o oceano aplicando um padrão visual estático.
ru: Изображает океан, используя статический узор.
uk: Зображує океан, використовуючи статичний візерунок.

source: Draws the ocean using a vertical color gradient.
es: Dibujar el fondo oceánico usando un gradiente de color vertical.
it: Disegna l'oceano con un gradiente verticale.
pt_br: Renderiza o oceano aplicando um gradiente vertical de cores.
ru: Изображать океан с помощью вертикального цветового градиента.
uk: Зображати океан за допомогою вертикального колірного градієнта.

source: Draws the sky using a crepuscolar gradient.
es: Dibujar el cielo usando un gradiente crepuscular.
it: Disegna il cielo usando un gradiente crepuscolare.
pt_br: Renderiza o céu aplicando um gradiente de cores crepuscular.
ru: Рисует небо с помощью сумеречного градиента.
uk: Зображує небо за допомогою сутінкового градієнта.

source: Draws the sky using a static color.
es: Dibujar el cielo usando un color estático.
it: Disegna il cielo a tina unita.
pt_br: Renderiza o céu usando uma cor estática.
ru: Рисует небо, используя статичный цвет.
uk: Зображує небо, використовуючи статичний колір.

source: Duration
es: Duración
it: Durata
pt_br: Duração
ru: Продолжительность
uk: Тривалість

source: Dynamic Forces
es: Fuerzas Dinámicas
it: Forze dinamiche
pt_br: Forças Dinâmicas
ru: Динамические силы
uk: Динамічні сили

source: Edit
es: Editar
it: Modifica
pt_br: Editar
ru: Редактировать
uk: Редагувати

source: Edit Panel
es: Editar Panel
it: Modifica pannello
pt_br: Editar Painel
ru: Панель редактирования
uk: Панель редагування

source: Edit This Ship...
es: Editar el Barco...
it: Modifica questa nave...
pt_br: Editar esse navio/objeto...
ru: Редактировать этот корабль...
uk: Редагувати цей корабель...

source: Edit the electrical panel that is visualized in the game when this ship is loaded.
es: Editar el panel eléctrico que es visualizado en el juego cuando este barco es cargado.
it: Modifica il pannello elettrico che viene visualizzato nel simulatore.
pt_br: Editar o painel elétrico que é mostrado assim que o objeto/navio é carregado.
ru: Отредактируйте электрическую панель, которая отображается в игре при загрузке этого корабля.
uk: Відредагуйте електричну панель, яка відображається в грі під час завантаження цього корабля.

source: Edit the ship properties.
es: Editar las propiedades del barco.
it: Modifica le proprietà della nave.
pt_br: Editar as propriedades deste navio/objeto.
ru: Редактирование свойств корабля.
uk: Редагування властивостей корабля.

source: Effects Volume
es: Volumen de los efectos
it: Volume effetti sonori
pt_br: Volume dos Efeitos Sonoros
ru: Громкость эффектов
uk: Гучність ефектів

source: Elasticity
es: Elasticidad
it: Elasticità
pt_br: Elasticidade
ru: Эластичность
uk: Еластичність

source: Elasticity Adjust
es: Ajuste de Elasticidad
it: Elasticità
pt_br: Ajuste de Elasticidade
ru: Регулировка эластичности
uk: Регулювання еластичності

source: Electric Spark
es: Descarga Eléctrica
it: Arco elettrico
pt_br: Arco Elétrico
ru: Электрическая искра
uk: Електрична іскра

source: Electrical Layer
es: Capa eléctrica
it: Layer elettrico
pt_br: Camada Elétrica
ru: Слой Электрики
uk: Шар Електрики

source: Electrical Panel
es: Panel eléctrico
it: Pannello elettrico
pt_br: Painel Elétrico
ru: Электрическая панель
uk: Електрична панель

source: Electrical Panel Edit
es: Editar panel eléctrico
it: Modifica pannello elettrico
pt_br: Edição de Painel Elétrico
ru: Редактирование электрической панели
uk: Редагування електричної панелі

source: Electricals
es: Electrica
it: Elettrotecnica
pt_br: Elementos Elétricos
ru: Электрика
uk: Електрика

source: Emission Rate
es: Frecuencia de emision
it: Densità di emissione
pt_br: Taxa de Emissão
ru: Коэффициент выбросов
uk: Коефіцієнт викидів

source: Enable Shoaling
es: Habilitar Cardumenes
it: Abilita Branco
pt_br: Ativar formação de cardumes
ru: Включить обмеление
uk: Увімкнути обміління

source: Enable continuous auto-focus on selected NPCs.
es: Habilita o Deshabilita el auto-enfocado continuo en NPCs seleccionados.
it: Abilita o disabilita l'auto-focus continuo sugli NPC selezionati.
pt_br: Ativar foco automático contínuo nos NPC's selecionados.
ru: Включение непрерывной автофокусировки на выбранных НИПов.
uk: Увімкніть постійний автофокус на вибраних НПС.

source: Enable continuous auto-focus on ships.
es: Habilita el auto-enfocado continuo en barcos.
it: Abilita o disabilita l'auto-focus continuo sulle navi.
pt_br: Ativar foco automático contínuo nos navios/objetos.
ru: Включение непрерывной автофокусировки на кораблях.
uk: Увімкніть постійний автофокус на кораблях.

source: Enable or disable auto-focus when a ship is loaded.
es: Habilitar o Deshabilitar el auto-enfocado cuando un barco es cargado.
it: Abilita o disabilita l'auto-focus quando una nave viene caricata.
pt_br: Ativar ou desativar o foco automático quando um objeto/navio é carregado.
ru: Включить или отключить автофокусировку при загрузке корабля.
uk: Увімкнути або вимкнути автофокусування під час завантаження корабля.

source: Enable/disable the visual guides.
es: Habilitar/Deshabilitar las guías visuales.
it: Abilita o disabilita le guide visive.
pt_br: Ativar/desativar os guias visuais.
ru: Включите/выключите визуальные подсказки.
uk: Увімкніть/вимкніть візуальні підказки.

source: Enable/disable visualization of the ship's center of mass.
es: Habilita o Deshabilita la visualización del centro de masa del barco.
it: Abilita o disabilita la visualizzazione del centro di massa della nave.
pt_br: Ativar/desativar a visualização do centro de massa do navio.
ru: Включить/выключить визуализацию центра масс корабля.
uk: Увімкнути/вимкнути візуалізацію центру мас корабля.

source: Enables or disables amplification of tool forces and inflicted damages.
es: Habilita o Deshabilita la herramienta de amplificación de fuerzas y daños infligidos.
it: Abilita o disabilita amplificazione di strumenti e danni.
pt_br: Habilita ou desabilita o aumento da intensidade das forças aplicadas pelas ferramentas e dos danos resultantes.
ru: Включает или отключает усиление инструментов и нанесенных повреждений.
uk: Вмикає або вимикає посилення інструментів і завданих ушкоджень.

source: Enables or disables auto-focus when a ship is loaded.
es: Habilita o Deshabilita el auto-enfocado cuando un barco es cargado.
it: Abilita o disabilita l'auto-focus quando una nave viene caricata.
pt_br: Ativar ou desativar o foco automático quando um objeto/navio é carregado.
ru: Включает или выключает автофокусировку при загрузке корабля.
uk: Вмикає або вимикає автофокусування під час завантаження корабля.

source: Enables or disables auto-focus when an NPC is added.
es: Habilita o Deshabilita el auto-enfocado cuando un NPC es añadido.
it: Abilita o disabilita l'auto-focus quando viene aggiunto un NPC.
pt_br: Ativar ou desativar o foco automático quando um NPC é adicionado.
ru: Включает или выключает автофокусировку при добавлении НИПов.
uk: Вмикає або вимикає автофокус, коли додається НПС.

source: Enables or disables auto-toggling to the exterior view when a non-NPC tool is selected.
es: Habilita o deshabilita la alternancia automática a la vista exterior cuando se selecciona una herramienta que no es NPC.
it: Abilita o disabilita il passaggio alla vista esteriore quando viene selezionato un tool non per gli NPC.
pt_br: Ativa ou desativa a troca automática para a visão externa quando uma ferramenta que não seja um NPC é selecionada.
ru: Включает или выключает автоматическое переключение на внешний вид при выборе инструмента, не относящегося к НИПам.
uk: Вмикає або вимикає автоматичне перемикання на зовнішній вигляд, коли вибран інструмент, що не є НПС.

source: Enables or disables automatic cycling of daylight.
es: Habilita o Deshabilita el ciclo automático de la luz del día.
it: Abilita o disabilita il ciclo giornaliero automatico di illuminazione ambientale.
pt_br: Habilita ou desabilita o ciclo do ''ciclo dia-noite”.
ru: Включает или отключает автоматическое переключение дневного света.
uk: Вмикає або вимикає автоматичне перемикання денного світла.

source: Enables or disables automatic focus on the ship.
es: Habilita o Deshabilita el auto enfocado en el barco.
it: Abilita o disabilita la messa a fuoco automatica.
pt_br: Habilita ou desabilita o ajuste automático da câmera para centralizar no navio.
ru: Включает или выключает автоматическую фокусировку на корабле.
uk: Вмикає або вимикає автоматичне фокусування на кораблі.

source: Enables or disables automatic showing of the ship's electrical panel when a ship with interactive electrical elements is loaded.
es: Habilita o Deshabilita la visualización automática del panel eléctrico del barco cuando se carga un barco con elementos eléctricos interactivos.
it: Abilita o disabilita l'apertura del pannello elettrico quando viene caricata una nave con elementi elettrici.
pt_br: Habilita ou desabilita a abertura automática do painel elétrico ao carregar um navio contendo elementos elétricos interativos.
ru: Включает или выключает автоматический показ электрической панели корабля, когда загружается корабль с интерактивными электрическими элементами.
uk: Вмикає або вимикає автоматичний показ електричної панелі корабля, коли завантажується корабель з інтерактивними електричними елементами.

source: Enables or disables background music while playing the game.
es: Habilita o Deshabilita la música de fondo al jugar el juego.
it: Abilita o disabilita la musica di sottofondo.
pt_br: Habilita ou desabilita a reprodução de música de fundo enquanto o jogo está em execução.
ru: Включает или отключает фоновую музыку во время игры.
uk: Вмикає або вимикає фонову музику під час гри.

source: Enables or disables checking for new versions when the game starts.
es: Habilita o Deshabilita la búsqueda automática de nuevas versiones cuando el juego comienza.
it: Abilita o disabilita il controllo automatico degli aggiornamenti all'avvio del simulatore.
pt_br: Habilita ou desabilita a checagem automática de atualizações na inicialização do jogo.
ru: Включает или отключает проверку наличия новых версий при запуске игры.
uk: Вмикає або вимикає перевірку наявності нових версій під час запуску гри.

source: Enables or disables displacement of water due to interactions with physical objects.
es: Habilita o Deshabilita el desplazamiento del agua debido a interacciones con objetos físicos.
it: Abilita o disabilita la generazione di onde dovute al movimento di oggetti sulla superficie dell'acqua.
pt_br: Abilita ou desabilita a propagação de água causada pelo contato com corpos físicos.
ru: Включает или отключает перемещение воды из-за взаимодействия с физическими объектами.
uk: Вмикає або вимикає переміщення води через взаємодію з фізичними об'єктами.

source: Enables or disables generation of debris when using destructive tools.
es: Habilita o Deshabilita la generación de escombros cuando se usan herramientas destructivas.
it: Abilita o disabilita la produzione di detriti quando si usano strumenti di distruzione.
pt_br: Habilita ou desabilita a criação de fragmentos resultantes do uso de ferramentas destrutivas.
ru: Включает или отключает генерацию обломков при использовании разрушающих инструментов.
uk: Вмикає або вимикає генерацію уламків під час використання руйнівних інструментів.

source: Enables or disables generation of rain during a storm.
es: Habilita o Deshabilita la generación de lluvia durante una tormenta.
it: Abilita o disabilita la pioggia durante una tempesta.
pt_br: Ativa ou desativa a geração de chuva durante uma tempestade.
ru: Включает или отключает генерацию дождя во время шторма.
uk: Вмикає або вимикає генерацію дощу під час шторму.

source: Enables or disables generation of sparkles when using the saw tool on metal.
es: Habilita o Deshabilita la generación de chispas cuando se utiliza la sierra en metal.
it: Abilita o disabilita la produzione di scintille quandi si sega il metallo.
pt_br: Habilita ou desabilita a emissão de partículas de faísca durante o corte de metais com a Serra Elétrica.
ru: Включает или отключает генерацию искр при использовании пилы на металле.
uk: Вмикає або вимикає генерацію іскор під час використання пилки на металі.

source: Enables or disables generation of wakes when engines are running underwater.
es: Habilita o Deshabilita la generación de estela cuando los motores funcionan bajo el agua.
it: Abilita o disabilita la produzione di scie quando i motori girano sott'acqua.
pt_br: Habilita ou desabilita a formação de ondulações na água enquanto os motores estão ativos.
ru: Включает или отключает генерацию следа при работе двигателей под водой.
uk: Вмикає або вимикає генерацію сліду під час роботи двигунів під водою.

source: Enables or disables highlighting of the springs that are under heavy stress and close to rupture.
es: Habilita o Deshabilita el resaltado de los resortes cuando están bajo grande estrés y cerca de la ruptura.
it: Abilita o disabilita l'evidenziazione delle molle che sono sotto stress strutturale e vicine al punto di rottura.
pt_br: Habilita ou desabilita a visualização destacada das molas submetidas a alto estresse e prestes a falhar.
ru: Включает или отключает выделение пружин, находящихся под большим напряжением и близких к разрыву.
uk: Вмикає або вимикає виділення пружин, що перебувають під великою напругою і близькі до розриву.

source: Enables or disables notifications about NPCs.
es: Habilita o Deshabilita las notificaciones sobre NPCs.
it: Abilita o disabilita notifiche sugli NPC.
pt_br: Habilita ou desabilita as notificações sobre os NPCs.
ru: Включает или отключает уведомления о НИПов.
uk: Вмикає або вимикає сповіщення про НПС.

source: Enables or disables notifications when a tsunami is being spawned.
es: Habilita o Deshabilita las notificaciones cuando un tsunami esta siendo generado.
it: Abilita o disabilita notifiche quando vengono generati gli tsunami.
pt_br: Habilita ou desabilita alertas durante a geração de um tsunami.
ru: Включает или отключает уведомления при возникновении цунами.
uk: Вмикає або вимикає сповіщення у разі виникнення цунамі.

source: Enables or disables playing sorrow music when a ship starts sinking.
es: Habilita o Deshabilita la reproducción de música triste cuando un barco comienza a hundirse.
it: Abilita o disabilita la produzione della musica d'addio quando una nave inizia ad affondare.
pt_br: Habilita ou desabilita a música melancólica durante o início do afundamento de uma nave.
ru: Включает или отключает воспроизведение печальной музыки, когда корабль начинает тонуть.
uk: Вмикає або вимикає відтворення сумної музики, коли корабель починає тонути.

source: Enables or disables rendering of explosions.
es: Habilita o Deshabilita la renderización de las explosiones.
it: Abilita o disabilita la visualizzazione delle esplosioni.
pt_br: Habilita ou desabilita a renderização das explosões. (Renderizar explosões pode comprometer o desempenho do jogo em computadores mais fracos.
ru: Включает или отключает рендеринг взрывов.
uk: Вмикає або вимикає рендеринг вибухів.

source: Enables or disables rendering of flames.
es: Habilita o Deshabilita la renderización de las llamas.
it: Abilita o disabilita la visualizzazione delle fiamme.
pt_br: Ativa ou desativa a renderização das chamas. (Renderizar chamas ou explosões pode comprometer o desempenho do jogo em computadores mais fracos.
ru: Включает или отключает рендеринг пламени.
uk: Вмикає або вимикає рендеринг полум'я.

source: Enables or disables rendering of vector fields.
es: Habilita o Deshabilita la renderización de los campos vectoriales.
it: Abilita o disabilita la visualizzazione dei campi vettoriali.
pt_br: Ativa ou desativa a renderização de campos vetoriais.
ru: Включает или отключает отрисовку векторных полей.
uk: Вмикає або вимикає відмальовування векторних полів.

source: Enables or disables saving the last-modified settings when exiting the game.
es: Habilita o Deshabilita el guardado automático de las ultimas configuraciones cuando se cierra el juego.
it: Abilita o disabilita il salvataggio automatico dei parametri quando si esce dal simulatore.
pt_br: Habilita ou desabilita o salvamento automático das configurações recentes ao encerrar o jogo.
ru: Включает или отключает сохранение последних настроек при выходе из игры.
uk: Вмикає або вимикає збереження останніх налаштувань під час виходу з гри.

source: Enables or disables shoaling behavior in fishes.
es: Habilita o Deshabilita el comportamiento de cardumen en los peces.
it: Abilita o disabilita il comportamento da branco nei pesci.
pt_br: Habilita ou desabilita a formação de cardumes de peixes.
ru: Включает или отключает поведение рыб.
uk: Вмикає або вимикає поведінку риб.

source: Enables or disables simulation of wind variations, alternating between dead calm and high-speed gusts.
es: Habilita o Deshabilita la simulación de vientos variados, alternando entre calma y ráfagas de alta velocidad.
it: Abilita o disabilita le variazioni del vento, che alternano tra calma piatta e raffiche ad alta velocità.
pt_br: Habilita ou desabilita a oscilação dinâmica do vento, variando entre ausência total de vento e rajadas fortes.
ru: Включает или отключает симуляцию колебаний ветра, чередующихся между мертвым штилем и высокоскоростными порывами.
uk: Вмикає або вимикає симуляцію коливань вітру, що чергуються між мертвим штилем і високошвидкісними поривами.

source: Enables or disables the bubbling sound when air bubbles come to the surface.
es: Habilita o Deshabilita el sonido de burbujeo cuando estas llegan a la superficie.
it: Abilita o disabilita il suono prodotto dalle bolle d'aria quando raggiungono la superficie del mare.
pt_br: Ativa ou desativa o som das bolhas de ar quando estas chegam à superfície.
ru: Включает или отключает звук пузырей при выходе пузырьков воздуха на поверхность.
uk: Вмикає або вимикає звук бульбашок під час виходу бульбашок повітря на поверхню.
