Repository: GabrieleGiuseppini/Floating-Sandbox
Catalog: Localization/*/ui_strings.po
Languages: es, it, pt_br, ru, uk

source: Moonlight
es: Luz Nocturna
it: Luce lunare
pt_br: Luz da Lua
ru: Лунный свет
uk: Місячне світло

source: Move All/Rotate All
es: Mover todo/Rotar todo
it: Muovi tutto/ruota tutto
pt_br: Mover Tudo/Rotacionar Tudo
ru: Переместить Все/Повернуть Все
uk: Перемістити всі/Повернути всі

source: Move NPC/NPCs
es: Mover NPC/NPCs
it: Muovi NPC/gruppo
pt_br: Mover/Rotacionar NPC's
ru: Переместить НИПа/НИПов
uk: Перемістіть НПС

source: Move/Rotate
es: Mover/Rotar
it: Muovi/ruota
pt_br: Mover/Rotacionar
ru: Двигать/Поворачивать
uk: Рухати/Повертати

source: Move/Rotate Gripped
es: Mover/Rotar Agarrado
it: Muovi/ruota impugnando
pt_br: Mover/Rotacionar Segurado
ru: Двигать/Поворачивать Схваченное
uk: Переміщення/Обертання

source: Mute
es: Silenciar
it: Disattivazione suono
pt_br: Silenciar
ru: Беззвучный
uk: Беззвучний

source: Mute All Sounds
es: Silenciar todos los sonidos
it: Nessun suono
pt_br: Silenciar todos os Sons
ru: Приглушить Все Звуки
uk: Приглушити всі звуки

source: Mutes or allows all sounds.
es: Silencia o Habilita todos los sonidos.
it: Abilita o disabilita tutti i suoni.
pt_br: Silencia (ou permite) todos os sons.
ru: Приглушает или разрешает все звуки.
uk: Приглушує або дозволяє всі звуки.

source: NPC
pt_br: NPCs
ru: НИП
uk: НПС

source: NPC ASSETS
es: RECURSOS NPC
it: RISORSE NPC
pt_br: ASSETS DE NPC
ru: НИП Ресурсы
uk: Активи НПС

source: NPCs
it: NPC
ru: НИПы
uk: НПС

source: NPCs per Group
es: NPCs por grupo
it: NPC per gruppo
pt_br: NPC's por grupo
ru: НИПы по группе
uk: НПС на групу

source: Name of the ship, e.g. "R.M.S. Titanic"
es: Nombre del barco, ej. "R.M.S. Titanic"
it: Nome della nave; ad esempio, "R.M.S. Titanic"
pt_br: Nome do objeto/navio, por exemplo ''R.M.S Titanic''
ru: Название судна, например, "R.M.S. Titanic".
uk: Назва судна, наприклад, "R.M.S. Titanic".

source: Name:
es: Nombre:
it: Nome:
pt_br: Nome:
ru: Имя:
uk: Ім'я:

source: New Electrical Layer
es: Nueva capa eléctrica
it: Nuovo layer elettrico
pt_br: Nova Camada Elétrica
ru: Новый электрический слой
uk: Новий електричний шар

source: New Ropes Layer
es: Nueva capa de cuerda
it: Nuovo layer funi
pt_br: Nova Camada de Corda
ru: Новый слой канатов
uk: Новий шар канатів

source: New Ship
es: Nuevo barco
it: Nuova nave
pt_br: Novo Objeto/Navio
ru: Новый корабль
uk: Новий корабель

source: New Ship Name
es: Nuevo nombre del barco
it: Nome nave
pt_br: Novo nome do Objeto/Navio
ru: Новое название корабля
uk: Нова назва корабля

source: New Ship Size:
es: Nuevo tamaño del barco:
it: Dimensioni nuove navi:
pt_br: Novo Tamanho do Objeto/Navio:
ru: Новый размер корабля:
uk: Новий розмір корабля:

source: New Size
es: Nuevo tamaño
it: Nuove dimensioni
pt_br: Novo Tamanho
ru: Новый размер
uk: Новий розмір

source: New Structural Layer
es: Nueva capa Estructural
it: Nuovo layer strutturale
pt_br: Nova Camada Elétrica
ru: Новый структурный слой
uk: Новий структурний шар

source: Night Vision
es: Visión Nocturna
it: Visione notturna
pt_br: Visão da Noite
ru: Ночное Видение
uk: Нічне бачення

source: No
pt_br: Não
ru: Нет
uk: Ні

source: No Auto-Focus
es: No Auto-Enfocado
pt_br: Sem Foco-Automático
ru: Нет Непрерывной автофокусировки
uk: Немає автофокусу

source: No Debug
es: Sin Depuracion
pt_br: Sem Debug
ru: Нет Отладки
uk: Немає Налагодження

source: No New Updates
es: No hay actualizaciones disponibles
it: Non ci sono nuovi aggiornamenti
pt_br: Sem Atualizações
ru: Нет Новых Обновлений
uk: Немає нових оновлень

source: No visualization: the electrical layer is not drawn.
es: No hay visualización: la capa eléctrica no esta dibujada.
it: Nessuna visualizzazione: il layer elettrico non è visualizzato.
pt_br: Sem visualização: a camada elétrica não é desenhada.
ru: Нет визуализации: электрический слой не прорисован.
uk: Немає візуалізації: електричний шар не промальований.

source: No visualization: the game view is not drawn.
es: No hay visualización: la capa visual del juego no esta dibujada.
it: Nessuna visualizzazione: la modalità gioco non è visualizzata.
pt_br: Sem visualização: a visão do jogo não é desenhada.
ru: Нет визуализации: игровой вид не отрисовывается.
uk: Немає візуалізації: ігровий вигляд не відтворюється.

source: No visualization: the ropes layer is not drawn.
es: No hay visualización: la capa de cuerdas no esta dibujada.
it: Nessuna visualizzazione: il layer delle funi non è visualizzato.
pt_br: Sem visualização: a camada de cordas não é desenhada.
ru: Нет визуализации: слой канатов не отрисовывается.
uk: Немає візуалізації: шар канатів не відтворюється.

source: No visualization: the structural layer is not drawn.
es: No hay visualización: la capa estructural no esta dibujada.
it: Nessuna visualizzazione: il layer strutturale non è visualizzato.
pt_br: Sem visualização: a camada estrutural não é desenhada.
ru: Нет визуализации: структурный слой не отрисовывается.
uk: Немає візуалізації: структурний шар не відтворюється.

source: No visualization: the texture layer is not drawn.
es: No hay visualización: la capa de texturas no esta dibujada.
it: Nessuna visualizzazione: il layer immagine non è visualizzato.
pt_br: Sem visualização: a camada de textura não é desenhada.
ru: Нет визуализации: слой текстуры не отрисовывается.
uk: Немає візуалізації: шар текстури не відтворюється.

source: No, I want to keep my name
es: No, quiero conservar mi nombre
it: No, voglio usare il mio nome
pt_br: Não, eu quero que mantenha meu nome
ru: Нет, я хочу сохранить свое имя
uk: Ні, я хочу зберегти своє ім'я

source: Nominal Force
es: Fuerza Nominal
it: Forza nominale
pt_br: Força Nominal
ru: Номинальное усилие
uk: Номінальне зусилля

source: None
es: Ninguno
it: Nessuno
pt_br: Nenhum
ru: Ничего

source: Normal Screen
es: Modo Ventana
it: Schermo normale
pt_br: Tela Normal
ru: Оконный экран
uk: Віконний екран

source: Number of Clouds
es: Numero de nubes
it: Quantità nuvole
pt_br: Número de Nuvens
ru: Количество Облаков
uk: Количество Облаков

source: Number of Fishes
es: Numero de peces
it: Quantità pesci
pt_br: Número de Peixes
ru: Количество рыб
uk: Кількість риб

source: Number of Stars
es: Numero de estrellas
it: Quantità stelle
pt_br: Número de Estrelas
ru: Количество Звезд
uk: Кількість Зірок

source: OK
ru: ОК
uk: ОК

source: Ocean
es: Oceano
it: Oceano
pt_br: Oceano
ru: Океан
uk: Океан

source: Ocean Floor
es: Fondo marino
it: Fondale oceanico
pt_br: Leito Oceânico
ru: Дно океана
uk: Дно океану

source: Oceanic Waves
es: Olas Oceánicas
it: Once oceaniche
pt_br: Ondas do Oceano
ru: Океанические волны
uk: Океанічні хвилі

source: Offset
es: Desalineacion
it: Scostamento
pt_br: Margem
ru: Смещение
uk: Зміщення

source: One or more particles in the electrical layer have no particles in the structural layer beneath them. Particles in the electrical layer must always be above particles in the structural layer.
es: Una o mas partículas en la capa eléctrica no tienen partículas estructurales debajo de ellas. Partículas en la capa eléctrica siempre deben estar sobre partículas estructurales.
it: Alcune particelle nel layer elettrico non hanno corrispondenti particelle nel layer strutturale sottostante. Le particelle nel layer elettrico devono sempre essere sovrapposte a particelle nel layer strutturale.
pt_br: Uma ou mais partículas na camada elétrica não possuem partículas na camada estrutural abaixo delas. Partículas na camada elétrica devem sempre estar acima de partículas na camada estrutural.
ru: Одна или несколько частиц в электрическом слое не имеют под собой частиц в структурном слое. Частицы в электрическом слое всегда должны находиться над частицами в структурном слое.
uk: Одна або кілька частинок в електричному шарі не мають під собою частинок у структурному шарі. Частинки в електричному шарі завжди мають перебувати над частинками в структурному шарі.

source: Open Download Page
es: Abrir pagina de descargas
it: Apri pagina di download
pt_br: Abrir página de Download
ru: Открыть страницу загрузки
uk: Відкрити сторінку завантаження

source: Open Electrical Panel at Load
es: Abrir panel eléctrico al cargar
it: Apri pannello elettrico automaticamente
pt_br: Abrir Painel Elétrico ao Carregar
ru: Открыть электрическую панель при нагрузке
uk: Відкрити електричну панель під час навантаження

source: Open Home Page
es: Abrir pagina de Floating Sandbox
it: Apri home page
pt_br: Abrir página inicial
ru: Открыть домашнюю страницу
uk: Відкрити домашню сторінку

source: Open Log Window
es: Abrir el registro de eventos
it: Finestra di log
pt_br: Abrir janela de Logs
ru: Открыть окно журнала
uk: Відкрити вікно журналу

source: Open Screenshots Folder
es: Abrir carpeta de capturas de pantalla
it: Apri cartella degli screenshot
pt_br: Abrir a pasta de Capturas de Tela
ru: Открыть папку скриншотов
uk: Відкрити папку Скріншоти

source: Open the ShipBuilder to create a new ship
es: Abrir el constructor de barcos para crear un barco nuevo
it: Apri lo ShipBuilder per creare una nuova nave
pt_br: Abrir o Construtor de Navios/Objetos para criar um novo navio ou objeto
ru: Откройте Судостроитель для создания нового корабля
uk: Відкрийте Суднобудівник для створення нового корабля

source: Open the ShipBuilder to edit the currently-loaded ship
es: Abrir el constructor de barcos para editar el barco actualmente cargado
it: Apri lo ShipBuilder per modificare questa nave
pt_br: Abrir o Construtor de Navios/Objetos para editar o navio/objeto atualmente carregado
ru: Откройте Судостроитель для редактирования загруженного в данный момент корабля
uk: Відкрийте Суднобудівник для редагування завантаженого в даний момент корабля

source: Optimize exterior layer texture on import:
it: Ottimizza il layer esterno:
ru: Оптимизирование наружного текстурного слоя на импорте:
uk: Оптимізувати текстуру зовнішнього шару під час імпорту:

source: Options
es: Opciones
it: Opzioni
pt_br: Opções
ru: Параметры
uk: Опції

source: Order ships by features
es: Ordenar barcos por caracteristicas
it: Ordina le navi secondo le loro caratteristiche
pt_br: Ordenar objetos/navios por características
ru: Упорядочить корабли по характеристикам
uk: Упорядкувати кораблі за характеристиками

source: Order ships by last modified time
es: Ordenar barcos por orden de modificacion
it: Ordina le navi secondo il tempo trascorso dalla loro ultima modifica
pt_br: Ordenar navios/objetos pelo última vez que foram modificados
ru: Упорядочить суда по времени последнего изменения
uk: Упорядкувати судна за часом останньої зміни

source: Order ships by name
es: Ordenar barcos por nombre
it: Ordina le navi secondo il loro nome
pt_br: Ordenar navios/objetos por nome
ru: Упорядочить корабли по названию
uk: Упорядкувати кораблі за назвою

source: Order ships by year built
es: Ordenar barcos por año de construccion
it: Ordina le navi secondo il loro anno di costruzione
pt_br: Ordenar navios/objetos pelo ano de criação
ru: Упорядочить корабли по году постройки
uk: Упорядкувати кораблі за роком побудови

source: Original Size
es: Tamaño original
it: Dimensioni originali
pt_br: Tamanho Original
ru: Оригинальный размер
uk: Оригінальний розмір

source: Original concept (c) Luke Wren, Francis Racicot (Pac0master) 2013
es: Concepto original (c) Luke Wren, Francis Racicot (Pac0master) 2013
it: Idea originale (c) Luke Wren, Francis Racicot (Pac0master) 2013
pt_br: Conceitos Originais (c) Luke Wren, Francis Racicot (Pac0master) 2013
ru: Оригинальный Концепт (c) Luke Wren, Francis Racicot (Pac0master) 2013
uk: Оригінальний Концепт (c) Luke Wren, Francis Racicot (Pac0master) 2013

source: Other Sink
es: Otro hundimiento
it: Altro carico
pt_br: Outros Afundáveis
ru: Другая раковина
uk: Інша раковина

source: Other Tools
es: Otras Herramientas
it: Altri strumenti
pt_br: Outras Ferramentas
ru: Прочие инструменты
uk: Інші інструменти

source: Outboard
es: Fueraborda
it: Fuoribordo
pt_br: Externo
ru: Подвесной
uk: Підвісний

source: Override individual ships' auto-texturization settings with these defaults. This setting is not saved, and it will revert to OFF the next time the game is played.
es: Anular la auto texturizacion de los barcos por texturas por defecto. Estas configuraciones no son guardadas, y se revertirán a Apagado la próxima vez que el juego es jugado.
it: Sostituisci i parametri di auto-texturizzazione specificati dalle navi con questi default. Questo parametro non viene salvato, e tornerà ad essere OFF al prossimo avvio del simulatore.
pt_br: Substitui as configurações automáticas de texturização de cada navio por estes valores padrão. Esta configuração não será salva e será revertida para DESATIVADA na próxima vez que o jogo for iniciado.
ru: Замените настройки автотекстуризации отдельных кораблей этими значениями по умолчанию. Этот параметр не сохраняется, и он вернется в состояние ВЫКЛ при следующем запуске игры.
uk: Замініть налаштування автотекстуризації окремих кораблів цими значеннями за замовчуванням. Цей параметр не зберігається, і він повернеться в стан ВИМКЛ під час наступного запуску гри.

source: Overwrites the selected settings with the current settings.
es: Sobreescribe las configuraciones seleccionadas con las actuales.
it: Sostituisci i parametri selezionati con i parametri correnti.
pt_br: Substitui as configurações selecionadas com as configurações atuais.
ru: Заменяет выбранные настройки текущими настройками.
uk: Замінює вибрані налаштування поточними налаштуваннями.

source: PROGRAMMING
es: PROGRAMACION
it: PROGRAMMAZIONE
pt_br: PROGRAMAÇÃO
ru: ПРОГРАММИРОВАНИЕ
uk: ПРОГРАМУВАННЯ

source: Pan Increment
es: Incremento panoramico
it: Incremento panoramica
pt_br: Incremento de Panorâmica
ru: Приращение панорамирования
uk: Приріст панорамування

source: Parallelism Experiments
it: Esperimenti di parallelismo
pt_br: Experimentos de Paralelismo
ru: Эксперименты по параллелизму
uk: Експерименти з паралелізму

source: Passive Blast Radius Adjust
es: Ajuste de radio de explosiones pasivas
it: Raggio esplosione subita
pt_br: Ajuste do Raio de Explosão (PASSIVO)
ru: Регулировка радиуса пассивного взрыва
uk: Регулювання радіуса пасивного вибуху

source: Password Protection
es: Protección de contraseña
it: Protezione password
pt_br: Proteção por senha
ru: Защита паролем
uk: Захист паролем

source: Paste
es: Pegar
it: Incolla
pt_br: Colar
ru: Вставить
uk: Вставити

source: Paste clipboard.
es: Pegar portapapeles.
it: Incolla la clipboard.
pt_br: Colar da área de transferência.
ru: Вставить буфер обмена.
uk: Вставити буфер обміну.

source: Paste the content of the clipboard into the ship (Ctrl+V).
es: Pegar el contenido del portapapeles en el barco (Ctrl+V)
it: Incolla il contenuto della clipboard nella nave (Ctrl+V).
pt_br: Cole o conteúdo da área de transferência no navio (Ctrl+V).
ru: Вставьте содержимое буфера обмена в корабль (Ctrl+V).
uk: Вставте вміст буфера обміну в корабель (Ctrl+V).

source: Pause
es: Pausa
it: Pausa
pt_br: Pausar
ru: Пауза
uk: Пауза

source: Pause the game
es: Pusar el juego
it: Pausa simulatore
pt_br: Pausar o jogo
ru: Приостановить игру
uk: Призупинити гру

source: Pencil Size:
es: Tamaño del lápiz:
it: Dimensioni matita:
pt_br: Tamanho do lápis:
ru: Размер карандаша:
uk: Розмір олівця:

source: Performance
es: Rendimiento
it: Prestazioni
ru: Производительность
uk: Продуктивність

source: Persistence Adjust
es: Ajuste de la persistencia
it: Durata
pt_br: Ajuste de Persistência
ru: Настройка стойкости дыма
uk: Налаштування стійкості диму

source: Physics
es: Fisicas
it: Fisica
pt_br: Física
ru: Физика
uk: Фізика

source: Physics Tools Affect NPCs
es: Las herramientas físicas afectan a los NPCs
it: Strumenti fisici su NPC
pt_br: Ferramentas de Física Afetam os NPCs
ru: Физические Инструмены Влияют На НИПов
uk: Інструменти фізики впливають на НПС

source: Physics Tools Affect Ships
es: Las herramientas físicas afectan a los Barcos
it: Strumenti fisici su navi
pt_br: Ferramentas de Física Afetam os Navios
ru: Физические Инструменты Воздействуют На Корабль
uk: Фізичні інструменти впливають на кораблі

source: Pick-n-Pull
es: Tomar y Tirar
it: Pinza
pt_br: Pegar e Puxar
ru: Плоскогубцы
uk: Плоскогубці

source: Pixel mode: view electrical particles as pixels.
es: Modo de pixel: ver las partículas eléctricas como pixeles.
it: Modalità pixel: visualizza particelle elettriche come pixel.
pt_br: Modo pixel: visualizar partículas elétricas como pixels.
ru: Пиксельный режим: рассматривать электрические частицы как пиксели.
uk: Піксельний режим: розглядати електричні частинки як пікселі.

source: Pixel mode: view structural particles as pixels.
es: Modo de pixel: ver las partículas estructurales como pixeles.
it: Modalità pixel: visualizza particelle strutturali come pixel.
pt_br: Modo pixel: visualizar partículas estruturais como pixels.
ru: Пиксельный режим: просмотр структурных частиц как пикселей.
uk: Піксельний режим: перегляд структурних частинок як пікселів.

source: Play Background Music
es: Reproducir música de fondo
it: Musica di sottofondo
pt_br: Tocar Música de Fundo
ru: Воспроизведение фоновой музыки
uk: Відтворення фонової музики

source: Play Break Sounds
es: Reproducir sonidos de ruptura
it: Effetti sonori distruzione
pt_br: Reproduzir Efeitos de Destruição
ru: Воспроизвести звуки разрушения
uk: Відтворити звуки руйнування

source: Play Bubbles' Surface Sounds
es: Reproducir sonido de burbujas al llegar a la superficie
it: Effetti sonori bolle d'aria
pt_br: Reproduzir efeitos de Bolhas na Superfície
ru: Воспроизвести звуки поверхности пузырей
uk: Відтворити звуки поверхні бульбашок

source: Play Farewell Music
es: Reproducir música de Farewell
it: Musica d'addio
pt_br: Tocar Música de Afundamento
ru: Включи прощальную музыку
uk: Увімкни прощальну музику

source: Play Stress Sounds
es: Reproducir sonidos de estres
it: Effetti sonori stress
pt_br: Reproduzir sons de Extresse
ru: Воспроизвести звуки стресса
uk: Відтворити звуки стресу

source: Play Wind Sounds
es: Reproducir sonidos de viento
it: Effetti sonori vento
pt_br: Reproduzir sons de Ventania
ru: Воспроизвести звуки ветра
uk: Відтворити звуки вітру

source: Please note that a restart is required for language changes to take effect.
es: Por favor recuerda que es necesario un reinicio para que el cambio de idioma surta efecto.
it: Nota: la modifica della lingua avrà effetto solamente al prossimo avvio del simulatore.
pt_br: Observe que é necessário reiniciar o jogo para que o idioma escolhido seja aplicado.
ru: Обратите внимание: чтобы изменения языка вступили в силу, требуется перезагрузка.
uk: Зверніть увагу: щоб зміни мови набули чинності, потрібне перезавантаження.

source: Power (HP)
es: Poder (HP)
it: Potenza (HP)
pt_br: Força (HP)
ru: Мощность (HP)
uk: Потужність (HP)

source: Power Adjust
es: Ajuste de poder
it: Potenza
pt_br: Ajuste de Força
ru: Регулировка силы
uk: Регулювання потужності

source: Power Monitor
es: Monitor de poder
it: Sensore di corrente
pt_br: Monitor de Força
ru: Монитор питания
uk: Монітор живлення

source: Prefer This Ship Name?
es: ¿Prefieres este nombre del barco?
it: Preferisci questo nome?
pt_br: Preferir este nome para o seu navio/objeto?
ru: Предпочитаете это название корабля?
uk: Віддаєте перевагу цій назві корабля?

source: Preferences
es: Preferencias
it: Preferenze
pt_br: Preferências
ru: Параметры
uk: Параметри

source: Preset Colors:
es: Colores preseleccionados:
it: Colori predefiniti:
pt_br: Cores Pré-definidas:
ru: Заданные цвета:
uk: Задані кольори:

source: Pressure Drag Adjust
es: Ajuste de arrastre de presión
it: Resistenza dinamica
pt_br: Ajuste do Arrasto por Pressão
ru: Регулировка Сопротивления к Давлению Воздуха
uk: Регулювання опору до тиску повітря

source: Prevents ship descriptions from being shown each time a ship is loaded. You can always change this setting later from the "Game Preferences" window.
es: Previene que las descripciones de los barcos sean mostradas cada vez que un barco es cargado. Siempre puedes cambiar esta configuración luego desde la ventana de "Preferencias del juego".
it: Evita la visualizzazione delle descrizioni delle navi ad ogni caricamento. È sempre possibile modificare questa impostazione in un secondo momento dal menu "Preferenze".
pt_br: Impede que descrições dos navios ou objetos sejam exibidas toda vez que um navio/objeto é carregado. Você sempre pode alterar esta configuração mais tarde na janela ''Preferências do Jogo''.
ru: Предотвращает отображение описаний кораблей каждый раз при загрузке корабля. Вы всегда можете изменить этот параметр позже в окне «Настройки игры».
uk: Запобігає відображенню описів кораблів щоразу під час завантаження корабля. Ви завжди можете змінити цей параметр пізніше у вікні "Налаштування гри".

source: Prevents the automatic update check from notifying about version %s again.
es: Previene que las actualizaciones automáticas me notifiquen sobre esta versión %s de nuevo.
it: Impedisce ulteriori notifiche per la versione %s.
pt_br: Impede que a verificação automática de atualizações notifique novamente sobre a versão %s.
ru: Запрещает автоматическую проверку обновлений снова уведомлять о версии %s.
uk: Забороняє автоматичну перевірку оновлень знову повідомляти про версію %s.

source: Prevents the automatic update check from running at startup.
es: Previene que la búsqueda de actualizaciones automáticas se ejecute al iniciar.
it: Impedisce l'esecuzione del controllo automatico aggiornamenti all'avvio.
pt_br: Desativa a checagem automática de atualizações ao iniciar o jogo.
ru: Запрещает запускать автоматическую проверку обновлений при запуске.
uk: Забороняє запускати автоматичну перевірку оновлень під час запуску.

source: Prevents these tips from being shown each time the game starts. You can always change this setting later from the "Game Preferences" window.
es: Previene que los consejos sean mostrados caga vez que el juego se inicia. Siempre puedes cambiar esta configuración desde la ventana "Preferencias del juego".
it: Impedisce che questi suggerimenti vengano visualizzati ogni volta che il gioco si avvia. È sempre possibile modificare questa impostazione in un secondo momento dal menu "Preferenze".
pt_br: Impede que descrições dos navios ou objetos sejam exibidas toda vez que um navio/objeto é carregado. Você sempre pode alterar esta configuração mais tarde na janela ''Preferências do Jogo''.
ru: Предотвращает показ этих советов при каждом запуске игры. Вы всегда можете изменить этот параметр позже в окне «Настройки игры».
uk: Запобігає показу цих порад під час кожного запуску гри. Ви завжди можете змінити цей параметр пізніше у вікні "Налаштування гри".

source: Primary Material
es: Material Primario
it: Materiale principale
pt_br: Material Primário
ru: Первичный материал
uk: Первинний матеріал

source: Programmed in Amsterdam, the Netherlands
es: Programado en Ámsterdam, Paises Bajos
it: Programmato in Amsterdam, Paesi Bassi
pt_br: Jogo programado no Amsterdã, Países Baixos
ru: Программируется в Амстердаме, Нидерланды
uk: Програмується в Амстердамі, Нідерланди

source: Propellers Work Above Water
es: Las propelas funcionan fuera del agua
it: Eliche funzionano all'asciutto
pt_br: Propulsores funcionam abaixo d'água
ru: Винты Работают Над Водой
uk: Пропелери працюють над водою

source: Properties
es: Propiedades
it: Proprietà
pt_br: Propriedades
ru: Свойства
uk: Властивості

source: Provide Password
es: Proporcionar Contraseña
it: Specifica una password
pt_br: Fornecer Senha
ru: Введите пароль
uk: Введіть пароль

source: Push Button
es: Botón
it: Interruttore a pressione
pt_br: Pressionar botão
ru: Нажмите кнопку
uk: Натисніть кнопку

source: Quit
es: Salir
it: Esci
pt_br: Sair
ru: Выйти
uk: Вийти

source: Quit and leave the program (ALT+F4).
es: Salir e irse del programa (ALT+F4).
it: Esci (ALT+F4).
pt_br: Sair e fechar o programa (ALT+F4).
ru: Выйти из программы (ALT+F4).
uk: Вийти з програми (ALT+F4).
