Repository: GabrieleGiuseppini/Floating-Sandbox
Catalog: Localization/*/ui_strings.po
Languages: es, it, pt_br, ru, uk

source: Enables or disables the display of extended game performance information, such as update/render ratio and counts of primitives being rendered.
es: Habilita o Deshabilita la muestra de información extendida de el rendimiento del juego, como la versión/frecuencia de renderizado y recuentos de primitivas que se renderizan.
it: Abilita o disabilita la visualizzazione di informazioni diagnostiche aggiuntive.
pt_br: Ativa ou desativa a exibição de informações detalhadas de desempenho do jogo, como a relação atualização/renderização e a contagem de primitivas sendo renderizadas.
ru: Включает или отключает отображение расширенной информации о производительности игры, такой как коэффициент обновления/визуализации и количество визуализируемых примитивов.
uk: Вмикає або вимикає відображення розширеної інформації про продуктивність гри, як-от коефіцієнт оновлення/візуалізації та кількість примітивів, що візуалізуються.

source: Enables or disables the display of game performance information, such as frame rate and time elapsed.
es: Habilita o Deshabilita la muestra de información de rendimiento, como los Fotogramas por segundo y el tiempo transcurrido.
it: Abilita o disabilita la visualizzazione di informazioni diagnostiche sulla performance del simulatore.
pt_br: Ativa ou desativa a exibição de informações de desempenho do jogo, como taxa de quadros (FPS) e tempo decorrido.
ru: Включает или отключает отображение информации о производительности игры, такой как частота кадров и прошедшее время.
uk: Вмикає або вимикає відображення інформації про продуктивність гри, такої як частота кадрів і минулий час.

source: Enables or disables the effect of physics tools - such as Swirl, Attract, or Repel - on NPCs.
es: Habilita o deshabilita el efecto de las herramientas de física - Como el remolino, atraer o repeler - en NPCs.
it: Abilita o disabilita l'effetto di strumenti fisici - quali Vortice, Attrai, o Respingi - sugli NPC.
pt_br: Ativa ou desativa o efeito das ferramentas físicas — como ''Redemoinho'', ''Atrair'' ou ''Repelir'' — sobre os NPCs.
ru: Включает или отключает действие физических инструментов, таких как Вращение, Притяжение или Отталкивание, на НИПов.
uk: Вмикає або вимикає дію фізичних інструментів, таких як Вихор, Притягувати, або Відштовхувати, на НПС.

source: Enables or disables the effect of physics tools - such as Swirl, Attract, or Repel - on Ships.
es: Habilita o deshabilita el efecto de las herramientas de física - Como el remolino, atraer, o repeler - en Barcos.
it: Abilita o disabilita l'effetto di strumenti fisici - quali Vortice, Attrai, o Respingi - sule navi.
pt_br: Ativa ou desativa o efeito das ferramentas físicas — como ''Redemoinho'', ''Atrair'' ou ''Repelir'' - nos navios.
ru: Включает или отключает действие физических инструментов, таких как Вращение, Притяжение или Отталкивание, на кораблях.
uk: Вмикає або вимикає дію фізичних інструментів, таких як Вихор, Притягувати, або Відштовхувати, на НПС.

source: Enables or disables the generation of sounds when materials are under stress.
es: Habilita o Deshabilita la generación de sonidos cuando los materiales están bajo estrés.
it: Abilita o disabilita la produzione di effetti sonori quando i materiali sono sotto stress.
pt_br: Habilita ou desabilita a reprodução de efeitos sonoros causados pelo estresse em materiais.
ru: Включает или отключает генерацию звуков, когда материалы подвергаются нагрузке.
uk: Вмикає або вимикає генерацію звуків, коли матеріали піддаються навантаженню.

source: Enables or disables the generation of sounds when materials break.
es: Habilita o Deshabilita la generación de sonidos cuando los materiales se rompen.
it: Abilita o disabilita la produzione di effetti sonori quando i materiali si rompono.
pt_br: Habilita ou desabilita a reprodução de efeitos sonoros decorrentes da ruptura de materiais.
ru: Включает или отключает генерацию звуков при разламывании/разрыве материалов.
uk: Вмикає або вимикає генерацію звуків під час розламування/розриву матеріалів.

source: Enables or disables the generation of wind sounds.
es: Habilita o Deshabilita la generación de sonidos del viento.
it: Abilita o disabilita la produzione di effetti sonori per il vento.
pt_br: Habilita ou desabilita a reprodução de efeitos sonoros de ventania.
ru: Включает или отключает генерацию звуков ветра.
uk: Вмикає або вимикає генерацію звуків вітру.

source: Enables or disables the moon's light at night.
es: Habilita o Deshabilita la luz de la luna en la noche.
it: Abilita o disabilita la luce lunare di notte.
pt_br: Habilita ou desabilita a iluminação lunar durante o período noturno.
ru: Включает или выключает свет луны в ночное время.
uk: Вмикає або вимикає місячне світло вночі.

source: Enables or disables the tips shown when the game starts.
es: Habilita o Deshabilita los consejos cuando el juego inicia.
it: Abilita o disabilita suggerimenti all'avvio del simulatore.
pt_br: Ativa ou desativa as dicas exibidas quando o jogo é iniciado.
ru: Включает или отключает подсказки, отображаемые при запуске игры.
uk: Вмикає або вимикає підказки, що відображаються під час запуску гри.

source: Enables or disables the window showing ship descriptions when ships are loaded.
es: Habilita o Deshabilita las descripciones de los barcos cuando son cargados.
it: Abilita o disabilita la finestra che mostra le descrizioni delle navi al loro caricamento.
pt_br: Ativa ou desativa a janela que exibe as descrições dos navios quando estes são carregados.
ru: Включает или отключает окно с описанием кораблей при их загрузке.
uk: Вмикає або вимикає вікно з описом кораблів під час їх завантаження.

source: Enables or disables the working of propellers when they are not underwater.
es: Habilita o Deshabilita el funcionamiento de las propelas cuando no están bajo el agua.
it: Abilita o disabilita il funzionamento dei motori ad elica quando i motori girano fuori dall'acqua.
pt_br: Ativa ou desativa o funcionamento das hélices quando elas não estão submersas.
ru: Включает или выключает работу гребных винтов, когда они не находятся под водой.
uk: Вмикає або вимикає роботу гвинтів, коли вони не під водою.

source: Enables or disables visual notifications when an electrical element changes state.
es: Habilita o Deshabilita las notificaciones visuales cuando un elemento cambia su estado eléctrico.
it: Abilita o disabilita notifiche visive quando i materiali elettrici cambiano stato.
pt_br: Habilita ou desabilita a sinalização visual de transições de estado em componentes elétricos.
ru: Включает или отключает визуальные уведомления при изменении состояния электрического элемента.
uk: Вмикає або вимикає візуальні повідомлення у разі зміни стану електричного елемента.

source: Enables or disables visualization of the AABBs (Axis-Aligned Bounding Boxes).
es: Habilita o Deshabilita la virtualización de los CDAEs (Cuadros delimitadores alineados con el eje)
it: Abilita o disabilita la visualizzazione delle AABBs (riquadri contenitivi allineati agli assi).
pt_br: Habilita ou desabilita a visualização das caixas delimitadoras alinhadas aos eixos (AABBs).
ru: Включает или отключает визуализацию AABB (ограничивающих рамок, выровненных по оси).
uk: Вмикає або вимикає візуалізацію AABB (обмежувальних рамок, вирівняних по осі).

source: Enables or disables visualization of the frontiers of the ship.
es: Habilita o Deshabilita la virtualización de las bordes del barco.
it: Abilita o disabilita la visualizzazione dei bordi delle navi.
pt_br: Habilita ou desabilita a visualização dos limites estruturais do navio.
ru: Включает или отключает визуализацию границ корабля.
uk: Вмикає або вимикає візуалізацію кордонів корабля.

source: Engine
es: Motor
it: Motore
pt_br: Motor
ru: Двигатель
uk: Двигун

source: Engine Controller
es: Control del Motor
it: Controllore motore
pt_br: Controlador do Motor
ru: Контроллер двигателя
uk: Контролер двигуна

source: Engine Thrust Adjust
es: Ajuste de potencia de los motores
it: Spinta motore
pt_br: Ajustar Empuxo do Motor
ru: Регулировка Тяги Двигателя
uk: Регулювання тяги двигуна

source: Engine Transmission
es: Transmisión de motor
it: Trasmissione motore
pt_br: Transmissão do Motor
ru: Трансмиссия двигателя
uk: Трансмісія двигуна

source: Engine Type
es: Tipo del Motor
it: Tipo motore
pt_br: Tipo de Motor
ru: Тип двигателя
uk: Тип двигуна

source: Erase background.
es: Borrar fondo.
it: Rimuovi colore di sfondo.
pt_br: Apagar plano de fundo.
ru: Стереть фон.
uk: Стерти тло.

source: Erase individual electrical elements.
es: Borrar individualmente los elementos eléctricos.
it: Rimuovi elementi elettrici.
pt_br: Apagar elementos elétricos individuais.
ru: Стирание отдельных электрических элементов.
uk: Стирання окремих електричних елементів.

source: Erase individual structure particles.
es: Borrar individualmente las partículas estructurales.
it: Rimuovi particelle strutturali.
pt_br: Apagar partículas individuais da estrutura.
ru: Стирание отдельных частиц структуры.
uk: Стирання окремих частинок структури.

source: Erase individual texture pixels.
es: Borrar individualmente los pixeles de textura.
it: Rimuovi pixels dalla texture.
pt_br: Apagar pixels individuais da textura.
ru: Стирание отдельных пикселей текстуры.
uk: Стирання окремих пікселів текстури.

source: Erase only pixels contiguous to the starting pixel. When not checked, the tool effectively removes colors.
es: Bolar solo los pixeles contiguos al pixel inicial. Al estar deshabilitado seleccionado, esta herramienta remueve colores.
it: Rimuovi solamente pixels adiacenti al pixel iniziale. Quando quest'opzione non è abilitata, lo strumento rimuove il colore interamente.
pt_br: Apagar apenas os pixels contíguos ao pixel inicial. Quando desmarcado, a ferramenta remove as cores.
ru: Стирать только пиксели, смежные с начальным пикселем. Если флажок не установлен, инструмент эффективно удаляет цвета.
uk: Стирати тільки пікселі, суміжні з початковим пікселем. Якщо прапорець не встановлено, інструмент ефективно видаляє кольори.

source: Erase rope endpoints.
es: Borrar las puntas de las cuerdas.
it: Rimuovi funi.
pt_br: Apagar as extremidades da corda.
ru: Стереть конечные точки каната.
uk: Стерти кінцеві точки каната.

source: Erase the specified region and copy its content to the clipboard (Ctrl+X).
es: Eliminar la región especificada y copiar su contenido al portapapeles (Ctrl+x)
it: Taglia la selezione e copiane i contenuti nella clipboard (Ctrl+X).
pt_br: Apagar a região especificada e copiar seu conteúdo para a área de transferência (Ctrl+X).
ru: Стереть указанную область и скопировать ее содержимое в буфер обмена (Ctrl+X).
uk: Стерти зазначену область і скопіювати її вміст у буфер обміну (Ctrl+X).

source: Eraser Size:
es: Tamaño del borrador:
it: Dimensioni cancellino:
pt_br: Tamanho da Borracha:
ru: Размер ластика:
uk: Розмір гумки:

source: Error
it: Errore
pt_br: Erro
ru: Ошибка
uk: Помилка

source: Event Recording
es: Grabación de eventos
it: Registrazione Eventi
pt_br: Registro de Eventos
ru: Запись событий
uk: Запис подій

source: Explosion
it: Esplosione
pt_br: Explosão
ru: Взрыв
uk: Вибух

source: Export
es: Exportar
it: Esporta
pt_br: Exportar
ru: Экспорт
uk: Експорт

source: Export this layer to a file.
es: Exportar esta capa a un archivo.
it: Esporta questo layer.
pt_br: Exportar esta camada para um arquivo.
ru: Экспортируйте этот слой в файл.
uk: Експортуйте цей шар у файл.

source: Extent
es: Extensión
it: Ampiezza
pt_br: Extensão
ru: Степень
uk: Ступінь

source: Exterior Layer
es: Capa exterior
it: Layer esteriore
pt_br: Camada Exterior
ru: Слой Внешнего Вида
uk: Зовнішній шар

source: Exterior View
es: Vista Exterior
it: Vista esteriore
pt_br: Visão Externa
ru: Внешний Вид
uk: Зовнішній вигляд

source: Extra Draw Options
es: Opciones extra de dibujado
it: Opzioni extra di visualizzazione
pt_br: Opções extras de Renderização
ru: Дополнительные параметры отрисовки
uk: Додаткові параметри відмальовування

source: FACTORY OF IDEAS
es: FABRICA DE IDEAS
it: FABBRICA DI IDEE
pt_br: FABRICA DE IDÉIAS
ru: ГЕНЕРАТОР ИДЕЙ
uk: ГЕНЕРАТОР ІДЕЙ

source: False
es: Falso
pt_br: Falso
ru: Выключить
uk: Вимкнути

source: Farewell Music Volume
es: Volumen de la música de Farewell
it: Musica d'addio
pt_br: Volume da música de afundamento
ru: Громкость Прощальной Музыки
uk: Гучність Прощальної Музики

source: File
es: Archivo
pt_br: Arquivo
ru: Файл
uk: Файл

source: Fill Mode:
es: Modo de llenado:
it: Modalità riempimento:
pt_br: Modo de Preenchimento:
ru: Режим заливки:
uk: Режим заповнення:

source: Fill an area with structure particles.
es: Llenar un área con partículas estructurales.
it: Riempi un'area con particelle strutturali.
pt_br: Preencher uma área com partículas estruturais.
ru: Заполните область частицами структуры.
uk: Заповніть область частинками структури.

source: Fire Extinguisher
es: Extintor de fuego
it: Estintore
pt_br: Extintor de Incêndio
ru: Огнетушитель
uk: Вогнегасник

source: Fire-Extinguishing
es: Extinción de fuego
it: Estinguente
pt_br: Extinção de Incêndio
ru: Огнетушение
uk: Пожежогасіння

source: Fishes
es: Peces
it: Pesci
pt_br: Peixes
ru: Рыбы
uk: Риби

source: Fix This Error
es: Arreglar este error
it: Correggi
pt_br: Corrigir este Erro
ru: Исправьте эту ошибку
uk: Виправте цю помилку

source: Fix this error by removing the offending electrical particles.
es: Arreglar este error eliminando las partículas eléctricas problemáticas.
it: Correggi questo errore rimuovendo le particelle elettriche che lo causano.
pt_br: Corrigir este erro removendo as partículas elétricas problemáticas.
ru: Исправьте эту ошибку, удалив нарушившие ее электрические частицы.
uk: Виправте цю помилку, видаливши електричні частинки, що порушили її.

source: Flame Chaos Adjust
es: Ajustar el caos de las llamas
it: Caoticità fiamme
pt_br: Ajuste do Caos das Chamas
ru: Хаос пламени
uk: Налаштування хаосу полум'я

source: Flame Size Adjust
es: Ajustar el tamaño de las llamas
it: Dimensioni fiamme
pt_br: Ajustar tamanho das Chamas
ru: Размер пламени
uk: Розмір полум'я

source: Flat
es: Plano
it: Tinta unita
pt_br: Plano
ru: Один Цвет
uk: Плоский

source: Flat Structure
es: Estructura plana
it: Struttura a tinta unita
pt_br: Estrutura Plana
ru: Плоская Конструкция
uk: Плоская Конструкция

source: Flat Structure mode.
es: Modo de estructura plana.
it: Modalità struttura a tinta unita.
pt_br: Modo de Estrutura Plana.
ru: Режим плоской структуры.
uk: Режим плоскої структури.

source: Flat Structure mode: generates a texture using the particles' matte colors.
es: Modo de estructura plana: Genera una textura usando el color mate de las partículas.
it: Modalità struttura a tinta unita: genera un'immagine utilizzando i colori delle particelle strutturali.
pt_br: Modo Estrutura Plana: gera uma textura usando as cores opacas das partículas.
ru: Режим Flat Structure: генерирует текстуру, используя матовые цвета частиц.
uk: Режим Плоска Структура: генерує текстуру з використанням матових кольорів частинок.

source: Flip H
es: Dar vuelta horizontalmente
it: Capovolta O
pt_br: Virar Horizontalmente
ru: Перевернуть H
uk: Перевернути H

source: Flip H+V
es: Dar vuelta horizontal y verticalmente
it: Capovolta O+V
pt_br: Virar Horizontal e Vertical
ru: Перевернуть H+V
uk: Перевернути H+V

source: Flip V
es: Dar vuelta verticalmente
it: Capovolta V
pt_br: Virar Verticalmente
ru: Перевернуть V
uk: Перевернути V

source: Flip ship horizontally when loaded
es: Dar vuelta el barco horizontalmente al ser cargado
it: Carica la nave capovolta lungo la direzione orizzontale
pt_br: Virar objeto/navio horizontalmente quando carregado
ru: Перевернуть корабль в горизонтальное положение при загрузке
uk: Перевернути корабель у горизонтальне положення під час завантаження

source: Flip ship vertically when loaded
es: Dar vuelta el barco verticalmente al ser cargado
it: Carica la nave capovolta lungo la direzione verticale
pt_br: Virar objeto/navio verticalmente quando carregado
ru: Перевернуть корабль вертикально при загрузке
uk: Перевернути корабель вертикально під час завантаження

source: Flip the pasted region horizontally.
es: Dar vuelta la región pegada horizontalmente.
it: Capovolgi la regione incollata lungo la direzione orizzontale.
pt_br: Virar horizontalmente a região colada.
ru: Переверните вставленную область по горизонтали.
uk: Переверніть вставлену область по горизонталі.

source: Flip the pasted region vertically.
es: Dar vuelta la región pegada verticalmente.
it: Capovolgi la regione incollata lungo la direzione verticale.
pt_br: Virar verticalmente a região colada.
ru: Переверните вставленную область по вертикали.
uk: Переверніть вставлену область по вертикалі.

source: Flip the ship horizontally.
es: Dar vuelta el barco horizontalmente.
it: Capovolgi la nave lungo la direzione orizzontale.
pt_br: Virar o objeto/navio horizontalmente.
ru: Переверните корабль в горизонтальное положение.
uk: Перевернути корабель вертикально під час завантаження.

source: Flip the ship vertically.
es: Dar vuelta el barco verticalmente.
it: Capovolgi la nave lungo la direzione verticale.
pt_br: Virar o objeto/navio verticalmente.
ru: Переверните корабль вертикально.
uk: Переверніть корабель вертикально.

source: Floats:
es: Flota:
it: Galleggia:
pt_br: Flutuantes:
ru: Плавучесть:
uk: Плавучість:

source: Flood Tool
es: Herramienta de inundación
it: Strumento inonda/asciuga
pt_br: Ferramenta de Inundar
ru: Инструмент наводнения
uk: Інструмент повені

source: Flood only particles touching each other. When not checked, the flood tool effectively replaces a material with another.
es: Inundar solo partículas tocándose entre si. Cuando la casilla esta vacía, la herramienta de inundación reemplaza un material por otro.
it: Espandi solamente tra particelle in contatto l'una con l'altra. Quando quest'opzione non è abilitata, lo strumento semplicemente sostituisce un materiale con un altro.
pt_br: Alagar apenas partículas que estão em contato. Quando desmarcado, a ferramenta de preenchimento substitui efetivamente um material por outro.
ru: Заливает только частицы, соприкасающиеся друг с другом. Если флажок не установлен, инструмент заливки эффективно заменяет материал другим.
uk: Заливає тільки частинки, що стикаються одна з одною. Якщо прапорець не встановлено, інструмент заливки ефективно замінює матеріал іншим.

source: Flood/Dry
es: Inundar/Secar
it: Inonda/asciuga
pt_br: Inundar/Extrair
ru: Насос
uk: Насос

source: Flow
es: Fluidez
it: Flusso
pt_br: Fluxo
ru: Поток
uk: Потік

source: Fluid Crazyness
es: Locura del fluido
it: Vivacità fluidi
pt_br: Instabilidade dos Liquidos
ru: Водное безумие
uk: Водне божевілля

source: Follow NPC
es: Seguir NPC
it: Segui NPC
pt_br: Seguir NPC
ru: Следить за НИПом
uk: Дотримуйтесь НПС

source: Force Adjust
es: Ajuste de fuerza
it: Potenza
pt_br: Ajuste de Força
ru: Регулировка силы
uk: Регулювання потужності

source: Force Defaults onto Ships
es: Forzar por defecto en los Barcos
it: Imponi default alle navi
pt_br: Aplicar configurações padrão aos navios
ru: Принудительно установить для кораблей значения по умолчанию
uk: Примусово встановити для кораблів значення за замовчуванням

source: Force no glFinish()
es: Forzar Apagado glFinish()
it: Non invocare glFinish()
pt_br: Forçar sem glFinish()
ru: Не принудительно использовать glFinish ()
uk: Не примусово використовувати glFinish ()

source: Force no multithreaded rendering
es: Forzar renderizado mononucleo
it: No multithreaded rendering
pt_br: Desativa a renderização em múltiplas threads
ru: Запрещать многопоточный рендеринг
uk: Забороняти багатопотоковий рендеринг

source: Forecast where the ship's waterline will be once the ship is in the water.
es: Predecir donde estará la linea de flotación del baro una vez que el barco este en el agua.
it: Anticipa dove si troverà la linea di galleggiamento della nave.
pt_br: Prever onde ficará a linha d’água do navio/objeto quando ele estiver na água.
ru: Прогнозирование того, где будет находиться ватерлиния судна, когда оно окажется на воде.
uk: Прогнозування того, де перебуватиме ватерлінія судна, коли воно опиниться на воді.

source: Frame Rate
es: Fotogramas por Segundo
it: Velocità frame
pt_br: Taxa de Quadros
ru: Частота Кадров
uk: Частота Кадрів

source: Friction
es: Friccion
it: Attrito
pt_br: Fricção
ru: Трение
uk: Тертя

source: Friction Adjust
es: Ajuste de la fricción
it: Attrito
pt_br: Ajuste de Fricção
ru: Регулировка трения
uk: Регулювання тертя

source: Friction Drag Adjust
es: Ajuste de la fricción por arrastre
it: Resistenza di attrito
pt_br: Ajuste do arrasto por Fricção
ru: Регулировка сопротивления к трению
uk: Регулювання опору до тертя

source: From Image
es: Desde una imagen
it: Da immagine
pt_br: De uma Imagem
ru: Из изображения
uk: Із зображення

source: Full Day/Night
es: Dia/Noche Absoluto
it: Giorno/Notte
pt_br: Ciclos de Dia/Noite Completos
ru: Полная(й) День/Ночь
uk: Повний день/ніч

source: Full Screen
es: Pantalla completa
it: Schermo pieno
pt_br: Tela Cheia
ru: Полный Экран
uk: Повний Екран

source: Game
es: Juego
it: Gioco
pt_br: Jogo
ru: Игра
uk: Гра

source: Game Preferences
es: Preferencias del juego
it: Preferenze
pt_br: Preferências de Jogo
ru: Игровые Предпочтения
uk: Ігрові Вподобання

source: Game Preferences...
es: Preferencias del juego...
it: Preferenze...
pt_br: Preferências de Jogo...
ru: Игровые Предпочтения...
uk: Ігрові Вподобання...

source: Game View
es: Vista del juego
it: (Visualizzazione gioco)
pt_br: Visão de Jogo
ru: Просмотр игры
uk: Перегляд гри

source: Generate Debris
es: Generar escombros
it: Genera detriti
pt_br: Gerar Destroços
ru: Создать Мусор
uk: Створити Сміття

source: Generate Engine Wake
es: Generar estela de motores
it: Genera scia motore
pt_br: Gerar rastro do Motor
ru: Генерация следа от лопастей
uk: Генерація сліду від лопатей

source: Generate Sparkles
es: Generar Chispas
it: Genera scintille
pt_br: Gerar Faíscas
ru: Создать искры
uk: Створити іскри

source: Generator
es: Generador
it: Generatore
pt_br: Gerador
ru: Генератор
uk: Генератор

source: Get More Ships...
es: Conseguir mas barcos...
it: Scarica ulteriori navi...
pt_br: Obter mais objetos/navios...
ru: Получить больше кораблей...
uk: Отримати більше кораблів...

source: Get help about the simulator
es: Obtener ayuda sobre el simulador
it: Mostra la guida del simulatore
pt_br: Ajuda sobre o simulador
ru: Получите помощь по симулятору
uk: Отримайте допомогу щодо симулятора

source: Global Damping Adjust
es: Ajuste de amortiguación global
it: Smorzamento velocità
pt_br: Ajustar Amortecimento Geral
ru: Глобальная Регулировка Демпфирования
uk: Глобальне Регулювання Демпфірування

source: Global Sound and Music
es: Ajusta el sonido y la música
it: Suono e musica
pt_br: Efeitos Gerais e Músicas
ru: Глобальный звук и музыка
uk: Глобальний звук і музика

source: Go to the Download Page!
es: Ir a la pagina de descargas!
it: Vai alla pagina per scaricarlo!
pt_br: Abrir página de Download!
ru: Перейдите на страницу загрузки!
uk: Перейдіть на сторінку завантаження!

source: Go to the default Ships folder
es: Ir a la carpeta de barcos por defecto
it: Vai alla cartella delle navi di default
pt_br: Ir para a pasta padrão de navios/objetos
ru: Перейдите в папку кораблей по умолчанию
uk: Перейдіть до папки кораблів за замовчуванням

source: Go to the next search result
es: Ir al siguiente resultado de busqueda
it: Vai al prossimo risultato della ricerca
pt_br: Ir para o próximo resultado da pesquisa
ru: Перейти к следующему результату поиска
uk: Перейти до наступного результату пошуку

source: Go to your Ships folder
es: Ir a tu carpeta de Barcos
it: Vai alla cartella con le tune navi
pt_br: Abrir seu repositório de navios ou objetos
ru: Перейдите в папку "Корабли"
uk: Перейдіть у папку "Кораблі"

source: Green Screen
es: Pantalla verde
it: Schermo verde
pt_br: Tela Verde
ru: Зеленый экран
uk: Зелений екран
