Repository: GabrieleGiuseppini/Floating-Sandbox
Catalog: Localization/*/ui_strings.po
Languages: es, it, pt_br, ru, uk

source: Guide
es: Guia
it: Guida
pt_br: Guia
ru: Руководство
uk: Керівництво

source: Gust Amplitude
es: Amplitud de las ráfagas
it: Ampiezza raffiche
pt_br: Amplitude das Rajadas de Vento
ru: Амплитуда порыва ветра
uk: Амплітуда пориву вітру

source: Heat
es: Calor
it: Calore
pt_br: Calor
ru: Высокая температура
uk: Висока температура

source: Heat Boost
es: Aumento de temperatura
it: Amplificazione calore
pt_br: Aumento do Calor
ru: Повышение температуры
uk: Підвищення температури

source: Heat Dissipation Adjust
es: Ajuste de la disipación del calor
it: Dissipazione calore
pt_br: Ajudar dissipação do Calor
ru: Потеря тепла. (Остывание материала)
uk: Регулювання тепловіддачі

source: Heat Draw Options
es: Opciones de dibujo de calor
it: Visualizzazione calore
pt_br: Opção de renderização do calor
ru: Параметры тепловой настройки
uk: Параметри теплового налаштування

source: Heat Flow
es: Flujo de calor
it: Quantità calore
pt_br: Fluxo de Calor
ru: Тепловой поток
uk: Тепловий потік

source: Heat Generated (KJ/s)
es: Calor generado (KJ/s)
it: Calore generato (KJ/s)
pt_br: Calor Gerado (KJ/s)
ru: Вырабатываемое тепло (КДж/с)
uk: Вироблюване тепло (КДж/с)

source: Heat Generation Adjust
es: Ajuste de la generación del calor
it: Generazione calore
pt_br: Ajustar Geração de Calor
ru: Тепловыделение (Нагрев материала)
uk: Тепловиділення (Нагрівання матеріалу)

source: Heat Overlay
es: Superposición del calor
it: Mappa calore
pt_br: Distribuição de Calor
ru: Тепловое наложение
uk: Теплове накладення

source: HeatBlaster
es: Lanzallamas
pt_br: Disparador de Calor
ru: Тепловой Бластер
uk: Тепловий Бластер

source: HeatBlaster/CoolBlaster
es: Lanzallamas/Lanzafrio
pt_br: Disparador de Calor/Frio
ru: Тепловой Бластер/Ледяной Бластер
uk: Тепловий бластер/Крижаний бластер

source: Height Adjust
es: Ajuste de la altura
it: Altezza
pt_br: Ajuste de Altura
ru: Регулировка высоты
uk: Регулювання висоти

source: Help
es: Ayuda
it: Guida
pt_br: Ajuda
ru: Помощь
uk: Допомога

source: High-Quality Clouds
es: Nubes de alta Calidad
it: Nuvole in alta qualità
pt_br: Nuvens de Alta-Qualidade
ru: Качественные облака
uk: Високо-якісні хмари

source: High-Quality Rendering
es: Renderización de Alta Calidad
it: Visualizzazione in alta qualità
pt_br: Renderização de Alta-Qualidade
ru: Качественный рендеринг
uk: Якісний рендеринг

source: Higher values improve the rigidity of simulated structures, at the expense of longer computation times and decreased fragility.
es: Valores mas altos mejoran la rigidez de las estructuras simuladas, a expensa de largos tiempos de procesamiento y fragilidad disminuida.
it: Valori elevati migliorano la rigidità delle strutture, a discapito dei tempi di calcolo e della fragilità.
pt_br: Aumentar este valor melhora a rigidez das estruturas simuladas, mas resulta em maior tempo de processamento e reduz a propensão à fratura.
ru: Более высокие значения повышают жесткость моделируемых конструкций за счет увеличения времени вычислений и снижения хрупкости.
uk: Вищі значення покращують жорсткість змодельованих конструкцій за рахунок більшого часу обчислень та зменшення крихкості.

source: Horizontal and vertical offset of the ship, in meters
es: Desalineación vertical y horizontal del barco, en metros
it: Posizione orizzontale e verticale della nave, in metri
pt_br: Deslocamento horizontal e vertical do navio/objeto, em metros
ru: Горизонтальное и вертикальное смещение судна, в метрах
uk: Горизонтальний і вертикальний зсув судна, у метрах

source: How different other colors must be from the selected color in order to be erased.
es: Que tan diferentes otros colores tienen que ser del seleccionado para ser borrado.
it: La distanza massima di un colore dal colore selezionato entro la quale il colore viene rimosso.
pt_br: Quão diferentes as outras cores devem ser da cor selecionada para serem apagadas.
ru: Насколько другие цвета должны отличаться от выбранного цвета, чтобы их можно было стереть.
uk: Наскільки інші кольори мають відрізнятися від обраного кольору, щоб їх можна було стерти.

source: How much water is injected or drained by the flood tool (m3).
es: Cuanta agua es inyectada o drenada por la herramienta de inundación (m3)
it: La quantità d'acqua che viene immessa o rimossa dal tool Inonda/asciuga (m3).
pt_br: Define o volume de água (em metros cúbicos) que a Ferramenta de Inundação/Drenagem adiciona ou remove.
ru: Сколько воды закачивается или сливается устройством для затопления (м³).
uk: Скільки води закачується або зливається пристроєм для затоплення (м³).

source: How wide an area is affected by the scrub/rot tool (m).
es: Que tan ancha es el area afectada por la herramienta de Fregar/Oxidar (m).
it: L'ampiezza dell'area interessata dal tool Strofina/arrugginisci (m).
pt_br: Define a largura da área (em metros) impactada pela ferramenta da Esponja/Decomposição.
ru: Насколько широкую область воздействует инструмент для чистки/гниения (м).
uk: Наскільки широку область впливає інструмент для чищення/гниття (м).

source: How wide an area is flooded or drained by the flood tool (m).
es: Que tan ancha es es el área inundada o drenada por la herramienta de inundación (m).
it: L'ampiezza dell'area interessata dal tool Inonda/asciuga (m).
pt_br: Define a largura da área (em metros) impactada pela Ferramenta de Inundar/Drenar.
ru: Насколько широкая площадь затоплена или осушена инструментом для наводнения (м).
uk: Наскільки широка площа затоплена або осушена інструментом для повені (м).

source: Hull
es: Quilla
it: Scafo
pt_br: Casco
ru: Корпус
uk: Корпус

source: Hull Mode:
es: Modo de Quilla:
it: Modalità scafo:
pt_br: Modo de Casco:
ru: Режим корпуса:
uk: Режим корпусу:

source: Hydrostatic Pressure Adjust
es: Ajuste de presión hidrostática
it: Pressione idrostatica
pt_br: Ajustar Pressão Hidroestática
ru: Регулировка гидростатического давления
uk: Регулювання гідростатичного тиску

source: Ignition Temperature (K)
es: Temperatura de ignición (K)
it: Punto di combustione (K)
pt_br: Temperatura de Ignição:
ru: Температура воспламенения (K)
uk: Температура запалювання (K)

source: Image files
es: Archivos de Imagen
it: File immagini
pt_br: Arquivos de Imagem
ru: Файлы изображений
uk: Файли зображень

source: Impact Force Adjust
es: Ajuste de la fuerza de impacto
it: Forza d'impatto
pt_br: Ajustar Força de Impacto
ru: Регулировка силы удара
uk: Регулювання сили удару

source: Import
es: Importar
it: Importa
pt_br: Importar
ru: Импорт
uk: Імпорт

source: Import Electrical Layer
es: Importar capa eléctrica
it: Importa layer elettrico
pt_br: Importar Camada Elétrica
ru: Импортировать электрический слой
uk: Імпортувати електричний шар

source: Import Exterior Layer
es: Importar capa exterior
it: Importa layer esteriore
pt_br: Importar Camada Externa
ru: Импорт слоя наружной текстуры
uk: Імпорт зовнішнього шару

source: Import Interior Layer
es: Importar capa interior
it: Importa layer interno
pt_br: Importar Camada Interna
ru: Импорт слоя интерьерной текстуры
uk: Імпорт внутрішнього шару

source: Import Ropes Layer
es: Importar capas de cuerda
it: Importa layer funi
pt_br: Importar camada de cordas
ru: Импортировать слой канатов
uk: Імпортувати шар канатів

source: Import Structural Layer
es: Importar capa Estructural
it: Importa layer strutturale
pt_br: Importar Camada Estrutural
ru: Импорт структурного слоя
uk: Імпорт структурного шару

source: Import this layer from an image file.
es: Importar esta capa de otro archivo de imagen.
it: Importa questo layer da un file immagine.
pt_br: Importar esta camada de um arquivo de imagem.
ru: Импортируйте этот слой из файла изображения.
uk: Імпортуйте цей шар із файлу зображення.

source: Import this layer from another ship.
es: Importar esta capa de otro barco.
it: Importa questo layer da un'altra nave.
pt_br: Importar esta camada de um outro navio/objeto.
ru: Импортируйте этот слой из другого корабля.
uk: Імпортуйте цей шар з іншого корабля.

source: Incandescence
es: Incandecencia
it: Incandescenza
pt_br: Incandescência
ru: Накаливания
uk: Нажарювання

source: Indicates whether the ship is password-protected
es: Indica si el barco esta protegido por contraseña
it: Indica se la nave è protetta da una password
pt_br: Indica se o navio/objeto está protegido por senha
ru: Указывает, защищено ли судно паролем
uk: Вказує, чи захищене судно паролем

source: Initializing OpenGL...
es: Inicializando OpenGL...
it: Inizializzazione OpenGL...
pt_br: Inicializando OpenGL...
ru: Инициализация OpenGL ...
uk: Ініціалізація OpenGL ...

source: Initializing UI...
it: Inizializzazione interfaccia utente...
pt_br: Carregando a Interface do Usuário...
ru: Инициализация пользовательского интерфейса...
uk: Ініціалізація інтерфейсу користувача ...

source: Initializing graphics...
es: Inicializando Gráficos…
it: Inizializzazione grafica...
pt_br: Carregando os Gráficos...
ru: Инициализация графики ...
uk: Ініціалізація графіки ...

source: Initializing noise...
es: Inicializando Ruido...
it: Inizializzazione rumore...
pt_br: Carregando os...
ru: Инициализация шума ...
uk: Ініціалізація шуму ...

source: Inject Pressure Tool
es: Herramienta de inyección de presión
it: Strumento pressurizzazione
pt_br: Ferramenta de Injetar Pressão
ru: Инструмент для нагнетания давления
uk: Інструмент для нагнітання тиску

source: Inject/Remove Pressure
es: Inyectar/Remover Presión
it: Pressurizza/depressurizza
pt_br: Injetar/Remover Pressão
ru: Впрыснуть/Убрать давление
uk: Впорснути/Прибрати тиск

source: Instanced
es: Instanciado
it: Instanziato
pt_br: Instanciado
ru: Экземпляр
uk: Примірник

source: Interactive Switch
es: Llave interactiva
it: Interruttore interattivo
pt_br: Botão Interativo
ru: Интерактивный переключатель
uk: Інтерактивний перемикач

source: Interior Layer
es: Capa interior
it: Layer interno
pt_br: Camada Interior
ru: Слой Интерьера
uk: Внутрішній шар

source: Interior View
es: Vista Interior
it: Vista interno
pt_br: Visão Interior
ru: Вид Интерьера
uk: Внутрішній вигляд

source: Internal Pressure
es: Presión interna
it: Pressione interna
pt_br: Pressão Interna
ru: Внутреннее давление
uk: Внутрішній тиск

source: Internal pressure that the ship is initially spawned with, in atmospheres
es: Presión interna con la cual el barco es generado, en atmosferas
it: La pressione interna iniziale, in atmosfere
pt_br: Pressão interna com que o navio/objeto é gerado inicialmente, em atmosferas
ru: Внутреннее давление, с которым изначально порождается корабль, в атмосферах
uk: Внутрішній тиск, з яким спочатку породжується корабель, в атмосферах

source: Invalid Password
es: Contraseña incorrecta
it: Password non valida
pt_br: Senha Invalida
ru: Неверный пароль
uk: Невірний пароль

source: Invalid password!
es: Contraseña incorrecta!
it: La password non è valida!
pt_br: Senha inválida!
ru: Неверный пароль!
uk: Недійсний пароль!

source: It seems that a better name for this ship might be:
es: Parece que un mejor nombre para el barco podría ser:
it: Sembra che un nome migliore per questa nave possa essere:
pt_br: Pode ser que este nome se encaixaria melhor no seu objeto/navio:
ru: Кажется, что лучшим названием для этого корабля могло бы быть:
uk: Здається, що найкращою назвою для цього корабля могла б бути:

source: Jet
pt_br: Jato
ru: Реактивный двигатель
uk: Реактивний двигун

source: Kinetic Friction Adjust
es: Ajuste de la fricción cinética
it: Attrito cinetico
pt_br: Ajuste do Atrito Cinético
ru: Регулировка кинетичесеого сопротивления
uk: Регулювання кінетичного тертя

source: Lamp
es: Lampara
it: Lampada
pt_br: Lâmpada
ru: Лампа
uk: Лампа

source: Lamp Light
es: Luz de Lampara
it: Luce lampade
pt_br: Luz de Lampada
ru: Свет лампы
uk: Світло лампи

source: Land
es: Tierra
it: Fondale
pt_br: Terra
ru: Земля
uk: Земля

source: Language
es: Idioma
it: Lingua
pt_br: Linguagem
ru: Язык
uk: Мова

source: Laser Ray
es: Rayo Laser
it: Raggio laser
pt_br: Raio Laser
ru: Лазерный луч
uk: Лазерний промінь

source: LaserCannon
es: CañonLaser
it: Cannone laser
pt_br: Canhão a Laser
ru: ЛазернаяПушка
uk: ЛазернаГармата

source: Layers
es: Capas
pt_br: Camadas
ru: Слои
uk: Шари

source: Level of Detail
es: Nivel de detalle
it: Livello di dettaglio
pt_br: Nível de Detalhe
ru: Уровень детализации
uk: Рівень деталізації

source: Licensed under Creative Commons: By Attribution 4.0 License
es: Licenciado bajo creativos comunes: By Attribution 4.0 License
it: Rilasciato sotto licenza Creative Commons: By Attribution 4.0 License
pt_br: Licenciado sob Creative Commons: Atribuição 4.0 Internacional
ru: Лицензия Creative Commons: By Attribution 4.0 License
uk: Ліцензія Creative Commons: За ліцензією Attribution 4.0

source: Lightning Hit Probability
es: Probabilidad de golpe por rayo
it: Probabilità impatto fulmine
pt_br: Probabilidade de ser atingido por Raio
ru: Вероятность попадания молнии
uk: Імовірність потрапляння блискавки

source: LightningStrike
it: Folgore
ru: Удар Молнией
uk: Удар блискавки

source: Lights
es: Luces
it: Luci
pt_br: Luzes
ru: Свет
uk: Світло

source: Lights, Electricals, Marine Life
it: Luci, elettrotecnica, natura
pt_br: Luzes, Elementos Elétricos, Vida Marinha
ru: Свет, электрика, Морская жизнь
uk: Світло, електрика , Морське життя

source: Line Size:
es: Tamaño de la linea:
it: Dimensioni linea:
pt_br: Tamanho da Linha:
ru: Размер линии:
uk: Розмір лінії:

source: Lines mode: view ropes as lines.
es: Modo de líneas: Ver cuerdas como líneas.
it: Modalità linee: visualizza funi via linee.
pt_br: Modo Linhas: ver cordas como linhas.
ru: Режим "Линии": просмотр канатов в виде линий.
uk: Режим "Лінії": перегляд канатів у вигляді ліній.

source: Load
es: Cargar
it: Carica
pt_br: Carregar
ru: Загрузить
uk: Завантажити

source: Load Settings
es: Cargar configuraciones
it: Carica parametri
pt_br: Carregar Configurações
ru: Загрузить настройки
uk: Завантажити налаштування

source: Load Ship
es: Cargar Barco
it: Carica nave
pt_br: Carregar Objeto/Navio
ru: Загрузить корабль
uk: Завантажити корабель

source: Load Ship...
es: Cargar Barco...
it: Carica nave...
pt_br: Carregar Objeto/Navio...
ru: Загрузить корабль...
uk: Завантажити корабель...

source: Load a random ship
es: Cargar un barco aleatorio
it: Carica una nave a caso
pt_br: Carregar um objeto/navio aleatório
ru: Загрузить рандомный корабль
uk: Завантажити випадкове судно

source: Load a ship (Ctrl+O).
es: Cargar un Barco (Ctrl+O).
it: Carica una nave (Ctrl+O).
pt_br: Carregar um objeto/navio (Ctrl+O).
ru: Загрузить в корабль (Ctrl+O).
uk: Завантажити в корабель (Ctrl+O).

source: Load an Image
es: Cargar una Imagen
it: Carica un'immagine
pt_br: Carregar uma Imagem
ru: Загрузить изображение
uk: Завантажити зображення

source: Loading ShipBuilder...
es: Cargando constructor de barcos...
it: Caricamento ShipBuilder...
pt_br: Inicializando o Construtor de Navios...
ru: Загрузка ShipBuilder...
uk: Завантаження ShipBuilder...

source: Loading cloud texture atlas...
es: Cargando texturas de las nubes...
it: Caricamento nuvole...
pt_br: Carregando Texturas das Nuvens...
ru: Загрузка атласа текстур облаков...
uk: Завантаження атласу текстур хмар...

source: Loading electrical panel...
es: Cargando panel eléctrico...
it: Caricamento pannello elettrico...
pt_br: Carregando Painel Elétrico...
ru: Загрузка электрической панели...
uk: Завантаження електричної панелі...

source: Loading explosion texture atlas...
es: Cargando texturas de explosiones...
it: Caricamento esplosioni...
pt_br: Carregando Texturas de Explosão...
ru: Загрузка атласа текстур взрыва...
uk: Завантаження атласу текстур вибуху...

source: Loading fish texture atlas...
es: Cargando texturas de los peces...
it: Caricamento pesci...
pt_br: Carregando as Texturas dos Peixes...
ru: Загрузка атласа текстур рыб ...
uk: Завантаження атласу текстур риб ...

source: Loading fonts...
es: Cargando fuentes...
it: Caricamento font...
pt_br: Carregando as Fontes...
ru: Загрузка шрифтов...
uk: Завантаження шрифтів...

source: Loading generic textures...
es: Cargando texturas genéricas...
it: Caricamento textures generiche...
pt_br: Carregando as Texturas Genéricas...
ru: Загрузка стандартных текстур...
uk: Завантаження стандартних текстур...

source: Loading materials palette...
es: Cargando paleta de materiales...
it: Caricamento tavolozza materiali...
pt_br: Carregando as Paletas dos Materiais...
ru: Загрузка палитры материалов...
uk: Завантаження палітри матеріалів...

source: Loading music...
es: Cargando música...
it: Caricamento musica...
pt_br: Carregando as Músicas...
ru: Загрузка музыки...
uk: Завантаження музики...

source: Loading shaders...
es: Cargando sombreadores...
it: Caricamento shaders...
pt_br: Carregando Shaders...
ru: Загрузка шейдеров...
uk: Завантаження шейдерів...

source: Loading sounds...
es: Cargando sonidos...
it: Caricamento suoni...
pt_br: Carregando os Efeitos Sonoros...
ru: Загрузка звуков...
uk: Завантаження звуків...

source: Loading world textures...
es: Cargando texturas del mundo...
it: Caricamento textures del mondo...
pt_br: Carregando Texturas do Ambiente...
ru: Загрузка текстур мира...
uk: Завантаження текстур світу...

source: Loads the selected settings and applies them on top of the current settings.
es: Carga las configuraciones seleccionadas y las aplica sobre las configuraciones actuales.
it: Carica i parametri selezionati e li applica.
pt_br: Carrega as configurações selecionadas e as aplica sobre as configurações atuais.
ru: Загружает выбранные настройки и применяет их к текущим настройкам.
uk: Завантажує вибрані налаштування і застосовує їх до поточних налаштувань.

source: Logging
es: Registro de eventos
it: Finestra di log
pt_br: Logando
ru: Логирование
uk: Логування

source: Lowers the temperature at which materials start emitting red radiation, hence making incandescence more visible at lower temperatures.
es: Baja la temperatura a los cuales los materiales comienzan a brillar al rojo vivo, haciendo la incandescencia visible a mas bajas temperaturas.
it: Abbassa la temperatura alla quale i materiali iniziano ad emettere radiazione rossa, rendendo l'incandescenza visibile a temperature più basse.
pt_br: Reduz a temperatura na qual os materiais começam a emitir radiação vermelha, tornando a incandescência mais visível em temperaturas mais baixas.
ru: Снижает температуру, при которой материалы начинают излучать красное излучение, что делает накаливание более заметным при более низких температурах.
uk: Знижує температуру, за якої матеріали починають випромінювати червоне випромінювання, що робить розжарювання помітнішим за нижчих температур.

source: Luminescence
es: Luminiscencia
it: Luminescenza
pt_br: Luminiscência
ru: Люминесценция
uk: Люмінесценція

source: Luminescence Adjust
es: Ajuste de luminiscencia
it: Luminescenza
pt_br: Ajuste de Luminiscência
ru: Регулировка люминесценции
uk: Регулювання люмінесценції

source: MUSIC
es: MUSICA
it: MUSICA
pt_br: MÚSICA
ru: МУЗЫКА
uk: МУЗИКА

source: Magnifies or minimizes the physical size of NPCs.
es: Aumenta o disminuye el tamaño físico de los NPCs.
it: Ingrandisce o rimpicciolisce le dimensioni degli NPC.
pt_br: Amplia ou reduz o tamanho físico dos NPCs.
ru: Увеличивает или уменьшает физический размер НИПов.
uk: Збільшує або зменшує фізичний розмір НПС.

source: Magnifies or minimizes the physical size of fishes.
es: Aumenta o disminuye el tamaño físico de los peces.
it: Ingrandisce o rimpicciolisce le dimensioni dei pesci.
pt_br: Amplia ou reduz o tamanho físico dos peixes.
ru: Увеличивает или уменьшает физический размер рыб.
uk: Збільшує або зменшує фізичний розмір риб.

source: Magnifies or minimizes the physical size of plants.
it: Ingrandisce o rimpicciolisce le dimensioni delle piante acquatiche.
pt_br: Amplia ou reduz o tamanho físico das plantas.
ru: Увеличивает или уменьшает физический размер растений.
uk: Збільшує або зменшує фізичний розмір рослин.

source: Magnify the view (+).
es: Acercar la vista (+).
it: Ingrandisci (+).
pt_br: Ampliar a visualização (+).
ru: Увеличьте обзор (+).
uk: Збільште огляд (+).

source: Marine Plants
it: Piante acquatiche
pt_br: Plantas Marinhas
ru: Морские растения
uk: Морські рослини

source: Maritime Disaster
es: Desastre maritimo
it: Disastro marittimo
pt_br: Desastre Marítimo
ru: Морская катастрофа
uk: Морська катастрофа

source: Mass (Kg)
es: Masa (Kg)
it: Massa (Kg)
pt_br: Massa (Kg)
ru: Масса (кг)
uk: Маса (кг)

source: Material Textures
es: Texturas materiales
it: Texture dei materiali
pt_br: Texturas de Material
ru: Текстуры Материала
uk: Текстури Матеріалу

source: Material Textures mode.
es: Modo de texturas materiales.
it: Modalità texture dei materiali.
pt_br: Modo de Texturas Materiais.
ru: Режим "Текстуры материалов".
uk: Режим "Текстури матеріалів".

source: Material Textures mode: generates a texture using material-specific textures.
es: Modo de texturas materiales: Genera una textura usando una textura de un material especifico.
it: Modalità texture dei materiali: genera una texture utilizzando le proprietà dei materiali.
pt_br: Modo de Texturas Materiais: gera uma textura usando as texturas específicas de cada material.
ru: Режим "Текстуры материалов": генерирует текстуру, используя текстуры, специфичные для материала.
uk: Режим "Текстури матеріалів": генерує текстуру, використовуючи текстури, специфічні для матеріалу.

source: Matte mode: view texture as an opaque image.
es: Modo Mate: ver la textura como una imagen opaca.
it: Modalità tinta unita: visualizza texture come un'immagine piatta.
pt_br: Modo Opaco: visualizar a textura como uma imagem opaca.
ru: Матовый режим: просмотр текстуры как непрозрачного изображения.
uk: Матовий режим: перегляд текстури як непрозорого зображення.

source: Max Burning Particles
es: Máximas partículas incendiadas
it: Max # fiamme
pt_br: Máximo de Partículas em Combustão
ru: Максимальное количество горящих частиц
uk: Максимальна кількість частинок, що горять

source: Max NPCs
es: Máximos NPCs
it: Max # NPC
pt_br: NPC's máximos
ru: Максимальное количество НИПов
uk: Максимальна кількість НПС

source: Max Threads
es: Hilos Maximos
pt_br: Threads Máximos
ru: Максимальные Потоки
uk: Максимальні Потоки

source: Measure lengths.
es: Medir longitudes.
it: Misura lunghezze.
pt_br: Medir comprimentos.
ru: Измерьте длину.
uk: Виміряйте довжину.

source: Mechanics
es: Mecanicas
it: Meccanica
pt_br: Mecânicas
ru: Механика
uk: Механіка

source: Mechanics and Thermodynamics
es: Mecánicas y Termodinámicas
it: Meccanica e termodinamica
pt_br: Mecânicas e Termodinâmicas
ru: Механика и термодинамика
uk: Механіка та термодинаміка

source: Melting Point Adjust
es: Ajuste del punto de fusión
it: Punto di fusione
pt_br: Ajustar Ponto de Fusão
ru: Точка плавления
uk: Точка плавлення

source: Melting Temperature (K)
es: Temperatura de fusión (K)
it: Punto di fusione (K)
pt_br: Temperatura de Fusão
ru: Температура плавления (K)
uk: Температура плавлення (K)

source: Mesh mode: view the structural mesh as it is induced by the structure particles.
es: Modo de malla: ver la malla estructural como es inducida por las partículas estructurales.
it: Modalità struttura: visualizza la struttura derivata dalle particelle strutturali.
pt_br: Modo de malha: visualizar a malha estrutural conforme ela é induzida pelas partículas da estrutura.
ru: Режим сетки: просмотр структурной сетки в том виде, в котором она индуцируется частицами структуры.
uk: Режим сітки: перегляд структурної сітки в тому вигляді, в якому вона індукується частинками структури.

source: Metadata
es: Metadatos
it: Proprietà
pt_br: Metadados
ru: Метаданные
uk: Метадані

source: Miscellaneous
es: Varios
it: Vari
pt_br: Diversos
ru: Разнообразный
uk: Різноманітний

source: Mode
es: Modo
it: Modalità
pt_br: Modo
ru: Режим
uk: Режим

source: Modulate Wind
es: Modular viento
it: Modula vento
pt_br: Modulação de Vento
ru: Модулировать Ветра
uk: Модулювати Вітри
